{
  "subjects": [
    {
      "type": "series",
      "content": "חפץ חיים"
    },
    {
      "type": "title",
      "content": "הלכות לשון הרע כלל א"
    },
    {
      "type": "author",
      "content": "ד\"ר אורן משלי"
    },
    {
      "type": "image",
      "content": "https://upload.wikimedia.org/wikipedia/he/f/ff/%D7%97%D7%A4%D7%A5_%D7%97%D7%99%D7%99%D7%9D.jpg"
    },
    {
      "content": [
        "\"מִי הָאִישׁ הֶחָפֵץ חַיִּים, אֹהֵב יָמִים לִרְאוֹת טוֹב. נְצֹר לְשׁוֹנְךָ מֵרָע, וּשְׂפָתֶיךָ מִדַּבֵּר מִרְמָה\" (תהילים ל\"ד, י\"ג).",
        "הספר \"חפץ חיים\" חובר על ידי הרב ישראל מאיר הכהן בשנת 1873 והפך לספר העיקרי על הלכות לשון הרע. על שם ספר זה קיבל הרב המחבר את כינויו \"החפץ חיים\".",
        "הספר כולל כמה פתיחות והקדמות, ושני חלקים מרכזיים: הלכות לשון הרע בהן נעסוק, והלכות רכילות.",
        "הלכות לשון הרע מחולקות לתשעה \"כללים\". בשיעור זה נעסוק **בכלל א**.",
        "לימוד מועיל!"
      ],
      "type": "guidelines"
    },
    {
      "content": [
        "סעיף א @@@ אָסוּר לְסַפֵּר בִּגְנוּת חֲבֵרוֹ אֲפִלּוּ עַל אֱמֶת גָּמוּר וְזֶה נִקְרָא בְּפִי חֲזַ\"ל בְּכָל מָקוֹם לָשׁוֹן הָרָע, (דְּאִם יֵשׁ בְּהַסִפּוּר שֶׁלּוֹ תַּעֲרוֹבוֹת שֶׁל שֶׁקֶר וַעֲבוּר זֶה נִתְגַּנָּה חֲבֵרוֹ יוֹתֵר הוּא בִּכְלַל מוֹצִיא שֵׁם רָע וַעֲוֹנוֹ גָּדוֹל הַרְבֵּה יוֹתֵר), וְהַמְסַפֵּר עוֹבֵר בְּלֹא תַעֲשֶׂה, שֶׁנֶּאֱמַר (ויקרא י\"ט ט\"ז): \"לֹא תֵלֵךְ רָכִיל בְּעַמֶיךָ\", וְזֶה גַּם כֵּן בִּכְלַל רְכִילוּת הוּא.",
        "סעיף ב @@@ הַלָּאו זֶה שֶׁכָּתַבְנוּ הוּא מַה שֶּׁכְּתַבְתּוֹ הַתּוֹרָה בְּפֵרוּשׁ מְיֻחָד לְאִסוּר זֶה שֶׁל לָשׁוֹן הָרָע וּרְכִילוּת, אֲבָל בְּלָאו הָכִי (בלא זה) יֵשׁ עוֹד הַרְבֵּה לָאוִין וַעֲשִׂין אֲחֵרִים, שֶׁהוּא עוֹבֵר עֲלֵיהֶן עַל יְדֵי סִפּוּר הָרַע הַזֶּה, כַּמְבֹאָר לְעֵיל בַּפְּתִיחָה הַקוֹדֶמֶת, עַיֵּן שָׁם."
      ],
      "type": "materials",
      "title": "חפץ חיים כלל א"
    },
    {
      "content": [
        "האיסור לספר דברי גנאי על חברו אפילו שהם אמת גמורה",
        "האיסור לספר דברי גנאי על חברו שאין בהם כלל מן האמת",
        "האיסור לספר דברי גנאי על חברו שיש בהם תערובת אמת ושקר"
      ],
      "type": "single_choice",
      "question": "מהו איסור \"לשון הרע\"?"
    },
    {
      "content": [
        "מוציא שם רע",
        "בעל לשון הרע",
        "הולך רכיל",
        "מוציא לעז רע"
      ],
      "type": "single_choice",
      "question": "כיצד נקרא מי שמספר בגנות חברו דברים שקריים?"
    },
    {
      "content": [
        "\"לא תלך רכיל בעמיך\"",
        "\"לא תעמוד על דם רעך\"",
        "\"לא תשא שמע שוא\"",
        "\"לא תשנא את חברך בלבבך\""
      ],
      "type": "single_choice",
      "question": "מהו הפסוק *המפורש* בתורה הנוגע לאיסור לשון הרע?"
    },
    {
      "content": [
        "סעיף ג @@@ כָּל זֶה, אֲפִלּוּ אִם רַק בְּמִקְרֶה סִפֵּר גְּנוּת חֲבֵרוֹ, אֲבָל אִם, חַס וְשָׁלוֹם, הֻרְגַּל בְּעָוֹן זֶה בִּתְמִידוּת, כְּמוֹ אֵלּוּ שֶׁרְגִילִין תָּמִיד לֵישֵׁב וּלְסַפֵּר: כָּךְ וְכָךְ מַעֲשֵׂה פְּלוֹנִי, כָּךְ וְכָךְ עָשׂוּ אֲבוֹתָיו, כָּךְ וְכָךְ שָׁמַעְתִּי עָלָיו, וְהוּא דְּבָרִים שֶׁל גְּנוּת, אֲנָשִׁים כָּאֵלּוּ הֵם נִקְרָאִין בְּפִי חֲזַ\"ל בְּשֵׁם בַּעֲלֵי לָשׁוֹן הָרָע וְעָנְשָׁן הַרְבֵּה יוֹתֵר גָּדוֹל, אַחֲרֵי שֶׁבִּשְׁאָט נַפְשָׁם וּזְדוֹן לִבָּם עוֹבְרִין עַל תּוֹרַת ה', וְנַעֲשָׂה זֶה אֶצְלָם כְּהֶפְקֵר, כְּמוֹ שֶׁמְבֹאָר לְעֵיל בְּסוֹף הַפְּתִיחָה, וַעֲלֵיהֶם נֶאֱמַר בַּקַבָּלָה: \"יַכְרֵת ה' כָּל שִׂפְתֵי חֲלָקוֹת לָשׁוֹן מְדַבֶּרֶת גְּדֹלוֹת\" (תהלים י\"ב ד')."
      ],
      "type": "materials",
      "title": "חפץ חיים כלל א"
    },
    {
      "content": [
        "אלו הרגילים לספר לשון הרע באופן תמידי",
        "אלו אשר מספרים עליהם לשון הרע באופן תמידי",
        "אלו המוכיחים את הציבור על לשון הרע באופן תמידי"
      ],
      "type": "single_choice",
      "question": "מיהם הנקראים בפי חז\"ל בשם \"בעלי לשון הרע\"?"
    },
    {
      "content": [
        "סעיף ד @@@ אָמְרוּ חֲזַ\"ל: עַל שָׁלש עֲבֵרוֹת נִפְרָעִין מִן הָאָדָם בָּעוֹלָם הַזֶּה, וְאֵין לוֹ חֵלֶק לָעוֹלָם הַבָּא, וְאֵלּוּ הֵן: עֲבוֹדָה זָרָה וְגִלּוּי עֲרָיוֹת וּשְׁפִיכוּת דָּמִים, וְלָשׁוֹן הָרָע נֶגֶד כֻּלָּן. וְהֵבִיאוּ חֲזַ\"ל עַל זֶה רְאָיָה מִן הַכְּתוּבִים, וּפֵרְשׁוּ הָרִאשׁוֹנִים, דְּהַכַּוָּנָה עַל אֵלּוּ שֶׁהֻרְגְּלוּ בּעוֹן זֶה בִּתְמִידוּת, וְאֵין מְקָבְּלִים עַל עַצְמָם לְהִשָּׁמֵר מִמֶנּוּ, מִפְּנֵי שֶׁנַּעֲשָׂה הַדָּבָר אֶצְלָם כְּהֶתֵּר."
      ],
      "type": "materials",
      "title": "חפץ חיים כלל א"
    },
    {
      "content": [
        "על בעלי לשון הרע",
        "על מספרי לשון הרע",
        "על המוציאים שם רע"
      ],
      "type": "single_choice",
      "question": "על מי נאמר שעוונם חמור מעבודה זרה, גילוי עריות, ושפיכות דמים?"
    },
    {
      "content": [
        "סעיף ה @@@ אֵין חִלּוּק בְּאִסוּר הַסִפּוּר, בֵּין אִם סִפֵּר מֵעַצְמוֹ בִּרְצוֹנוֹ וּבֵין אִם עָמַד עָלָיו חֲבֵרוֹ בִּדְבָרִים וְהִפְצִירוֹ עַד שֶׁיְּסַפֵּר לוֹ, מִכָּל מָקוֹם אָסוּר. וַאֲפִלּוּ אָבִיו אוֹ רַבּוֹ, שֶׁמְחֻיָּב בִּכְבוֹדָם וּבְמוֹרָאָם, שֶׁלֹּא לִסְתֹּר דִּבְרֵיהֶם, אִם הֵם בִּקְשׁוּ מִמֶנּוּ שֶׁיְּסַפֵּר לָהֶם עִנְיַן פְּלוֹנִי וּפְלוֹנִי, וְהוּא יוֹדֵעַ, שֶׁבְּתוֹךְ הַסִפּוּר יֻכְרַח לָבוֹא לִידֵי לָשׁוֹן הָרָע אוֹ אֲפִלּוּ רַק לְאָבָק שֶׁל לָשׁוֹן הָרָע, אָסוּר לוֹ לִשְׁמֹעַ לָהֶם."
      ],
      "type": "materials",
      "title": "חפץ חיים כלל א"
    },
    {
      "content": [
        "לא",
        "כן"
      ],
      "type": "single_choice",
      "question": "מי שחבריו לוחצים ומפצירים בו שיספר דבר מה בגנות אדם פלוני. האם מותר לו לספר?"
    },
    {
      "content": [
        "אסור לו לספר להם בשום אופן",
        "יספר להם מבלי לציין את שמו של האדם המדובר",
        "יספר להם אך ילמד זכות על האדם המדובר"
      ],
      "type": "single_choice",
      "question": "מי שאביו או רבו, שהוא חייב בכבודם ומוראם, מבקשים ממנו לספר דבר אשר יביאו בהכרח לידי לשון הרע. כיצד ינהג?"
    },
    {
      "content": [
        "סעיף ו @@@ אֲפִלּוּ אִם הוּא רוֹאֶה, שֶׁאִם הוּא יַרְגִּיל עַצְמוֹ בַּמִדָּה הַזֹּאת, שֶׁלֹּא לְסַפֵּר לְעוֹלָם בִּגְנוּתוֹ שֶׁל יִשְׂרָאֵל, וְכָדּוֹמֶה מִדִּבּוּרִים הָאֲסוּרִים, יְסֻבַּב לוֹ הֶפְסֵד גָּדוֹל בְּעִנְין פַּרְנָסָתוֹ, כְּגוֹן, שֶׁהוּא תַּחַת רְשׁוּת אֲחֵרִים, וְהֵם אֲנָשִׁים שֶׁאֵין בָּהֶם רֵיחַ תּוֹרָה, וְיָדוּע הוּא, שֶׁבַּעֲוֹנוֹתֵינוּ הָרַבִּים, אֲנָשִׁים כָּאֵלּוּ הֵם פְּרוּצִים מְאֹד בְּזֶה הֶעָוֹן הֶחָמוּר, עַד שֶׁאִם יִרְאוּ אֶת מִי, שֶׁאֵין פִּיו פָּתוּחַ כָּל כָּךְ כְּמוֹתָם, יַחֲזִיקוּ אוֹתוֹ לְשׁוֹטֶה וּפֶתִי, וְעַל יְדֵי זֶה יְסַלְּקוּהוּ מִמִשְׁמַרְתּוֹ וְלֹא יִהְיֶה לוֹ בַּמֶה לְפַרְנֵס אֶת בְּנֵי בֵּיתוֹ, אַף עַל פִּי כֵן אָסוּר, כְּכָל שְׁאָר לָאוִין, שֶׁמְחֻיָּב לִתֵּן כָּל אֲשֶׁר לוֹ וְלֹא לַעֲבֹר עֲלֵיהֶן, כַּמְבֹאָר בְּיוֹרֶה דֵּעָה (בסימן קנ\"ז סעיף א' בהגה\"ה), עַיֵּן שָׁם."
      ],
      "type": "materials",
      "title": "חפץ חיים כלל א"
    },
    {
      "content": [
        "גם במקרה כזה אסור לו לספר לשון הרע",
        "במקרה כזה מותר לו לספר לשון הרע",
        "במקרה כזה מותר לו לספר רק אבק לשון הרע"
      ],
      "type": "single_choice",
      "question": "מה יעשה מי שפרנסתו עלולה להיפגע עד כדי פיטוריו אם יסרב לספר לשון הרע במקום עבודתו ולהיות \"כמו כולם\"?"
    },
    {
      "content": [
        "סעיף ז @@@ ...וְעַל זֶה וְכַיּוֹצֵא בָּזֶה אָמְרוּ חֲזַ\"ל: מוּטָב לְאָדָם שֶׁיִּקָרֵא שׁוֹטֶה כָּל יָמָיו, וְאָל יִהְיֶה רָשָׁע שָׁעָה אַחַת לִפְנֵי הַמָקוֹם, וִיזָרֵז עַצְמוֹ בִּשְׁעַת מָעֲשֶׂה בְּכָל כֹּחוֹתָיו לַעֲמֹד עָל נָפְשׁוֹ וְיִהְיֶה נָכוֹן לִבּוֹ בָּטוּחַ, כִּי שְׂכָרוֹ יִהְיֶה עֲבוּר זֶה מֵה' יִתְבָּרַךְ עַד אֵין קֵץ, כְּמַאֲמַר חֲזַ\"ל: לְפוּם צַעֲרָא אגְרָא (כפי הצער השכר). וְאִיתָא (וכָתוּב) בְּאָבוֹת דְּרַבִּי נָתָן, כִּי פַּעַם אַחַת בְּצַעַר מִמֵאָה פְּעָמִים שֶׁלֹּא בְּצַעַר, (וּבֵאוּרוֹ: כִּי דְּבַר מִצְוָה אוֹ לִפְרֹש מִדְּבַר אִסוּר שֶׁבָּא לוֹ עַל יְדֵי צַעַר, שְׂכָרוֹ מֵאָה פְּעָמִים יוֹתֵר מִמִצְוָה אַחֶרֶת כְּמוֹתָה, שֶׁבָּא לוֹ שֶׁלֹּא בְּצַעַר)..."
      ],
      "type": "materials",
      "title": "חפץ חיים כלל א"
    },
    {
      "content": [
        "שכר מצווה זו יהיה גדול משכר מצווה אחרת שקל לו לעשותה",
        "שכר מצווה זו יהיה קטן משכר מצווה אחרת שקל לו לעשותה",
        "שכר מצווה זו יהיה שווה לכל מצווה אחרת בין קשה בין קלה",
        "אין לנו הבנה כלל בשכר המצוות מי יותר ומי פחות"
      ],
      "type": "single_choice",
      "question": "אדם שקיום מצווה מסויימת קשה עליו מאוד ודורש התגברות ומאמץ רב, מה נוכל לומר על שכרו בעשייתה?"
    },
    {
      "content": [
        "סעיף ח @@@ אִסוּר זֶה שֶׁל לָשׁוֹן הָרָע הוּא בֵּין אִם הוּא מְסַפֵּר עָלָיו בְּפִיו מַמָשׁ, אוֹ שֶׁהוּא כּוֹתֵב עָלָיו דָּבָר זֶה בְּמִכְתָּבוֹ, וְגַם אֵין בּוֹ חִלּוּק בֵּין אִם הוּא מְסַפֵּר עָלָיו הַלָשׁוֹן הָרָע שֶׁלּוֹ בְּפֵרוּשׁ וּבֵין אִם הוּא מְסַפֵּר עָלָיו הַלָשׁוֹן הָרָע בְּדֶרֶךְ רֶמֶז, בְּכָל גַּוְנֵי (בכל האפנים) בִּכְלַל לָשׁוֹן הָרָע הוּא."
      ],
      "type": "materials",
      "title": "חפץ חיים כלל א"
    },
    {
      "content": [
        "כן",
        "לא"
      ],
      "type": "single_choice",
      "question": "האם איסור לשון הרע - לספר בגנות חברו - שייך גם בכתיבת סמס או הודעה בווטסאפ?"
    },
    {
      "content": [
        "לא",
        "כן"
      ],
      "type": "single_choice",
      "question": "האם מותר לאדם לספר לשון הרע בדרך רמז כלומר באופן לא מפורש?"
    },
    {
      "content": [
        "סעיף ט @@@ וְדַע עוֹד, דַּאֲפִלּוּ אִם בְּתוֹךְ הַגְּנוּת, שֶׁגִּנָּה אֶת חֲבֵרוֹ, גִּנָּה אֶת עַצְמוֹ גַּם כֵּן בָּזֶה הַגְּנוּת גּוּפָא, וַאֲפִלּוּ הִקְדִּים לְהִתְרַעֵם עַל עַצְמוֹ בָּזֶה, אֲפִלּוּ הָכֵי (אף על פי כן) מִכְּלָל דֵּילָטוֹרְיָא לָא נָפְקֵי (לא יצא)."
      ],
      "type": "materials",
      "title": "חפץ חיים כלל א"
    },
    {
      "content": [
        "כן",
        "לא"
      ],
      "type": "single_choice",
      "question": "אדם שגינה את חברו **וגם את עצמו** באותו הסיפור, האם זה נחשב כלשון הרע?"
    }
  ]
}