{
  "subjects": [
    {
      "type": "series",
      "content": "משנה תורה בקיאות"
    },
    {
      "type": "title",
      "content": "הלכות תשובה פרק א"
    },
    {
      "type": "author",
      "content": "ד\"ר אורן משלי"
    },
    {
      "type": "image",
      "content": "https://1.bp.blogspot.com/-w_mqhphAiaA/UdAMxaoWImI/AAAAAAAAFz0/p4MUO3Iluag/s306/maimonides.jpg"
    },
    {
      "content": [
        "הלכות תשובה להרמב\"ם מסיימות את **ספר המדע** ומכילות 10 פרקים, עם נושאים כגון תשובה, בחירת האדם, שכר ועונש, ועוד.",
        "ארבעת הפרקים הראשונים עוסקים בנושא התשובה, ושיעור זה מתמקד בפרק הראשון.",
        "לימוד מהנה!"
      ],
      "type": "guidelines"
    },
    {
      "content": [
        "פתיחה @@@ מִצְוַת עֲשֵׂה אַחַת. וְהוּא שֶׁיָּשׁוּב הַחוֹטֵא מֵחֶטְאוֹ לִפְנֵי ה' וְיִתְוַדֶּה: וּבֵאוּר מִצְוָה זוֹ וְעִקָרִים הַנִּגְרָרִים עִמָהּ בִּגְלָלָהּ בִּפְרָקִים אֵלוּ:"
      ],
      "type": "materials",
      "title": "הלכות תשובה"
    },
    {
      "content": [
        "מצווה עשה אחת",
        "מצוות לא תעשה אחת",
        "שתי מצוות עשה",
        "שתי מצוות לא תעשה"
      ],
      "type": "single_choice",
      "question": "כמה מצוות ומאיזה סוג מבוארות על ידי הרמב\"ם בהלכות תשובה?"
    },
    {
      "content": [
        "הלכה א @@@ כָּל מִצְוֹת שֶׁבַּתּוֹרָה בֵּין עֲשֵׂה בֵּין לֹא תַּעֲשֶׂה אִם עָבַר אָדָם עַל אַחַת מֵהֶן בֵּין בְּזָדוֹן בֵּין בִּשְׁגָגָה כְּשֶׁיַּעֲשֶׂה תְּשׁוּבָה וְיָשׁוּב מֵחֶטְאוֹ חַיָּב לְהִתְוַדּוֹת לִפְנֵי הָאֵל בָּרוּךְ הוּא שֶׁנֶּאֱמַר (במדבר ה-ו) 'אִישׁ אוֹ אִשָּׁה כִּי יַעֲשׂוּ' וְגוֹ' (במדבר ה-ז) 'וְהִתְוַדּוּ אֶת חַטָּאתָם אֲשֶׁר עָשׂוּ' זֶה וִדּוּי דְּבָרִים. וִדּוּי זֶה מִצְוַת עֲשֵׂה. כֵּיצַד מִתְוַדִּין. אוֹמֵר אָנָּא הַשֵּׁם חָטָאתִי עָוִיתִי פָּשַׁעְתִּי לְפָנֶיךָ וְעָשִׂיתִי כָּךְ וְכָךְ וַהֲרֵי נִחַמְתִּי וּבֹשְׁתִּי בְּמַעֲשַׂי וּלְעוֹלָם אֵינִי חוֹזֵר לְדָבָר זֶה. וְזֶהוּ עִקָּרוֹ שֶׁל וִדּוּי. וְכָל הַמַּרְבֶּה לְהִתְוַדּוֹת וּמַאֲרִיךְ בְּעִנְיָן זֶה הֲרֵי זֶה מְשֻׁבָּח."
      ],
      "type": "materials",
      "title": "הלכות תשובה פרק א"
    },
    {
      "content": [
        "עליו להתוודות לפני ה' בפיו",
        "עליו להתפלל אל ה' שיקבל תשובתו",
        "עליו להקריב קרבן לה' בבית המקדש"
      ],
      "type": "single_choice",
      "question": "מה חייב אדם לעשות בשעה שיעשה תשובה על חטאו?"
    },
    {
      "content": [
        "הודאה בחטא",
        "פירוט מעשה החטא",
        "הבעת חרטה על החטא",
        "הודעה שלעולם לא ישוב על החטא",
        "הודעה שישתדל לא לשוב על החטא",
        "פירוט סיבות החטא"
      ],
      "type": "multiple_choice",
      "num_of_correct": "4",
      "question": "מה מהבאים נכלל בסדר הוידוי?"
    },
    {
      "content": [
        "הלכה א @@@ וְכֵן בַּעֲלֵי חַטָּאוֹת וַאֲשָׁמוֹת בְּעֵת שֶׁמְּבִיאִין קָרְבְּנוֹתֵיהֶן עַל שִׁגְגָתָן אוֹ עַל זְדוֹנָן אֵין מִתְכַּפֵּר לָהֶן בְּקָרְבָּנָם עַד שֶׁיַּעֲשׂוּ תְּשׁוּבָה וְיִתְוַדּוּ וִדּוּי דְּבָרִים שֶׁנֶּאֱמַר (ויקרא ה-ה) 'וְהִתְוַדָּה אֲשֶׁר חָטָא עָלֶיהָ'."
      ],
      "type": "materials",
      "title": "הלכות תשובה פרק א"
    },
    {
      "content": [
        "לא",
        "כן"
      ],
      "type": "single_choice",
      "question": "האם בזמן שבית המקדש קיים, הקרבת קרבן חטאת או אשם מחליפה את הצורך בוידוי?"
    },
    {
      "content": [
        "הלכה ב @@@ שָׂעִיר הַמִּשְׁתַּלֵּחַ לְפִי שֶׁהוּא כַּפָּרָה עַל כָּל יִשְׂרָאֵל כֹּהֵן גָּדוֹל מִתְוַדֶּה עָלָיו עַל לְשׁוֹן כָּל יִשְׂרָאֵל שֶׁנֶּאֱמַר (ויקרא טז-כא) 'וְהִתְוַדָּה עָלָיו אֶת כָּל עֲוֹנֹת בְּנֵי יִשְׂרָאֵל'.  שָׂעִיר הַמִּשְׁתַּלֵּחַ מְכַפֵּר עַל כָּל עֲבֵרוֹת שֶׁבַּתּוֹרָה, הַקַּלּוֹת וְהַחֲמוּרוֹת, בֵּין שֶׁעָבַר בְּזָדוֹן בֵּין שֶׁעָבַר בִּשְׁגָגָה, בֵּין שֶׁהוֹדַע לוֹ בֵּין שֶׁלֹּא הוֹדַע לוֹ, הַכּל מִתְכַּפֵּר בְּשָׂעִיר הַמִּשְׁתַּלֵּחַ. וְהוּא שֶׁעָשָׂה תְּשׁוּבָה. אֲבָל אִם לֹא עָשָׂה תְּשׁוּבָה אֵין הַשָּׂעִיר מְכַפֵּר לוֹ אֶלָּא עַל הַקַּלּוֹת. וּמַה הֵן הַקַּלּוֹת וּמַה הֵן הַחֲמוּרוֹת. הַחֲמוּרוֹת הֵן שֶׁחַיָּבִין עֲלֵיהֶם מִיתַת בֵּית דִּין אוֹ כָּרֵת. וּשְׁבוּעַת שָׁוְא וָשֶׁקֶר אַף עַל פִּי שֶׁאֵין בָּהֶן כָּרֵת הֲרֵי הֵן מִן הַחֲמוּרוֹת. וּשְׁאָר מִצְוֹת לֹא תַּעֲשֶׂה וּמִצְוֹת עֲשֵׂה שֶׁאֵין בָּהֶן כָּרֵת הֵם הַקַּלּוֹת:"
      ],
      "type": "materials",
      "title": "הלכות תשובה פרק א"
    },
    {
      "content": [
        "שעיר המשתלח",
        "קרבן עולה ויורד",
        "חטאת ציבור",
        "אשם ודאי"
      ],
      "type": "single_choice",
      "question": "כיצד נקרא הקרבן המכפר על כל ישראל?"
    },
    {
      "content": [
        "עבירה שחייבים עליה מיתת בית דין",
        "עבירה שחייבים עליה כרת",
        "עבירה על שבועת שווא ושקר",
        "עבירה שנעשתה בזדון",
        "עבירה שחייבים עליה מלקות ארבעים"
      ],
      "type": "multiple_choice",
      "num_of_correct": "3",
      "question": "מהי עבירה \"חמורה\"?"
    },
    {
      "content": [
        "השעיר מכפר ללא קשר לנסיבות",
        "כאשר נעשתה תשובה על העבירה",
        "כאשר העבירה נעשתה בשוגג"
      ],
      "type": "single_choice",
      "question": "באלו נסיבות מכפר השעיר המשתלח על עבירות \"קלות\"?"
    },
    {
      "content": [
        "כאשר נעשתה תשובה על העבירה",
        "השעיר מכפר ללא קשר לנסיבות",
        "כאשר העבירה נעשתה בשוגג",
        "השעיר איננו מכפר על עבירות חמורות"
      ],
      "type": "single_choice",
      "question": "באלו נסיבות מכפר השעיר המשתלח על עבירות \"חמורות\"?"
    },
    {
      "content": [
        "הלכה ד @@@ אַף עַל פִּי שֶׁהַתְּשׁוּבָה מְכַפֶּרֶת עַל הַכּל וְעַצְמוֹ שֶׁל יוֹם הַכִּפּוּרִים מְכַפֵּר. יֵשׁ עֲבֵרוֹת שֶׁהֵן מִתְכַּפְּרִים לִשְׁעָתָן וְיֵשׁ עֲבֵרוֹת שֶׁאֵין מִתְכַּפְּרִים אֶלָּא לְאַחַר זְמַן. כֵּיצַד. עָבַר אָדָם עַל מִצְוַת עֲשֵׂה שֶׁאֵין בָּהּ כָּרֵת וְעָשָׂה תְּשׁוּבָה אֵינוֹ זָז מִשָּׁם עַד שֶׁמּוֹחֲלִין לוֹ, וּבְאֵלּוּ נֶאֱמַר (ירמיה ג-כב) 'שׁוּבוּ בָּנִים שׁוֹבָבִים אֶרְפָּה מְשׁוּבֹתֵיכֶם' וְגוֹ'. עָבַר עַל מִצְוַת לֹא תַּעֲשֶׂה שֶׁאֵין בָּהּ כָּרֵת וְלֹא מִיתַת בֵּית דִּין וְעָשָׂה תְּשׁוּבָה, תְּשׁוּבָה תּוֹלָה וְיוֹם הַכִּפּוּרִים מְכַפֵּר, וּבְאֵלּוּ נֶאֱמַר (ויקרא טז-ל) 'כִּי בַיּוֹם הַזֶּה יְכַפֵּר עֲלֵיכֶם'."
      ],
      "type": "materials",
      "title": "הלכות תשובה פרק א"
    },
    {
      "content": [
        "עבירה על מצוות עשה שאין בה כרת",
        "עבירה על מצוות עשה שאין בה מיתת בין דין",
        "עבירה על מצוות לא תעשה שאין בה כרת",
        "עבירה על מצוות לא תעשה שאין בה מיתת בין דין"
      ],
      "type": "single_choice",
      "question": "איזו עבירה כפרתה אפשרית מיד כשהאדם עשה תשובה?"
    },
    {
      "content": [
        "עבירה על מצוות לא תעשה שאין בה כרת",
        "עבירה על מצוות לא תעשה שאין בה מיתת בין דין",
        "עבירה על מצוות עשה שאין בה כרת",
        "עבירה על מצוות עשה שאין בה מיתת בין דין"
      ],
      "type": "multiple_choice",
      "num_of_correct": "2",
      "question": "איזו עבירה כפרתה אפשרית רק לאחר תשובה ויום הכיפורים?"
    },
    {
      "content": [
        "הלכה ד @@@ עָבַר עַל כְּרֵתוֹת וּמִיתוֹת בֵּית דִּין וְעָשָׂה תְּשׁוּבָה, תְּשׁוּבָה וְיוֹם הַכִּפּוּרִים תּוֹלִין וְיִסּוּרִין הַבָּאִין עָלָיו גּוֹמְרִין לוֹ הַכַּפָּרָה. וּלְעוֹלָם אֵין מִתְכַּפֵּר לוֹ כַּפָּרָה גְּמוּרָה עַד שֶׁיָּבוֹאוּ עָלָיו יִסּוּרִין, וּבְאֵלּוּ נֶאֱמַר (תהילים פט-לג) 'וּפָקַדְתִּי בְשֵׁבֶט פִּשְׁעָם וּבִנְגָעִים עֲוֹנָם'. בַּמֶּה דְּבָרִים אֲמוּרִים בְּשֶׁלֹּא חִלֵּל אֶת הַשֵּׁם בְּשָׁעָה שֶׁעָבַר אֲבָל הַמְחַלֵּל אֶת הַשֵּׁם אַף עַל פִּי שֶׁעָשָׂה תְּשׁוּבָה וְהִגִּיעַ יוֹם הַכִּפּוּרִים וְהוּא עוֹמֵד בִּתְשׁוּבָתוֹ וּבָאוּ עָלָיו יִסּוּרִין אֵינוֹ מִתְכַּפֵּר לוֹ כַּפָּרָה גְּמוּרָה עַד שֶׁיָּמוּת. אֶלָּא תְּשׁוּבָה יוֹם הַכִּפּוּרִים וְיִסּוּרִין שְׁלָשְׁתָּן תּוֹלִין וּמִיתָה מְכַפֶּרֶת שֶׁנֶּאֱמַר (ישעיה כב-יד) 'וְנִגְלָה בְאָזְנָי ה' צְבָאוֹת' וְגוֹ' (ישעיה כב-יד) 'אִם יְכֻפַּר הֶעָוֹן הַזֶּה לָכֶם עַד תְּמֻתוּן':"
      ],
      "type": "materials",
      "title": "הלכות תשובה פרק א"
    },
    {
      "content": [
        "עבירה שיש בה כרת",
        "עבירה שיש בה מיתת בין דין",
        "עבירה שיש בה חילול השם",
        "עבירה שיש בה מלקות ארבעים"
      ],
      "type": "multiple_choice",
      "num_of_correct": "2",
      "question": "איזו עבירה כפרתה אפשרית רק לאחר שיבואו על האדם יסורין?"
    },
    {
      "content": [
        "עבירה שיש בה חילול השם",
        "עבירה שיש בה כרת",
        "עבירה שיש בה מיתת בין דין",
        "עבירה שיש בה מלקות ארבעים"
      ],
      "type": "single_choice",
      "question": "איזו עבירה כפרתה אפשרית רק לאחר מיתתו של האדם?"
    }
  ]
}