{
  "subjects": [
    {
      "type": "series",
      "content": "משנה תורה בקיאות"
    },
    {
      "type": "title",
      "content": "הלכות שופר סוכה ולולב פרק ב"
    },
    {
      "type": "author",
      "content": "ד\"ר אורן משלי"
    },
    {
      "type": "image",
      "content": "https://1.bp.blogspot.com/-w_mqhphAiaA/UdAMxaoWImI/AAAAAAAAFz0/p4MUO3Iluag/s306/maimonides.jpg"
    },
    {
      "content": [
        "הלכות שופר סוכה ולולב עוסקות בשלוש מצוות מרכזיות השייכות לראש השנה (שופר) ולחג הסוכות (סוכה ולולב). שלושת הפרקים הראשונים עוסקים במצוות השופר ולפנינו שיעור על הפרק השני.",
        "שימו לב כי ניתן להחליף בין מצב \"לימוד קלאסי\" המתאים ללימוד ראשוני לבין מצב \"מונחה שאלות\" המתאים יותר **לשינון חוזר**.",
        "בהצלחה!"
      ],
      "type": "guidelines"
    },
    {
      "content": [
        "הלכה א @@@ הַכּל חַיָּבִין לִשְׁמֹעַ קוֹל שׁוֹפָר כֹּהֲנִים לְוִיִּים וְיִשְׂרְאֵלִים וְגֵרִים וַעֲבָדִים מְשֻׁחְרָרִים. אֲבָל נָשִׁים וַעֲבָדִים וּקְטַנִּים פְּטוּרִין. מִי שֶׁחֶצְיוֹ עֶבֶד וְחֶצְיוֹ בֶּן חוֹרִין וְטֻמְטוּם וְאַנְדְּרוֹגִינוּס חַיָּבִין:"
      ],
      "type": "materials",
      "title": "הלכות שופר סוכה ולולב פרק ב"
    },
    {
      "content": [
        "גברים",
        "טומטום",
        "אנדרוגינוס",
        "נשים",
        "עבדים",
        "קטנים"
      ],
      "type": "multiple_choice",
      "num_of_correct": "3",
      "question": "מי חייב לשמוע קול שופר בראש השנה?"
    },
    {
      "content": [
        "הלכה ב @@@ כָּל מִי שֶׁאֵינוֹ חַיָּב בַּדָּבָר אֵינוֹ מוֹצִיא אֶת הַחַיָּב יְדֵי חוֹבָתוֹ. לְפִיכָךְ אִשָּׁה אוֹ קָטָן שֶׁתָּקְעוּ בַּשּׁוֹפָר הַשּׁוֹמֵעַ מֵהֶן לֹא יָצָא. אַנְדְּרוֹגִינוּס מוֹצִיא אֶת מִינוֹ וְאֵינוֹ מוֹצִיא אֶת שֶׁאֵינוֹ מִינוֹ. טֻמְטוּם אֵינוֹ מוֹצִיא לֹא אֶת מִינוֹ וְלֹא שֶׁאֵינוֹ מִינוֹ. שֶׁהַטֻּמְטוּם שֶׁנִּקְרַע אֶפְשָׁר שֶׁיִּמָּצֵא זָכָר וְאֶפְשָׁר שֶׁיִּמָּצֵא נְקֵבָה:"
      ],
      "type": "materials",
      "title": "הלכות שופר סוכה ולולב פרק ב"
    },
    {
      "content": [
        "משום שאשה איננה חייבת במצוות שופר כמו גבר",
        "משום שאשה איננה יכולה להוציא גבר במצוות",
        "משום שאין זה צנוע לאשה להוציא גבר במצוות"
      ],
      "type": "single_choice",
      "question": "מדוע אשה איננה יכולה להוציא ידי חובה גבר במצוות שופר?"
    },
    {
      "content": [
        "אנדרוגינוס כמותו",
        "טומטום",
        "גבר",
        "אישה",
        "אף אחד"
      ],
      "type": "single_choice",
      "question": "אנדרוגינוס התוקע בשופר, את מי הוא מוציא ידי חובה?"
    },
    {
      "content": [
        "אף אחד",
        "טומטום כמותו",
        "אנדרוגינוס",
        "גבר",
        "אישה"
      ],
      "type": "single_choice",
      "question": "טומטום התוקע בשופר, את מי הוא מוציא ידי חובה?"
    },
    {
      "content": [
        "הלכה ד @@@ הַמִּתְעַסֵּק בִּתְקִיעַת שׁוֹפָר לְהִתְלַמֵּד לֹא יָצָא יְדֵי חוֹבָתוֹ. וְכֵן הַשּׁוֹמֵעַ מִן הַמִּתְעַסֵּק לֹא יָצָא. נִתְכַּוֵּן שׁוֹמֵעַ לָצֵאת יְדֵי חוֹבָתוֹ וְלֹא נִתְכַּוֵּן הַתּוֹקֵעַ לְהוֹצִיאוֹ אוֹ שֶׁנִּתְכַּוֵּן הַתּוֹקֵעַ לְהוֹצִיאוֹ וְלֹא נִתְכַּוֵּן הַשּׁוֹמֵעַ לָצֵאת לֹא יָצָא יְדֵי חוֹבָתוֹ. עַד שֶׁיִּתְכַּוֵּן שׁוֹמֵעַ וּמַשְׁמִיעַ:"
      ],
      "type": "materials",
      "title": "הלכות שופר סוכה ולולב פרק ב"
    },
    {
      "content": [
        "על התוקע לכוון להוציא, ועל השומע לכוון לצאת",
        "על התוקע לכוון להוציא, ואין צורך בכוונת השומע",
        "על השומע לכוון לצאת, ואין צורך בכוונת התוקע",
        "חברו יוצא, ואין צורך בכוונת התוקע או השומע"
      ],
      "type": "single_choice",
      "question": "התוקע בשופר ורוצה להוציא את חברו ידי חובה, מהם דיני הכוונה?"
    },
    {
      "content": [
        "הלכה ה @@@ מִי שֶׁתָּקַע וְנִתְכַּוֵּן לְהוֹצִיא כָּל הַשּׁוֹמֵעַ תְּקִיעָתוֹ וְשָׁמַע הַשּׁוֹמֵעַ וְנִתְכַּוֵּן לָצֵאת יְדֵי חוֹבָתוֹ אַף עַל פִּי שֶׁאֵין הַתּוֹקֵעַ מִתְכַּוֵּן לְזֶה פְּלוֹנִי שֶׁשָּׁמַע תְּקִיעָתוֹ וְאֵינוֹ יוֹדְעוֹ יָצָא. שֶׁהֲרֵי נִתְכַּוֵּן לְכָל מִי שֶׁיִּשְׁמָעֶנּוּ. לְפִיכָךְ מִי שֶׁהָיָה מְהַלֵּךְ בַּדֶּרֶךְ אוֹ יוֹשֵׁב בְּתוֹךְ בֵּיתוֹ וְשָׁמַע הַתְּקִיעוֹת מִשְּׁלִיחַ צִבּוּר יָצָא אִם נִתְכַּוֵּן לָצֵאת. שֶׁהֲרֵי שְׁלִיחַ צִבּוּר מִתְכַּוֵּן לְהוֹצִיא אֶת הָרַבִּים יְדֵי חוֹבָתָן:"
      ],
      "type": "materials",
      "title": "הלכות שופר סוכה ולולב פרק ב"
    },
    {
      "content": [
        "כן, האדם יצא ידי חובתו ללא שום תנאי",
        "לא, מפני ששליח הציבור לא כיוון להוציא אדם זה ספציפית",
        "כן, בתנאי שהאדם נוהג להתפלל בבית כנסת זה",
        "לא, מפני שיש להיות נוכח בבית הכנסת בעת התקיעה"
      ],
      "type": "single_choice",
      "question": "אדם היושב בביתו ושמע תקיעות של שליח הציבור מבית הכנסת שלידו **וכיוון לצאת**. האם יצא ידי חובתו?"
    },
    {
      "content": [
        "הלכה ו @@@ יוֹם טוֹב שֶׁל רֹאשׁ הַשָּׁנָה שֶׁחָל לִהְיוֹת בְּשַׁבָּת אֵין תּוֹקְעִין בַּשּׁוֹפָר בְּכָל מָקוֹם. אַף עַל פִּי שֶׁהַתְּקִיעָה מִשּׁוּם שְׁבוּת וּמִן הַדִּין הָיָה שֶׁתּוֹקְעִין יָבוֹא עֲשֵׂה שֶׁל תּוֹרָה וְיִדְחֶה שְׁבוּת שֶׁל דִּבְרֵיהֶם. וְלָמָּה אֵין תּוֹקְעִין גְּזֵרָה שֶׁמָּא יִטְּלֶנּוּ בְּיָדוֹ וְיוֹלִיכֶנּוּ לְמִי שֶׁיִּתְקַע לוֹ וְיַעֲבִירֶנּוּ אַרְבַּע אַמּוֹת בִּרְשׁוּת הָרַבִּים. אוֹ יוֹצִיאוֹ מֵרְשׁוּת לִרְשׁוּת וְיָבוֹא לִידֵי אִסּוּר סְקִילָה. שֶׁהַכּל חַיָּבִים בִּתְקִיעָה וְאֵין הַכּל בְּקִיאִין לִתְקֹעַ:"
      ],
      "type": "materials",
      "title": "הלכות שופר סוכה ולולב פרק ב"
    },
    {
      "content": [
        "משום גזרה שמא יעבור על מלאכת הוצאה בשבת",
        "משום גזרה שמא יבוא לתקן כלי ביום השבת",
        "משום איסור שבות להשמיע קול נגינה ביום השבת",
        "משום שבתורה נאמר \"זכרון תרועה\" ודרשוהו על יום השבת"
      ],
      "type": "single_choice",
      "question": "מדוע אין תוקעים בשופר ביום טוב של ראש השנה אשר חל בשבת?"
    },
    {
      "content": [
        "הלכה ח @@@ כְּשֶׁגָּזְרוּ שֶׁלֹּא לִתְקֹעַ בְּשַׁבָּת לֹא גָּזְרוּ אֶלָּא בְּמָקוֹם שֶׁאֵין בּוֹ בֵּית דִּין. אֲבָל בִּזְמַן שֶׁהָיָה הַמִּקְדָּשׁ קַיָּם וְהָיָה בֵּית דִּין הַגָּדוֹל בִּירוּשָׁלַיִם הָיוּ הַכּל תּוֹקְעִין בִּירוּשָׁלַיִם בְּשַׁבָּת כָּל זְמַן שֶׁבֵּית דִּין יוֹשְׁבִין. וְלֹא אַנְשֵׁי יְרוּשָׁלַיִם בִּלְבַד אֶלָּא כָּל עִיר שֶׁהָיְתָה בְּתוֹךְ תְּחוּם יְרוּשָׁלַיִם וְהָיְתָה רוֹאָה יְרוּשָׁלַיִם לֹא שֶׁתִּהְיֶה בְּתוֹךְ הַנַּחַל. וְהָיְתָה שׁוֹמַעַת קוֹל תְּקִיעַת יְרוּשָׁלַיִם לֹא שֶׁתִּהְיֶה בְּרֹאשׁ הָהָר. וְהָיְתָה יְכוֹלָה לָבוֹא בִּירוּשָׁלַיִם לֹא שֶׁיִּהְיֶה נָהָר מַפְסִיק בֵּינֵיהֶם. אַנְשֵׁי אוֹתָהּ הָעִיר הָיוּ תּוֹקְעִים בְּשַׁבָּת כִּירוּשָׁלַיִם. אֲבָל בִּשְׁאָר עָרֵי יִשְׂרָאֵל לֹא הָיוּ תּוֹקְעִין:"
      ],
      "type": "materials",
      "title": "הלכות שופר סוכה ולולב פרק ב"
    },
    {
      "content": [
        "בירושלים ובחלק מעריה הסמוכות",
        "בירושלים ובכל עריה הסמוכות",
        "בירושלים בלבד",
        "בבית המקדש בלבד"
      ],
      "type": "single_choice",
      "question": "בזמן שבית המקדש היה קיים, באלו מקומות התירו לתקוע בשבת בזמן שבית הדין הגדול יושבים בדין?"
    },
    {
      "content": [
        "הלכה ט @@@ וּבַזְּמַן הַזֶּה שֶׁחָרַב הַמִּקְדָּשׁ כָּל מָקוֹם שֶׁיֵּשׁ בּוֹ בֵּית דִּין קָבוּעַ וְהוּא שֶׁיִּהְיֶה סָמוּךְ בְּאֶרֶץ יִשְׂרָאֵל תּוֹקְעִין בּוֹ בְּשַׁבָּת. וְאֵין תּוֹקְעִין בְּשַׁבָּת אֶלָּא בְּבֵית דִּין שֶׁקִּדְּשׁוּ אֶת הַחֹדֶשׁ אֲבָל שְׁאָר בָּתֵּי דִּינִין אֵין תּוֹקְעִין בָּהֶן אַף עַל פִּי שֶׁהֵן סְמוּכִין. וְאֵין תּוֹקְעִין אֶלָּא בִּפְנֵי בֵּית דִּין גָּדוֹל בִּלְבַד כָּל זְמַן שֶׁהֵן יוֹשְׁבִין וַאֲפִלּוּ נִנְעֲרוּ לַעֲמֹד וְלֹא עָמְדוּ תּוֹקְעִין בִּפְנֵיהֶם. אֲבָל חוּץ לְבֵית דִּין אֵין תּוֹקְעִין. וְלָמָּה תּוֹקְעִין בִּפְנֵי בֵּית דִּין מִפְּנֵי שֶׁבֵּית דִּין זְרִיזִין הֵן וְלֹא יָבוֹאוּ הַתּוֹקְעִין לְהַעֲבִיר הַשּׁוֹפָר בִּפְנֵיהֶם בִּרְשׁוּת הָרַבִּים שֶׁבֵּית דִּין מַזְהִירִין אֶת הָעָם וּמוֹדִיעִין אוֹתָן:",
        "הלכה ח (הקודמת) @@@ כְּשֶׁגָּזְרוּ שֶׁלֹּא לִתְקֹעַ בְּשַׁבָּת לֹא גָּזְרוּ אֶלָּא בְּמָקוֹם שֶׁאֵין בּוֹ בֵּית דִּין. אֲבָל בִּזְמַן שֶׁהָיָה הַמִּקְדָּשׁ קַיָּם וְהָיָה בֵּית דִּין הַגָּדוֹל בִּירוּשָׁלַיִם הָיוּ הַכּל תּוֹקְעִין בִּירוּשָׁלַיִם בְּשַׁבָּת כָּל זְמַן שֶׁבֵּית דִּין יוֹשְׁבִין. וְלֹא אַנְשֵׁי יְרוּשָׁלַיִם בִּלְבַד אֶלָּא כָּל עִיר שֶׁהָיְתָה בְּתוֹךְ תְּחוּם יְרוּשָׁלַיִם וְהָיְתָה רוֹאָה יְרוּשָׁלַיִם לֹא שֶׁתִּהְיֶה בְּתוֹךְ הַנַּחַל. וְהָיְתָה שׁוֹמַעַת קוֹל תְּקִיעַת יְרוּשָׁלַיִם לֹא שֶׁתִּהְיֶה בְּרֹאשׁ הָהָר. וְהָיְתָה יְכוֹלָה לָבוֹא בִּירוּשָׁלַיִם לֹא שֶׁיִּהְיֶה נָהָר מַפְסִיק בֵּינֵיהֶם. אַנְשֵׁי אוֹתָהּ הָעִיר הָיוּ תּוֹקְעִים בְּשַׁבָּת כִּירוּשָׁלַיִם. אֲבָל בִּשְׁאָר עָרֵי יִשְׂרָאֵל לֹא הָיוּ תּוֹקְעִין:"
      ],
      "type": "materials",
      "title": "הלכות שופר סוכה ולולב פרק ב"
    },
    {
      "content": [
        "בזמן הזה מותר לתקוע בפני בית דין העומד בתנאים בכל ישראל ולא רק בירושלים",
        "בזמן הזה מותר לתקוע רק בתוך בית דין העומד בתנאים ולא מחוצה לו",
        "בזמן הזה מותר לתקוע בפני בית דין העומד בתנאים בכל ישראל חוץ מירושלים",
        "בזמן הזה מותר לתקוע בפני דין העומד בתנאים רק בעת שהוא מקדש את החודש",
        "בזמן הזה מותר לתקוע בפני דין העומד בתנאים רק בירושלים ואף לא בסביבותיה"
      ],
      "type": "multiple_choice",
      "num_of_correct": "2",
      "question": "מהם ההבדלים בין ההיתר לתקיעה בשבת בזמן בית המקדש לבין ההיתר בזמן הזה?"
    }
  ]
}