{
  "subjects": [
    {
      "type": "series",
      "content": "רש\"י על הפרשה"
    },
    {
      "type": "title",
      "content": "פרשת כי תצא"
    },
    {
      "type": "author",
      "content": "ד\"ר אורן משלי"
    },
    {
      "type": "image",
      "content": "https://upload.wikimedia.org/wikipedia/he/thumb/6/60/Rashi_stamp.jpg/250px-Rashi_stamp.jpg"
    },
    {
      "content": [
        "שיעור זה עוסק בפרשת **כי תצא** שהיא הפרשה השישית בספר דברים. נלמד נושאים נבחרים בפרשה לאור פירושו של רש\"י (רבי שלמה יצחקי).",
        "שימו לב, כי כל השאלות מתייחסות לפירוש רש\"י ולכן לא נציין זאת בכל פעם.",
        "בהצלחה!"
      ],
      "type": "guidelines"
    },
    {
      "content": [
        "פסוקים י-יד @@@ {י} כִּי תֵצֵא לַמִּלְחָמָה עַל אֹיְבֶיךָ וּנְתָנוֹ יְהֹוָה אֱלֹהֶיךָ בְּיָדֶךָ וְשָׁבִיתָ שִׁבְיוֹ: {יא} וְרָאִיתָ בַּשִּׁבְיָה אֵשֶׁת יְפַת תֹּאַר וְחָשַׁקְתָּ בָהּ וְלָקַחְתָּ לְךָ לְאִשָּׁה: {יב} וַהֲבֵאתָהּ אֶל תּוֹךְ בֵּיתֶךָ וְגִלְּחָה אֶת רֹאשָׁהּ וְעָשְׂתָה אֶת צִפָּרְנֶיהָ: {יג} וְהֵסִירָה אֶת שִׂמְלַת שִׁבְיָהּ מֵעָלֶיהָ וְיָשְׁבָה בְּבֵיתֶךָ וּבָכְתָה אֶת אָבִיהָ וְאֶת אִמָּהּ יֶרַח יָמִים וְאַחַר כֵּן תָּבוֹא אֵלֶיהָ וּבְעַלְתָּהּ וְהָיְתָה לְךָ לְאִשָּׁה: {יד} וְהָיָה אִם לֹא חָפַצְתָּ בָּהּ וְשִׁלַּחְתָּהּ לְנַפְשָׁהּ וּמָכֹר לֹא תִמְכְּרֶנָּה בַּכָּסֶף לֹא תִתְעַמֵּר בָּהּ תַּחַת אֲשֶׁר עִנִּיתָהּ:",
        "רש\"י @@@ {י} **כי תצא למלחמה.** במלחמת הרשות הכתוב מדבר, שבמלחמת ארץ ישראל אין לומר ושבית שביו, שהרי כבר נאמר לא תחיה כל נשמה: {יא} **ולקחת לך לאשה.** לא דברה תורה אלא כנגד יצר הרע, שאם אין הקדוש ב\"ה מתירה, ישאנה באיסור, אבל אם נשאה, סופו להיות שונאה, שנאמר אחריו כי תהיינן לאיש וגו', וסופו להוליד ממנה בן סורר ומורה, לכך נסמכו פרשיות הללו: **אשת.** אפילו אשת איש:"
      ],
      "type": "materials",
      "title": "דברים פרק כא"
    },
    {
      "content": [
        "מלחמת רשות",
        "מלחמת מצווה",
        "מלחמת שבעה עממין",
        "מלחמה בעמלק"
      ],
      "type": "single_choice",
      "question": "\"כי תצא למלחמה\" - באיזה סוג של מלחמה מדובר?"
    },
    {
      "content": [
        "ללמד שאם ישא אדם אשת יפת תואר אפילו בהיתר סופו שיהיה לו בן סורר ומורה",
        "ללמד שאם ישא אדם אשת יפת תואר באיסור סופו שיהיה לו בן סורר ומורה",
        "ללמד שאם ישא אדם אשת יפת תואר בהיתר מובטח שלא יהיה לו בן סורר ומורה",
        "ללמד שאם ישא אדם אשת יפת תואר באיסור יתכן שיהיה לו בן סורר ומורה"
      ],
      "type": "single_choice",
      "question": "מדוע פרשיית \"אשת יפת תואר\" מופיעה לפני פרשיית \"בן סורר ומורה\"?"
    },
    {
      "content": [
        "כן",
        "לא"
      ],
      "type": "single_choice",
      "question": "האם אשת יפת תואר **שהיא נשואה** מותרת לישראל?"
    },
    {
      "content": [
        "פסוקים י-יד @@@ {י} כִּי תֵצֵא לַמִּלְחָמָה עַל אֹיְבֶיךָ וּנְתָנוֹ יְהֹוָה אֱלֹהֶיךָ בְּיָדֶךָ וְשָׁבִיתָ שִׁבְיוֹ: {יא} וְרָאִיתָ בַּשִּׁבְיָה אֵשֶׁת יְפַת תֹּאַר וְחָשַׁקְתָּ בָהּ וְלָקַחְתָּ לְךָ לְאִשָּׁה: {יב} וַהֲבֵאתָהּ אֶל תּוֹךְ בֵּיתֶךָ וְגִלְּחָה אֶת רֹאשָׁהּ וְעָשְׂתָה אֶת צִפָּרְנֶיהָ: {יג} וְהֵסִירָה אֶת שִׂמְלַת שִׁבְיָהּ מֵעָלֶיהָ וְיָשְׁבָה בְּבֵיתֶךָ וּבָכְתָה אֶת אָבִיהָ וְאֶת אִמָּהּ יֶרַח יָמִים וְאַחַר כֵּן תָּבוֹא אֵלֶיהָ וּבְעַלְתָּהּ וְהָיְתָה לְךָ לְאִשָּׁה: {יד} וְהָיָה אִם לֹא חָפַצְתָּ בָּהּ וְשִׁלַּחְתָּהּ לְנַפְשָׁהּ וּמָכֹר לֹא תִמְכְּרֶנָּה בַּכָּסֶף לֹא תִתְעַמֵּר בָּהּ תַּחַת אֲשֶׁר עִנִּיתָהּ:",
        "רש\"י @@@ {יב} **ועשתה את צפרניה.** תגדלם כדי שתתנוול: {יג} **והסירה את שמלת שביה.** לפי שהם נאים, שהנכרים בנותיהם מתקשטות במלחמה, בשביל להזנות אחרים עמהם: **וישבה בביתך.** בבית שמשתמש בו, נכנס ונתקל בה, יוצא ונתקל בה, רואה בבכייתה, רואה בנוולה, כדי שתתגנה עליו: **ובכתה את אביה.** כל כך למה, כדי שתהא בת ישראל שמחה וזו עצבה, בת ישראל מתקשטת וזו מתנוולת:"
      ],
      "type": "materials",
      "title": "דברים פרק כא"
    },
    {
      "content": [
        "עליה לגדל את  ציפורניה",
        "עליה לקשט את ציפורניה",
        "עליה לקצוץ את ציפורניה"
      ],
      "type": "single_choice",
      "question": "מה פירוש \"ועשתה\" את ציפורניה?"
    },
    {
      "content": [
        "על מנת לפתות את צבא האויב",
        "על מנת לעורר רחמים בקרב צבא האויב",
        "כדי להפגין בטחון בניצחון צבאם",
        "כדי להסוות את זהותן שלא יפגעו בהן"
      ],
      "type": "single_choice",
      "question": "מדוע בנות הגויים לובשות בגדים נאים בעת מלחמה?"
    },
    {
      "content": [
        "כדי למנוע מהאיש הישראלי מלהינשא לה",
        "כדי להתאבל על ניתוקה מבית אביה",
        "על מנת שלא יקנאו בה בנות ישראל",
        "על מנת שתינשא מתוך חיבור פנימי ולא חיצוני"
      ],
      "type": "single_choice",
      "question": "מדוע על אשת יפת תואר לגדל ציפורניה, להסיר בגדיה הנאים, ולבכות?"
    },
    {
      "content": [
        "פסוקים יח-כא @@@ {יח} כִּי יִהְיֶה לְאִישׁ בֵּן סוֹרֵר וּמוֹרֶה אֵינֶנּוּ שֹׁמֵעַ בְּקוֹל אָבִיו וּבְקוֹל אִמּוֹ וְיִסְּרוּ אֹתוֹ וְלֹא יִשְׁמַע אֲלֵיהֶם: {יט} וְתָפְשׂוּ בוֹ אָבִיו וְאִמּוֹ וְהוֹצִיאוּ אֹתוֹ אֶל זִקְנֵי עִירוֹ וְאֶל שַׁעַר מְקֹמוֹ: {כ} וְאָמְרוּ אֶל זִקְנֵי עִירוֹ בְּנֵנוּ זֶה סוֹרֵר וּמֹרֶה אֵינֶנּוּ שֹׁמֵעַ בְּקֹלֵנוּ זוֹלֵל וְסֹבֵא: {כא} וּרְגָמֻהוּ כָּל אַנְשֵׁי עִירוֹ בָאֲבָנִים וָמֵת וּבִעַרְתָּ הָרָע מִקִּרְבֶּךָ וְכָל יִשְׂרָאֵל יִשְׁמְעוּ וְיִרָאוּ:",
        "רש\"י @@@ ...בן סורר ומורה אינו חייב עד שיגנוב ויאכל תרטימר בשר וישתה חצי לוג יין, שנאמר זולל וסובא, ונאמר אל תהי בסובאי יין בזוללי בשר למו, ובן סורר ומורה נהרג על שם סופו, הגיעה תורה לסוף דעתו, סוף שמכלה ממון אביו ומבקש לימודו ואינו מוצא, ועומד בפרשת דרכים ומלסטם את הבריות, אמרה תורה ימות זכאי ואל ימות חייב:"
      ],
      "type": "materials",
      "title": "דברים פרק כא"
    },
    {
      "content": [
        "גניבה ואכילה של תרטימר בשר ושתיית חצי לוג יין",
        "גניבה ואכילה של חצי תרטימר בשר ושתיית לוג יין",
        "אכילה של תרטימר בשר ושתיית חצי לוג יין",
        "אכילה של חצי תרטימר בשר ושתיית לוג יין"
      ],
      "type": "single_choice",
      "question": "על איזה סוג התנהגות מתחייב בן סורר ומורה מיתה?"
    },
    {
      "content": [
        "משום שבין כה בעתיד יתחייב מיתה ולטובתו עדיף להרגו עכשיו",
        "משום התנהגותו הנוכחית הבלתי מוסרית שיש בה חילול השם",
        "משום התנהגותו הנוכחית הבלתי מוסרית שיש בה ביזוי כבוד הוריו",
        "משום שבעתיד יזיק לבריות ולטובת הכלל עדיף להרגו עכשיו"
      ],
      "type": "single_choice",
      "question": "מדוע בן סורר ומורה נידון מיתה על התנהגותו?"
    },
    {
      "content": [
        "פסוקים א-ג @@@ {א} לֹא תִרְאֶה אֶת שׁוֹר אָחִיךָ אוֹ אֶת שֵׂיוֹ נִדָּחִים וְהִתְעַלַּמְתָּ מֵהֶם הָשֵׁב תְּשִׁיבֵם לְאָחִיךָ: {ב} וְאִם לֹא קָרוֹב אָחִיךָ אֵלֶיךָ וְלֹא יְדַעְתּוֹ וַאֲסַפְתּוֹ אֶל תּוֹךְ בֵּיתֶךָ וְהָיָה עִמְּךָ עַד דְּרֹשׁ אָחִיךָ אֹתוֹ וַהֲשֵׁבֹתוֹ לוֹ: {ג} וְכֵן תַּעֲשֶׂה לַחֲמֹרוֹ וְכֵן תַּעֲשֶׂה לְשִׂמְלָתוֹ וְכֵן תַּעֲשֶׂה לְכָל אֲבֵדַת אָחִיךָ אֲשֶׁר תֹּאבַד מִמֶּנּוּ וּמְצָאתָהּ לֹא תוּכַל לְהִתְעַלֵּם:",
        "רש\"י @@@ {א} **והתעלמת.** כובש עין כאילו אינו רואהו: **לא תראה והתעלמת.** לא תראה אותו שתתעלם ממנו, זהו פשוטו. ורבותינו אמרו, פעמים שאתה מתעלם וכו': {ב} **עד דרש אחיך.** וכי תעלה בלבבך שיתנהו לו קודם שידרשהו, אלא דרשהו שלא יהא רמאי: **והשבותו לו.** שתהא בו השבה, שלא יאכל בביתך כדי דמיו ותתבעם ממנו, מכאן אמרו כל דבר שעושה ואוכל יעשה ויאכל, ושאינו עושה ואוכל ימכר:"
      ],
      "type": "materials",
      "title": "דברים פרק כב"
    },
    {
      "content": [
        "כן",
        "לא"
      ],
      "type": "single_choice",
      "question": "האם יש מקרים בהם מותר לאדם להתעלם מאבידה ולא להשיב אותה?"
    },
    {
      "content": [
        "שיש להשיב האבידה לאחר בדיקה שמבקש אותה אדם הגון",
        "שיש לשמור האבידה כאילו היא שלך עד שיהיה מי שיבקשה",
        "שיש להשיב האבידה לאחר בדיקה שמבקשה ישראל ולא גוי"
      ],
      "type": "single_choice",
      "question": "מה כוונת הפסוק \"והיה עמך עד דרוש אחיך\"?"
    },
    {
      "content": [
        "עליו למכור את האבידה",
        "עליו לשמור את האבידה",
        "עליו למסור את האבידה לבית דין"
      ],
      "type": "single_choice",
      "question": "אדם מצא אבידה \"שאינה עושה ואוכלת\". מה עליו לעשות איתה?"
    },
    {
      "content": [
        "פסוק ד @@@ {ד} לֹא תִרְאֶה אֶת חֲמוֹר אָחִיךָ אוֹ שׁוֹרוֹ נֹפְלִים בַּדֶּרֶךְ וְהִתְעַלַּמְתָּ מֵהֶם הָקֵם תָּקִים עִמּוֹ:",
        "רש\"י @@@ {ד} **הקם תקים.** זו טעינה, להטעין משאוי שנפל מעליו: **עמו.** עם בעליו, אבל אם הלך וישב לו, ואמר לו הואיל ועליך מצוה, אם רצית לטעון, טעון, פטור:"
      ],
      "type": "materials",
      "title": "דברים פרק כב"
    },
    {
      "content": [
        "לסייע בטעינת משא שנפל מבהמת חברך",
        "לסייע בפריקת משא כבד מבהמת חברך",
        "לסייע בהעמדת בהמת חברך אשר נפלה בדרך"
      ],
      "type": "single_choice",
      "question": "\"לֹא תִרְאֶה אֶת חֲמוֹר אָחִיךָ אוֹ שׁוֹרוֹ נֹפְלִים בַּדֶּרֶךְ... הָקֵם תָּקִים עִמּוֹ\". באיזה חיוב עוסק הפסוק?"
    },
    {
      "content": [
        "האדם פטור מן המצווה",
        "האדם חייב לסייע בטעינת כל המטען",
        "האדם חייב לסייע בטעינת חצי מהמטען"
      ],
      "type": "single_choice",
      "question": "מה יעשה אדם במקרה שבעל החמור שמשאו נפל איננו רוצה לסייע בטעינתו?"
    },
    {
      "content": [
        "פסוקים ו-ז @@@ {ו} כִּי יִקָּרֵא קַן צִפּוֹר לְפָנֶיךָ בַּדֶּרֶךְ בְּכָל עֵץ אוֹ עַל הָאָרֶץ אֶפְרֹחִים אוֹ בֵיצִים וְהָאֵם רֹבֶצֶת עַל הָאֶפְרֹחִים אוֹ עַל הַבֵּיצִים לֹא תִקַּח הָאֵם עַל הַבָּנִים: {ז} שַׁלֵּחַ תְּשַׁלַּח אֶת הָאֵם וְאֶת הַבָּנִים תִּקַּח לָךְ לְמַעַן יִיטַב לָךְ וְהַאֲרַכְתָּ יָמִים:",
        "רש\"י @@@ {ו} **כי יקרא.** פרט למזומן: **לא תקח האם.** בעודה על בניה: {ז} **למען ייטב לך וגו'.** אם מצוה קלה שאין בה חסרון כיס, אמרה תורה למען ייטב לך והארכת ימים, במתניתין קל וחומר למתן שכרן של מצות חמורות:"
      ],
      "type": "materials",
      "title": "דברים פרק כב"
    },
    {
      "content": [
        "לא לקחת את הציפור בעודה רובצת על אפרוחיה",
        "לא לקחת את הציפור בעודה מעופפת מעל אפרוחיה",
        "לא לקחת את הציפור יחד עם אפרוחיה"
      ],
      "type": "single_choice",
      "question": "מה פירוש \"לא תקח האם **על** הבנים\"?"
    },
    {
      "content": [
        "שאם מצווה קלה כזו שכרה בצדה, כל שכן שכרן של מצוות חמורות",
        "שהתורה באה לזרז על מצוות שיש בהן חסרון כיס, אפילו שאינן חמורות",
        "שיש לזרז דווקא על מצוות קלות, שמצוות חמורות האדם כבר מזדרז עליהן",
        "שמצוות שילוח הקן חשיבותה רבה על אף שהיא מצווה קלה לביצוע"
      ],
      "type": "single_choice",
      "question": "מה אנו למדים מהשכר המפורש של מצוות שילוח הקן?"
    },
    {
      "content": [
        "פסוק י @@@ לֹא תַחֲרֹשׁ בְּשׁוֹר וּבַחֲמֹר יַחְדָּו:",
        "רש\"י @@@ **לא תחרוש בשור ובחמור.** הוא הדין לכל שני מינים שבעולם, והוא הדין להנהיגם יחד קשורים זוגים בהולכת שום משא:"
      ],
      "type": "materials",
      "title": "דברים פרק כב"
    },
    {
      "content": [
        "כל שני מינים שונים",
        "מין שור עם מין חמור",
        "מין טהור עם מין טמא",
        "מין בהמה עם מין חיה"
      ],
      "type": "single_choice",
      "question": "אלו בעלי חיים אסור לחרוש בהם יחדיו?"
    },
    {
      "content": [
        "כן",
        "לא"
      ],
      "type": "single_choice",
      "question": "האם יש מלאכות נוספות מלבד חרישה שאסור לעשות על ידי שור וחמור יחדיו?"
    }
  ]
}