{
  "subjects": [
    {
      "type": "series",
      "content": "משנה תורה בקיאות"
    },
    {
      "type": "title",
      "content": "הלכות תשובה פרק ב"
    },
    {
      "type": "author",
      "content": "ד\"ר אורן משלי"
    },
    {
      "type": "image",
      "content": "https://1.bp.blogspot.com/-w_mqhphAiaA/UdAMxaoWImI/AAAAAAAAFz0/p4MUO3Iluag/s306/maimonides.jpg"
    },
    {
      "content": [
        "הלכות תשובה להרמב\"ם מסיימות את **ספר המדע** ומכילות 10 פרקים, עם נושאים כגון תשובה, בחירת האדם, שכר ועונש, ועוד.",
        "שיעור זה מתמקד בפרק השני בהלכות תשובה להרמב\"ם, אשר ממשיך לעסוק בנושא התשובה.",
        "בהצלחה!"
      ],
      "type": "guidelines"
    },
    {
      "content": [
        "הלכה א @@@ אֵי זוֹ הִיא תְּשׁוּבָה גְּמוּרָה. זֶה שֶׁבָּא לְיָדוֹ דָּבָר שֶׁעָבַר בּוֹ וְאֶפְשָׁר בְּיָדוֹ לַעֲשׂוֹתוֹ וּפֵרַשׁ וְלֹא עָשָׂה מִפְּנֵי הַתְּשׁוּבָה. לֹא מִיִּרְאָה וְלֹא מִכִּשְׁלוֹן כֹּחַ. כֵּיצַד. הֲרֵי שֶׁבָּא עַל אִשָּׁה בַּעֲבֵרָה וּלְאַחַר זְמַן נִתְיַחֵד עִמָּהּ וְהוּא עוֹמֵד בְּאַהֲבָתוֹ בָּהּ וּבְכֹחַ גּוּפוֹ וּבַמְּדִינָה שֶׁעָבַר בָּהּ וּפָרַשׁ וְלֹא עָבַר זֶהוּ בַּעַל תְּשׁוּבָה גְּמוּרָה. הוּא שֶׁשְּׁלֹמֹה אָמַר (קהלת יב-א) 'וּזְכֹר אֶת בּוֹרְאֶיךָ בִּימֵי בְּחוּרֹתֶיךָ'. וְאִם לֹא שָׁב אֶלָּא בִּימֵי זִקְנוּתוֹ וּבְעֵת שֶׁאִי אֶפְשָׁר לוֹ לַעֲשׂוֹת מַה שֶּׁהָיָה עוֹשֶׂה אַף עַל פִּי שֶׁאֵינָהּ תְּשׁוּבָה מְעֵלָּה מוֹעֶלֶת הִיא לוֹ וּבַעַל תְּשׁוּבָה הוּא."
      ],
      "type": "materials",
      "title": "הלכות תשובה פרק ב"
    },
    {
      "content": [
        "שעדיין יש ביכולתו לעשות את העבירה",
        "שהוא נמצא בסביבה בה העבירה עדיין אפשרית",
        "שאין עוד ביכולתו לעשות את העבירה",
        "שהוא נמצא בסביבה בה העבירה איננה עוד אפשרית"
      ],
      "type": "multiple_choice",
      "num_of_correct": "2",
      "question": "מהם המאפיינים העיקריים של \"בעל תשובה גמורה\"?"
    },
    {
      "content": [
        "הלכה ג @@@ כָּל הַמִּתְוַדֶּה בִּדְבָרִים וְלֹא גָּמַר בְּלִבּוֹ לַעֲזֹב הֲרֵי זֶה דּוֹמֶה לְטוֹבֵל וְשֶׁרֶץ בְּיָדוֹ שֶׁאֵין הַטְּבִילָה מוֹעֶלֶת לוֹ עַד שֶׁיַּשְׁלִיךְ הַשֶּׁרֶץ. וְכֵן הוּא אוֹמֵר וּמוֹדֶה וְעֹזֵב יְרֻחָם. וְצָרִיךְ לִפְרֹט אֶת הַחֵטְא שֶׁנֶּאֱמַר (שמות לב-לא) 'אָנָּא חָטָא הָעָם הַזֶּה חֲטָאָה גְדלָה וַיַּעֲשׂוּ לָהֶם אֱלֹהֵי זָהָב':"
      ],
      "type": "materials",
      "title": "הלכות תשובה פרק ב"
    },
    {
      "content": [
        "אין תועלת כלל",
        "יש תועלת חלקית"
      ],
      "type": "single_choice",
      "question": "האם יש תועלת בוידוי בעת שהאדם עדיין לא **גמר בלבו** לעזוב את העבירה?"
    },
    {
      "content": [
        "הלכה ד @@@ מִדַּרְכֵי הַתְּשׁוּבָה לִהְיוֹת הַשָּׁב צוֹעֵק תָּמִיד לִפְנֵי הַשֵּׁם בִּבְכִי וּבְתַחֲנוּנִים וְעוֹשֶׂה צְדָקָה כְּפִי כֹּחוֹ וּמִתְרַחֵק הַרְבֵּה מִן הַדָּבָר שֶׁחָטָא בּוֹ וּמְשַׁנֶּה שְׁמוֹ כְּלוֹמַר אֲנִי אַחֵר וְאֵינִי אוֹתוֹ הָאִישׁ שֶׁעָשָׂה אוֹתָן הַמַּעֲשִׂים וּמְשַׁנֶּה מַעֲשָׂיו כֻּלָּן לְטוֹבָה וּלְדֶרֶךְ יְשָׁרָה וְגוֹלֶה מִמְּקוֹמוֹ. שֶׁגָּלוּת מְכַפֶּרֶת עָוֹן מִפְּנֵי שֶׁגּוֹרֶמֶת לוֹ לְהִכָּנַע וְלִהְיוֹת עָנָו וּשְׁפַל רוּחַ:"
      ],
      "type": "materials",
      "title": "הלכות תשובה פרק ב"
    },
    {
      "content": [
        "לתת אפר על ראשו",
        "לבכות ולהתחנן לה'",
        "לתת צדקה",
        "לשנות את שמו",
        "לגלות ממקומו"
      ],
      "type": "single_choice",
      "question": "מה מהבאים **איננו** מומלץ כאמצעי סיוע לתשובת האדם?"
    },
    {
      "content": [
        "הלכה ה @@@ וְשֶׁבַח גָּדוֹל לַשָּׁב שֶׁיִּתְוַדֶּה בָּרַבִּים וְיוֹדִיעַ פְּשָׁעָיו לָהֶם וּמְגַלֶּה עֲבֵרוֹת שֶׁבֵּינוֹ לְבֵין חֲבֵרוֹ לַאֲחֵרִים וְאוֹמֵר לָהֶם אָמְנָם חָטָאתִי לִפְלוֹנִי וְעָשִׂיתִי לוֹ כָּךְ וְכָךְ וַהֲרֵינִי הַיּוֹם שָׁב וּמִתְנַחֵם. וְכָל הַמִּתְגָּאֶה וְאֵינוֹ מוֹדִיעַ אֶלָּא מְכַסֶּה פְּשָׁעָיו אֵין תְּשׁוּבָתוֹ גְּמוּרָה שֶׁנֶּאֱמַר (משלי כח-יג) 'מְכַסֶּה פְשָׁעָיו לֹא יַצְלִיחַ'. בַּמֶּה דְּבָרִים אֲמוּרִים בַּעֲבֵרוֹת שֶׁבֵּין אָדָם לַחֲבֵרוֹ אֲבָל בַּעֲבֵרוֹת שֶׁבֵּין אָדָם לַמָּקוֹם אֵינוֹ צָרִיךְ לְפַרְסֵם עַצְמוֹ וְעַזּוּת פָּנִים הִיא לוֹ אִם גִּלָּם. אֶלָּא שָׁב לִפְנֵי הָאֵל בָּרוּךְ הוּא וּפוֹרֵט חֲטָאָיו לְפָנָיו וּמִתְוַדֶּה עֲלֵיהֶם לִפְנֵי רַבִּים סְתָם. וְטוֹבָה הִיא לוֹ שֶׁלֹּא נִתְגַּלָּה עֲוֹנוֹ שֶׁנֶּאֱמַר (תהילים לב-א) 'אַשְׁרֵי נְשׂוּי פֶּשַׁע כְּסוּי חֲטָאָה':"
      ],
      "type": "materials",
      "title": "הלכות תשובה פרק ב"
    },
    {
      "content": [
        "מומלץ לכתחילה אך רק על עבירות שבין אדם לחבירו",
        "אפשרי בדיעבד אך רק על עבירות שבין אדם לחבירו",
        "מומלץ לכתחילה אך רק על עבירות שבין אדם למקום",
        "אפשרי בדיעבד אך רק על עבירות שבאין אדם למקום"
      ],
      "type": "single_choice",
      "question": "אדם שעשה תשובה, האם עליו להתודות על חטאיו ברבים?"
    },
    {
      "content": [
        "הלכה ו @@@ אַף עַל פִּי שֶׁהַתְּשׁוּבָה וְהַצְּעָקָה יָפָה לָעוֹלָם. בַּעֲשָׂרָה הַיָּמִים שֶׁבֵּין רֹאשׁ הַשָּׁנָה וְיוֹם הַכִּפּוּרִים הִיא יָפָה בְּיוֹתֵר וּמִתְקַבֶּלֶת הִיא מִיָּד שֶׁנֶּאֱמַר (ישעיה נה-ו) 'דִּרְשׁוּ ה' בְּהִמָּצְאוֹ'. בַּמֶּה דְּבָרִים אֲמוּרִים בְּיָחִיד אֲבָל צִבּוּר כָּל זְמַן שֶׁעוֹשִׂים תְּשׁוּבָה וְצוֹעֲקִין בְּלֵב שָׁלֵם הֵם נַעֲנִין שֶׁנֶּאֱמַר (דברים ד-ז) 'כַּה' אֱלֹהֵינוּ בְּכָל קָרְאֵנוּ אֵלָיו':"
      ],
      "type": "materials",
      "title": "הלכות תשובה פרק ב"
    },
    {
      "content": [
        "התשובה ממהרת להתקבל עבור יחיד",
        "התשובה ממהרת להתקבל עבור ציבור",
        "התשובה ממהרת להתקבל עבור יחיד וציבור"
      ],
      "type": "single_choice",
      "question": "מה מיוחד בתשובה הנעשית בעשרת ימי תשובה?"
    },
    {
      "content": [
        "הלכה ז @@@ יוֹם הַכִּפּוּרִים הוּא זְמַן תְּשׁוּבָה לַכּל לַיָּחִיד וְלָרַבִּים וְהוּא קֵץ מְחִילָה וּסְלִיחָה לְיִשְׂרָאֵל. לְפִיכָךְ חַיָּבִים הַכּל לַעֲשׂוֹת תְּשׁוּבָה וּלְהִתְוַדּוֹת בְּיוֹם הַכִּפּוּרִים. וּמִצְוַת וִדּוּי יוֹם הַכִּפּוּרִים שֶׁיַּתְחִיל מֵעֶרֶב הַיּוֹם קֹדֶם שֶׁיֹּאכַל שֶׁמָּא יֵחָנֵק בַּסְּעֻדָּה קֹדֶם שֶׁיִּתְוַדֶּה. וְאַף עַל פִּי שֶׁהִתְוַדָּה קֹדֶם שֶׁיֹּאכַל חוֹזֵר וּמִתְוַדֶּה בְּלֵילֵי יוֹם הַכִּפּוּרִים עַרְבִית וְחוֹזֵר וּמִתְוַדֶּה בְּשַׁחֲרִית וּבְמוּסָף וּבְמִנְחָה וּבִנְעִילָה. וְהֵיכָן מִתְוַדֶּה. יָחִיד אַחַר תְּפִלָּתוֹ וּשְׁלִיחַ צִבּוּר בְּאֶמְצַע תְּפִלָּתוֹ בִּבְרָכָה רְבִיעִית:"
      ],
      "type": "materials",
      "title": "הלכות תשובה פרק ב"
    },
    {
      "content": [
        "מחשש שמא יחנק בסעודה ואז לא יספיק להתודות",
        "מחשש שמא ימלא כרסו בסעודה ואז לא יתוודה בכוונה",
        "מחשש שמא ירדם אחר הסעודה ואז יחמיץ הוידוי",
        "מחשש שמא יהיה טרוד בסעודתו מפני חטאיו"
      ],
      "type": "single_choice",
      "question": "מדוע יש להתודות בערב יום הכיפורים **לפני** אכילת סעודה מפסקת?"
    },
    {
      "content": [
        "הלכה ט @@@ אֵין הַתְּשׁוּבָה וְלֹא יוֹם הַכִּפּוּרִים מְכַפְּרִין אֶלָּא עַל עֲבֵרוֹת שֶׁבֵּין אָדָם לַמָּקוֹם כְּגוֹן מִי שֶׁאָכַל דָּבָר אָסוּר אוֹ בָּעַל בְּעִילָה אֲסוּרָה וְכַיּוֹצֵא בָּהֶן. אֲבָל עֲבֵרוֹת שֶׁבֵּין אָדָם לַחֲבֵרוֹ כְּגוֹן הַחוֹבֵל אֶת חֲבֵרוֹ אוֹ הַמְקַלֵּל חֲבֵרוֹ אוֹ גּוֹזְלוֹ וְכַיּוֹצֵא בָּהֶן אֵינוֹ נִמְחַל לוֹ לְעוֹלָם עַד שֶׁיִּתֵּן לַחֲבֵרוֹ מַה שֶּׁהוּא חַיָּב לוֹ וִירַצֵּהוּ. אַף עַל פִּי שֶׁהֶחֱזִיר לוֹ מָמוֹן שֶׁהוּא חַיָּב לוֹ צָרִיךְ לְרַצּוֹתוֹ וְלִשְׁאל מִמֶּנּוּ שֶׁיִּמְחל לוֹ. אֲפִלּוּ לֹא הִקְנִיט אֶת חֲבֵרוֹ אֶלָּא בִּדְבָרִים צָרִיךְ לְפַיְּסוֹ וְלִפְגֹּעַ בּוֹ עַד שֶׁיִּמְחל לוֹ."
      ],
      "type": "materials",
      "title": "הלכות תשובה פרק ב"
    },
    {
      "content": [
        "על עבירות שבין אדם לחברו יום הכיפורים איננו מכפר",
        "כפרה על עבירות שבין אדם למקום תלויה באדם החוטא בלבד",
        "על עבירות שבין אדם למקום יום הכיפורים איננו מכפר",
        "כפרה על עבירות שבין אדם לחברו תלויה באדם החוטא בלבד"
      ],
      "type": "multiple_choice",
      "num_of_correct": "2",
      "question": "במה נבדלות עבירות שבין אדם לחברו מעבירות שבין אדם למקום לעניין כפרה?"
    },
    {
      "content": [
        "הלכה ט @@@ לֹא רָצָה חֲבֵרוֹ לִמְחל לוֹ מֵבִיא לוֹ שׁוּרָה שֶׁל שְׁלֹשָׁה בְּנֵי אָדָם מֵרֵעָיו וּפוֹגְעִין בּוֹ וּמְבַקְּשִׁין מִמֶּנּוּ. לֹא נִתְרַצָּה לָהֶן מֵבִיא לוֹ שְׁנִיָּה וּשְׁלִישִׁית. לֹא רָצָה מְנִיחוֹ וְהוֹלֵךְ לוֹ וְזֶה שֶׁלֹּא מָחַל הוּא הַחוֹטֵא. וְאִם הָיָה רַבּוֹ הוֹלֵךְ וּבָא אֲפִלּוּ אֶלֶף פְּעָמִים עַד שֶׁיִּמְחל לוֹ:"
      ],
      "type": "materials",
      "title": "הלכות תשובה פרק ב"
    },
    {
      "content": [
        "עליו ללכת אליו יחד עם שלושה אנשים ולבקש מחילה, שלוש פעמים בדיוק",
        "עליו ללכת אליו יחד עם שלושה אנשים ולבקש מחילה, שלוש פעמים לכל היותר",
        "עליו ללכת אליו יחד עם שני אנשים ולבקש מחילה, שלוש פעמים בדיוק",
        "עליו ללכת אליו יחד עם שני אנשים ולבקש מחילה, שלוש פעמים לכל היותר"
      ],
      "type": "single_choice",
      "question": "מה יעשה אדם שחטא לחברו והלה איננו רוצה למחול לו?"
    },
    {
      "content": [
        "הלכה יא @@@ הַחוֹטֵא לַחֲבֵרוֹ וּמֵת חֲבֵרוֹ קֹדֶם שֶׁיְּבַקֵּשׁ מְחִילָה מֵבִיא עֲשָׂרָה בְּנֵי אָדָם וּמַעֲמִידָן עַל קִבְרוֹ וְיֹאמַר בִּפְנֵיהֶם חָטָאתִי לַה' אֱלֹהֵי יִשְׂרָאֵל וְלִפְלוֹנִי זֶה שֶׁכָּךְ וְכָךְ עָשִׂיתִי לוֹ. וְאִם הָיָה חַיָּב לוֹ מָמוֹן יַחֲזִירוֹ לַיּוֹרְשִׁים. לֹא הָיָה יוֹדֵעַ לוֹ יוֹרְשִׁין יַנִּיחֶנּוּ בְּבֵית דִּין וְיִתְוַדֶּה:"
      ],
      "type": "materials",
      "title": "הלכות תשובה פרק ב"
    },
    {
      "content": [
        "אם יש יורשים, יחזיר להם את החוב ויבקש מחילה על קברו בפני עשרה אנשים",
        "אם יש יורשים, יחזיר להם את החוב ויבקש מחילה על קברו בפניהם",
        "אם אין יורשים, החוב מחול ויבקש מחילה על קברו בפני עשרה אנשים",
        "אם אין יורשים, החוב מחול ויבקש מחילה על קברו בפני בית דין"
      ],
      "type": "single_choice",
      "question": "מה יעשה אדם שחטא לחברו והלה **מת** לפני שהספיק לבקש ממנו מחילה?"
    }
  ]
}