{
  "subjects": [
    {
      "type": "series",
      "content": "משנה תורה בקיאות"
    },
    {
      "type": "title",
      "content": "הלכות שופר סוכה ולולב פרק א"
    },
    {
      "type": "author",
      "content": "ד\"ר אורן משלי"
    },
    {
      "type": "image",
      "content": "https://1.bp.blogspot.com/-w_mqhphAiaA/UdAMxaoWImI/AAAAAAAAFz0/p4MUO3Iluag/s306/maimonides.jpg"
    },
    {
      "content": [
        "הלכות שופר סוכה ולולב עוסקות בשלוש מצוות מרכזיות השייכות לראש השנה (שופר) ולחג הסוכות (סוכה ולולב). שלושת הפרקים הראשונים עוסקים במצוות השופר ולפנינו שיעור על הפרק הראשון.",
        "שימו לב כי ניתן להחליף בין מצב \"לימוד קלאסי\" המתאים ללימוד ראשוני לבין מצב \"מונחה שאלות\" המתאים יותר **לשינון חוזר**.",
        "בהצלחה!"
      ],
      "type": "guidelines"
    },
    {
      "content": [
        "הלכה א @@@ מִצְוַת עֲשֵׂה שֶׁל תּוֹרָה לִשְׁמֹעַ תְּרוּעַת הַשּׁוֹפָר בְּרֹאשׁ הַשָּׁנָה שֶׁנֶּאֱמַר (במדבר כט-א) 'יוֹם תְּרוּעָה יִהְיֶה לָכֶם'. וְשׁוֹפָר שֶׁתּוֹקְעִין בּוֹ בֵּין בְּרֹאשׁ הַשָּׁנָה בֵּין בְּיוֹבֵל הוּא קֶרֶן הַכְּבָשִׂים הַכָּפוּף. וְכָל הַשּׁוֹפָרוֹת פְּסוּלִין חוּץ מִקֶּרֶן הַכֶּבֶשׂ."
      ],
      "type": "materials",
      "title": "הלכות שופר סוכה ולולב פרק א"
    },
    {
      "content": [
        "לשמוע תרועת שופר",
        "לתקוע תרועת שופר",
        "לתקוע ולשמוע תרועת שופר"
      ],
      "type": "single_choice",
      "question": "מה אנו מצווים לעשות בראש השנה עם שופר?"
    },
    {
      "content": [
        "בקרן כבשים כפוף",
        "בקרן יעלים כפוף",
        "בקרן כבשים פשוט",
        "בקרן יעלים פשוט"
      ],
      "type": "single_choice",
      "question": "באיזה סוג שופר יש לתקוע בראש השנה וביובל?"
    },
    {
      "content": [
        "כל שאינו קרן כבשים",
        "כל שאינו קרן כבשים כפוף"
      ],
      "type": "single_choice",
      "question": "איזה סוג שופר **פסול** לתקיעה בראש השנה וביובל?"
    },
    {
      "content": [
        "הלכה א @@@מִצְוַת עֲשֵׂה שֶׁל תּוֹרָה לִשְׁמֹעַ תְּרוּעַת הַשּׁוֹפָר בְּרֹאשׁ הַשָּׁנָה שֶׁנֶּאֱמַר (במדבר כט-א) 'יוֹם תְּרוּעָה יִהְיֶה לָכֶם'... וְאַף עַל פִּי שֶׁלֹּא נִתְפָּרֵשׁ בַּתּוֹרָה תְּרוּעָה בְּשׁוֹפָר בְּרֹאשׁ הַשָּׁנָה הֲרֵי הוּא אוֹמֵר בְּיוֹבֵל (ויקרא כה-ט) 'וְהַעֲבַרְתָּ שׁוֹפַר' וְכוּ' (ויקרא כה-ט) 'תַּעֲבִירוּ שׁוֹפָר'. וּמִפִּי הַשְּׁמוּעָה לָמְדוּ מַה תְּרוּעַת יוֹבֵל בְּשׁוֹפָר אַף תְּרוּעַת רֹאשׁ הַשָּׁנָה בְּשׁוֹפָר:"
      ],
      "type": "materials",
      "title": "הלכות שופר סוכה ולולב פרק א"
    },
    {
      "content": [
        "זה נלמד מפי השמועה",
        "זה נלמד בגזירה שווה מהיובל",
        "זה נלמד מפסוקי תורה מפורשים",
        "זה נלמד מפסוקי הנביאים"
      ],
      "type": "multiple_choice",
      "num_of_correct": "2",
      "question": "מהיכן אנו למדים כי יש לשמוע תרועת **שופר** בראש השנה?"
    },
    {
      "content": [
        "הלכה ב @@@ בַּמִּקְדָּשׁ הָיוּ תּוֹקְעִין בְּרֹאשׁ הַשָּׁנָה בְּשׁוֹפָר אֶחָד וּשְׁתֵּי חֲצוֹצְרוֹת מִן הַצְּדָדִין. הַשּׁוֹפָר מַאֲרִיךְ וְהַחֲצוֹצְרוֹת מְקַצְּרוֹת שֶׁמִּצְוַת הַיּוֹם בְּשׁוֹפָר. וְלָמָּה תּוֹקְעִין עִמּוֹ בַּחֲצוֹצְרוֹת מִשּׁוּם שֶׁנֶּאֱמַר (תהילים צח-ו) 'בַּחֲצֹצְרוֹת וְקוֹל שׁוֹפָר הָרִיעוּ לִפְנֵי הַמֶּלֶךְ ה''. אֲבָל בִּשְׁאָר מְקוֹמוֹת אֵין תּוֹקְעִין בְּרֹאשׁ הַשָּׁנָה אֶלָּא בְּשׁוֹפָר בִּלְבַד:"
      ],
      "type": "materials",
      "title": "הלכות שופר סוכה ולולב פרק א"
    },
    {
      "content": [
        "שופר מאריך ושתי חצוצרות מהצדדים מקצרות",
        "שופר מקצר ושתי חצוצרות מהצדדים מאריכות",
        "חצוצרה מאריכה ושני שופרות מהצדדים מקצרים",
        "חצוצרה מקצרת ושני שופרות מהצדדים מאריכים"
      ],
      "type": "single_choice",
      "question": "כיצד היו תוקעים בראש השנה בבית המקדש?"
    },
    {
      "content": [
        "הלכה ג @@@ שׁוֹפָר שֶׁל עַכּוּ\"ם אֵין תּוֹקְעִין בּוֹ לְכַתְּחִלָּה וְאִם תָּקַע יָצָא. וְשֶׁל עִיר הַנִּדַּחַת אִם תָּקַע בּוֹ לֹא יָצָא. שׁוֹפָר הַגָּזוּל שֶׁתָּקַע בּוֹ יָצָא שֶׁאֵין הַמִּצְוָה אֶלָּא בִּשְׁמִיעַת הַקּוֹל אַף עַל פִּי שֶׁלֹּא נָגַע בּוֹ וְלֹא הִגְבִּיהוֹ הַשּׁוֹמֵעַ יָצָא וְאֵין בַּקּוֹל דִּין גֵּזֶל. וְכֵן שׁוֹפָר שֶׁל עוֹלָה לֹא יִתְקַע בּוֹ וְאִם תָּקַע יָצָא שֶׁאֵין בַּקּוֹל דִּין מְעִילָה. וְאִם תֹּאמַר וַהֲלֹא נֶהֱנָה בִּשְׁמִיעַת הַקּוֹל. מִצְוֹת לֹא לֵהָנוֹת נִתְּנוּ. לְפִיכָךְ הַמֻּדָּר הֲנָיָה מִשּׁוֹפָר מֻתָּר לִתְקֹעַ בּוֹ תְּקִיעָה שֶׁל מִצְוָה:"
      ],
      "type": "materials",
      "title": "הלכות שופר סוכה ולולב פרק א"
    },
    {
      "content": [
        "בדיעבד כן",
        "אף לא בדיעבד",
        "לכתחילה כן"
      ],
      "type": "single_choice",
      "question": "האם יוצאים ידי חובה בתקיעת שופר של עבודה זרה?"
    },
    {
      "content": [
        "אף לא בדיעבד",
        "בדיעבד כן",
        "לכתחילה כן"
      ],
      "type": "single_choice",
      "question": "האם יוצאים ידי חובה בתקיעת שופר של עיר הנדחת?"
    },
    {
      "content": [
        "כן",
        "לא"
      ],
      "type": "single_choice",
      "question": "האם יוצאים ידי חובה בתקיעת שופר גזול?"
    },
    {
      "content": [
        "אין בקול דין גזל",
        "כיוון שלא נגע בו ולא הגביהו",
        "שלא נהנה בשמיעת הקול"
      ],
      "type": "single_choice",
      "question": "מהי הסיבה שיוצאים ידי חובה בתקיעת שופר גזול?"
    },
    {
      "content": [
        "הלכה ד @@@ שׁוֹפָר שֶׁל רֹאשׁ הַשָּׁנָה אֵין מְחַלְּלִין עָלָיו אֶת יוֹם טוֹב וַאֲפִלּוּ בְּדָבָר שֶׁהוּא מִשּׁוּם שְׁבוּת. כֵּיצַד. הָיָה הַשּׁוֹפָר בְּרֹאשׁ הָאִילָן אוֹ מֵעֵבֶר הַנָּהָר וְאֵין לוֹ שׁוֹפָר אֶלָּא הוּא אֵינוֹ עוֹלֶה בָּאִילָן וְאֵינוֹ שָׁט עַל פְּנֵי הַמַּיִם כְּדֵי לַהֲבִיאוֹ. וְאֵין צָרִיךְ לוֹמַר שֶׁאֵין חוֹתְכִין אוֹתוֹ אוֹ עוֹשִׂין בּוֹ מְלָאכָה. מִפְּנֵי שֶׁתְּקִיעַת שׁוֹפָר מִצְוַת עֲשֵׂה וְיוֹם טוֹב עֲשֵׂה וְלֹא תַּעֲשֶׂה וְאֵין עֲשֵׂה דּוֹחֶה לֹא תַּעֲשֶׂה וַעֲשֵׂה."
      ],
      "type": "materials",
      "title": "הלכות שופר סוכה ולולב פרק א"
    },
    {
      "content": [
        "לא, לרבות איסורים מדרבנן",
        "לא, משום שמצוות יום טוב דוחות את מצוות שופר",
        "כן, משום שמצוות שופר דוחה את מצוות יום טוב",
        "כן, למעט איסורי תורה"
      ],
      "type": "multiple_choice",
      "num_of_correct": "2",
      "question": "האם מותר לחלל את יום טוב של ראש השנה לשם תקיעת שופר?"
    },
    {
      "content": [
        "הלכה ה @@@  שִׁעוּר הַשּׁוֹפָר כְּדֵי שֶׁיֹּאחֲזֶנּוּ בְּיָדוֹ וְיֵרָאֶה לְכָאן וּלְכָאן. נִסְדַּק לְאָרְכּוֹ פָּסוּל. לְרָחְבּוֹ אִם נִשְׁתַּיֵּר בּוֹ כַּשִּׁעוּר כָּשֵׁר וּכְאִלּוּ נִכְרַת מִמְּקוֹם הַסֶּדֶק."
      ],
      "type": "materials",
      "title": "הלכות שופר סוכה ולולב פרק א"
    },
    {
      "content": [
        "אם הסדק הוא לאורך השופר",
        "אם הסדק הוא לרוחב השופר ולא נשאר שיעור",
        "אם הסדק הוא לרוחב השופר",
        "אם הסדק הוא לאורך השופר ולא נשאר שיעור"
      ],
      "type": "multiple_choice",
      "num_of_correct": "2",
      "question": "באלו נסיבות **סדק** פוסל את השופר?"
    },
    {
      "content": [
        "הלכה ה @@@ נִקַּב אִם סְתָמוֹ שֶׁלֹּא בְּמִינוֹ פָּסוּל. סְתָמוֹ בְּמִינוֹ אִם נִשְׁתַּיֵּר רֻבּוֹ שָׁלֵם וְלֹא עִכְּבוּ הַנְּקָבִים שֶׁנִּסְתְּמוּ אֶת הַתְּקִיעָה הֲרֵי זֶה כָּשֵׁר.",
        "מגיד משנה @@@ **ניקב וסתמו וכו'.** דברי רבינו הם כדברי ההלכות דבעינן (=שמבקשים) שלושה דברים: שיהיה הסתימה במינו, ושלא ניקב חציו אלא נשתייר רובו, ושאינו מעכב את התקיעה אחר הסתימה.. ופירוש מעכב התקיעה שנחלש הקול קצת ויוצא משם..."
      ],
      "type": "materials",
      "title": "הלכות שופר סוכה ולולב פרק א"
    },
    {
      "content": [
        "אם הנקב נסתם בחומר שלא ממין השופר",
        "אם השופר ניקב ביותר מחציו",
        "אם לאחר סתימתו הנקב מעכב את התקיעה",
        "אם לפני סתימתו הנקב מעכב את התקיעה",
        "אם הנקב נמצא בשליש העליון של השופר",
        "אם הנקב נמצא בחצי התחתון של השופר"
      ],
      "type": "multiple_choice",
      "num_of_correct": "3",
      "question": "באלו נסיבות **נקב** פוסל את השופר?"
    },
    {
      "content": [
        "הלכה ז @@@ הָיָה אָרֹךְ וְקִצְּרוֹ כָּשֵׁר. גֵּרְדוֹ בֵּין מִבִּפְנִים בֵּין מִבַּחוּץ אֲפִלּוּ הֶעֱמִידוֹ עַל גִּלְדּוֹ כָּשֵׁר. הָיָה קוֹלוֹ עָב אוֹ דַּק אוֹ צָרוּר כָּשֵׁר שֶׁכָּל הַקּוֹלוֹת כְּשֵׁרִין בְּשׁוֹפָר:"
      ],
      "type": "materials",
      "title": "הלכות שופר סוכה ולולב פרק א"
    },
    {
      "content": [
        "כל הקולות כשרים",
        "קול צרור (יבש)",
        "קול עבה",
        "קול צרוד"
      ],
      "type": "single_choice",
      "question": "אלו קולות כשרים בשופר?"
    },
    {
      "content": [
        "הלכה ח @@@  הַתּוֹקֵעַ בְּתוֹךְ הַבּוֹר אוֹ בְּתוֹךְ הַמְּעָרָה. אוֹתָן הָעוֹמְדִים בְּתוֹךְ הַבּוֹר וְהַמְּעָרָה יָצְאוּ. וְהָעוֹמְדִים בַּחוּץ אִם קוֹל שׁוֹפָר שָׁמְעוּ יָצְאוּ. וְאִם קוֹל הֲבָרָה שָׁמְעוּ לֹא יָצְאוּ. וְכֵן הַתּוֹקֵעַ לְתוֹךְ חָבִית גְּדוֹלָה וְכַיּוֹצֵא בָּהּ. אִם קוֹל שׁוֹפָר שָׁמַע יָצָא וְאִם קוֹל הֲבָרָה שָׁמַע לֹא יָצָא:"
      ],
      "type": "materials",
      "title": "הלכות שופר סוכה ולולב פרק א"
    },
    {
      "content": [
        "העומדים בפנים יצאו, העומדים בחוץ יתכן ויצאו",
        "העומדים בחוץ יצאו, העומדים בפנים יתכן ויצאו",
        "העומדים בפנים יצאו, וכן העומדים בחוץ",
        "העומדים בפנים לא יצאו יצאו, וכן העומדים בחוץ"
      ],
      "type": "single_choice",
      "question": "התוקע שופר בתוך בור או מערה, האם יצאו ידי חובה העומדים בפנים ובחוץ?"
    }
  ]
}