{
  "subjects": [
    {
      "type": "series",
      "content": "משנה תורה בקיאות"
    },
    {
      "type": "title",
      "content": "הלכות תשובה פרק ד"
    },
    {
      "type": "author",
      "content": "ד\"ר אורן משלי"
    },
    {
      "type": "image",
      "content": "https://1.bp.blogspot.com/-w_mqhphAiaA/UdAMxaoWImI/AAAAAAAAFz0/p4MUO3Iluag/s306/maimonides.jpg"
    },
    {
      "content": [
        "לפנינו שיעור על הפרק הרביעי בהלכות תשובה להרמב\"ם, הפרק אשר מסיים את העיסוק בנושא התשובה (הפרקים הבאים עוסקים בנושאים קשורים כגון בחירת האדם, שכר ועונש ועוד).",
        "אנו מזכירים כי ניתן להחליף בין מצב \"לימוד קלאסי\" לבין מצב \"מונחה שאלות\" המספקים חווית לימוד שונה.",
        "בהצלחה!"
      ],
      "type": "guidelines"
    },
    {
      "content": [
        "הלכה א @@@ אַרְבָעָה וְעֶשְׂרִים דְּבָרִים מְעַכְּבִין אֶת הַתְּשׁוּבָה. אַרְבָּעָה מֵהֶן עָוֹן גָּדוֹל וְהָעוֹשֶׂה אֶחָד מֵהֶן אֵין הַקָּדוֹשׁ בָּרוּךְ הוּא מַסְפִּיק בְּיָדוֹ לַעֲשׂוֹת תְּשׁוּבָה לְפִי גֹּדֶל חֶטְאוֹ. וְאֵלּוּ הֵן. א) הַמַּחְטִיא אֶת הָרַבִּים וּבִכְלַל עָוֹן זֶה הַמְעַכֵּב אֶת הָרַבִּים מִלַּעֲשׂוֹת מִצְוָה. ב) וְהַמַּטֶּה אֶת חֲבֵרוֹ מִדֶּרֶךְ טוֹבָה לְרָעָה כְּגוֹן מֵסִית וּמַדִּיחַ. ג) הָרוֹאֶה בְּנוֹ יוֹצֵא לְתַרְבּוּת רָעָה וְאֵינוֹ מְמַחֶה בְּיָדוֹ. הוֹאִיל וּבְנוֹ בִּרְשׁוּתוֹ אִלּוּ מִחָה בּוֹ הָיָה פּוֹרֵשׁ וְנִמְצָא כְּמַחְטִיאוֹ. וּבִכְלַל עָוֹן זֶה כָּל שֶׁאֶפְשָׁר בְּיָדוֹ לִמְחוֹת בַּאֲחֵרִים בֵּין יָחִיד בֵּין רַבִּים וְלֹא מִחָה אֶלָּא יַנִּיחֵם בְּכִשְׁלוֹנָם. ד) וְהָאוֹמֵר אֶחְטָא וְאָשׁוּב וּבִכְלַל זֶה הָאוֹמֵר אֶחְטָא וְיוֹם הַכִּפּוּרִים מְכַפֵּר:"
      ],
      "type": "materials",
      "title": "הלכות תשובה פרק ד"
    },
    {
      "content": [
        "24",
        "20",
        "21",
        "22",
        "23"
      ],
      "type": "single_choice",
      "question": "כמה דברים הם המעכבים את התשובה?"
    },
    {
      "content": [
        "המחטיא את הרבים",
        "המטה חברו מדרך טובה לרעה",
        "הרואה בנו יוצא לתרבות רעה ואינו מוחה בו",
        "האומר אחטא ואשוב",
        "המבזה רבותיו",
        "המקלל את הרבים",
        "החושד בכשרים",
        "המורגל בלשון הרע"
      ],
      "type": "multiple_choice",
      "num_of_correct": "4",
      "question": "מהם ארבעת העוונות הגדולים שהעושה אותם אין הקב\"ה מספיק בידו לעשות תשובה?"
    },
    {
      "content": [
        "הלכה ב @@@ וּמֵהֶן חֲמִשָּׁה דְּבָרִים הַנּוֹעֲלִים דַּרְכֵי הַתְּשׁוּבָה בִּפְנֵי עוֹשֵׂיהֶן. וְאֵלּוּ הֵן. א) הַפּוֹרֵשׁ מִן הַצִּבּוּר, לְפִי שֶׁבִּזְמַן שֶׁיַּעֲשׂוּ תְּשׁוּבָה לֹא יִהְיֶה עִמָּהֶן וְאֵינוֹ זוֹכֶה עִמָּהֶן בִּזְכוּת שֶׁעוֹשִׂין. ב) וְהַחוֹלֵק עַל דִּבְרֵי חֲכָמִים, לְפִי שֶׁמַּחְלָקְתוֹ גּוֹרֶמֶת לוֹ לִפְרשׁ מֵהֶן וְאֵינוֹ יוֹדֵעַ דַּרְכֵי הַתְּשׁוּבָה. ג) וְהַמַּלְעִיג עַל הַמִּצְוֹת, שֶׁכֵּיוָן שֶׁנִּתְבַּזּוּ בְּעֵינָיו אֵינוֹ רוֹדֵף אַחֲרֵיהֶן וְלֹא עוֹשָׂן וְאִם לֹא יַעֲשֶׂה בַּמֶּה יִזְכֶּה. ד) וְהַמְבַזֶּה רַבּוֹתָיו, שֶׁדָּבָר זֶה גּוֹרֵם לוֹ לְדָחֳפוֹ וּלְטָרְדוֹ כְּגֵיחֲזִי וּבִזְמַן שֶׁנִּטְרָד לֹא יִמְצָא מְלַמֵּד וּמוֹרֶה לוֹ דֶּרֶךְ הָאֱמֶת. ה) וְהַשּׂוֹנֵא אֶת הַתּוֹכָחוֹת שֶׁהֲרֵי לֹא הִנִּיחַ לוֹ דֶּרֶךְ תְּשׁוּבָה. שֶׁהַתּוֹכָחָה גּוֹרֶמֶת לִתְשׁוּבָה שֶׁבִּזְמַן שֶׁמּוֹדִיעִין לוֹ לָאָדָם חֲטָאָיו וּמַכְלִימִין אוֹתוֹ חוֹזֵר בִּתְשׁוּבָה כְּמוֹ שֶׁכָּתוּב בַּתּוֹרָה (דברים ט-ז) 'זְכֹר (וְ) אַל תִּשְׁכַּח'. (דברים ט-ז) 'מַמְרִים הֱיִיתֶם'. (דברים כט-ג) 'וְלֹא נָתַן ה' לָכֶם לֵב'. (דברים לב-ו) 'עַם נָבָל וְלֹא חָכָם'."
      ],
      "type": "materials",
      "title": "הלכות תשובה פרק ד"
    },
    {
      "content": [
        "הפורש מן הציבור",
        "החולק על דברי חכמים",
        "המלעיג על המצוות",
        "המבזה רבותיו",
        "השונא את התוכחות",
        "המקלל את הרבים",
        "החושד בכשרים",
        "המורגל בלשון הרע"
      ],
      "type": "multiple_choice",
      "num_of_correct": "5",
      "question": "מהם חמשת הדברים הנועלים דרכי התשובה בפני עושיהם?"
    },
    {
      "content": [
        "הלכה ג @@@ וּמֵהֶם חֲמִשָּׁה דְּבָרִים הָעוֹשֶׂה אוֹתָן אִי אֶפְשָׁר לוֹ שֶׁיָּשׁוּב בִּתְשׁוּבָה גְּמוּרָה לְפִי שֶׁהֵם עֲוֹנוֹת שֶׁבֵּין אָדָם לַחֲבֵרוֹ וְאֵינוֹ יוֹדֵעַ חֲבֵרוֹ שֶׁחָטָא לוֹ כְּדֵי שֶׁיַּחֲזִיר לוֹ אוֹ יִשְׁאַל מִמֶּנּוּ לִמְחל לוֹ. וְאֵלּוּ הֵן. א) הַמְקַלֵּל אֶת הָרַבִּים וְלֹא קִלֵּל אָדָם יָדוּעַ כְּדֵי שֶׁיִּשְׁאַל מִמֶּנּוּ כַּפָּרָה. ב) וְהַחוֹלֵק עִם גַּנָּב, שֶׁלְּפִי שֶׁאֵינוֹ יוֹדֵעַ גְּנֵבָה זוֹ שֶׁל מִי הִיא אֶלָּא הַגַּנָּב גּוֹנֵב לָרַבִּים וּמֵבִיא לוֹ וְהוּא לוֹקֵחַ. וְעוֹד שֶׁהוּא מַחֲזִיק יַד הַגַּנָּב וּמַחְטִיאוֹ. ג) וְהַמּוֹצֵא אֲבֵדָה וְאֵינוֹ מַכְרִיז עָלֶיהָ עַד שֶׁיַּחֲזִירָהּ לִבְעָלֶיהָ, לְאַחַר זְמַן כְּשֶׁיַּעֲשֶׂה תְּשׁוּבָה אֵינוֹ יוֹדֵעַ לְמִי יַחֲזִיר. ד) וְהָאוֹכֵל שׁוֹר עֲנִיִּים וִיתוֹמִים וְאַלְמָנוֹת. אֵלּוּ בְּנֵי אָדָם אֻמְלָלִין הֵם וְאֵינָן יְדוּעִים וּמְפֻרְסָמִים וְגוֹלִים מֵעִיר לְעִיר וְאֵין לָהֶם מַכִּיר כְּדֵי שֶׁיֵּדַע שׁוֹר זֶה שֶׁל מִי הוּא וְיַחֲזִירֶנּוּ לוֹ. ה) וְהַמְקַבֵּל שֹׁחַד לְהַטּוֹת דִּין אֵינוֹ יוֹדֵעַ עַד הֵיכָן הִגִּיעַ הַטָּיָה זוֹ וְכַמָּה הִיא כֹּחָהּ כְּדֵי שֶׁיַּחֲזִיר, שֶׁהַדָּבָר יֵשׁ לוֹ רַגְלַיִם. וְעוֹד שֶׁהוּא מַחֲזִיק יַד זֶה וּמַחְטִיאוֹ:"
      ],
      "type": "materials",
      "title": "הלכות תשובה פרק ד"
    },
    {
      "content": [
        "5",
        "6",
        "4",
        "3",
        "2"
      ],
      "type": "single_choice",
      "question": "כמה דברים הם שהעושה אותם אי אפשר לו שישוב בתשובה גמורה?"
    },
    {
      "content": [
        "כיוון שיש מקרים בהם לא ידוע כלפי מי נעשה החטא",
        "כיוון שיש עבירות שחזקה היא שאין מחילה עליהם",
        "כיוון שיש מקרים שאין יכולת כספית לחוטא להשיב החוב"
      ],
      "type": "single_choice",
      "question": "מדוע יש עבירות שבין אדם לחברו שאי אפשר לשוב עליהן בתשובה גמורה?"
    },
    {
      "content": [
        "הלכה ד @@@ וּמֵהֶן חֲמִשָּׁה דְּבָרִים הָעוֹשֶׂה אוֹתָן אֵין חֶזְקָתוֹ לָשׁוּב מֵהֶן. לְפִי שֶׁהֵם דְּבָרִים קַלִּים בְּעֵינֵי רֹב הָאָדָם וְנִמְצָא חוֹטֵא וְהוּא יְדַמֶּה שֶׁאֵין זֶה חֵטְא. וְאֵלּוּ הֵן. א) הָאוֹכֵל מִסְּעֻדָּה שֶׁאֵינָהּ מַסְפֶּקֶת לִבְעָלֶיהָ שֶׁזֶּה אֲבַק גֵּזֶל הוּא. וְהוּא מְדַמֶּה שֶׁלֹּא חָטָא וְיֹאמַר כְּלוּם אָכַלְתִּי אֶלָּא בִּרְשׁוּתוֹ. ב) הַמִּשְׁתַּמֵּשׁ בַּעֲבוֹטוֹ שֶׁל עָנִי שֶׁהָעֲבוֹט שֶׁל עָנִי אֵינוֹ אֶלָּא כְּגוֹן קוֹרְדוֹם וּמַחֲרֵשָׁה וְיֹאמַר בְּלִבּוֹ אֵינָן חֲסֵרִים וַהֲרֵי לֹא גָּזַלְתִּי אוֹתוֹ. ג) הַמִּסְתַּכֵּל בַּעֲרָיוֹת מַעֲלֶה עַל דַּעְתּוֹ שֶׁאֵין בְּכָךְ כְּלוּם שֶׁהוּא אוֹמֵר וְכִי בָּעַלְתִּי אוֹ קָרַבְתִּי אֶצְלָהּ. וְהוּא אֵינוֹ יוֹדֵעַ שֶׁרְאִיַּת הָעֵינַיִם עָוֹן גָּדוֹל שֶׁהִיא גּוֹרֶמֶת לְגוּפָן שֶׁל עֲרָיוֹת שֶׁנֶּאֱמַר (במדבר טו-לט) 'וְלֹא תָתֻרוּ אַחֲרֵי לְבַבְכֶם וְאַחֲרֵי עֵינֵיכֶם'..."
      ],
      "type": "materials",
      "title": "הלכות תשובה פרק ד"
    },
    {
      "content": [
        "משום שהוא מדמה שזו עבירה קלה שאין בה כלום",
        "משום ש\"עבירה גוררת עבירה\" במיוחד במקרה זה",
        "משום שקשה במיוחד לשוב מעבירות התלויות בראיית העין"
      ],
      "type": "single_choice",
      "question": "מדוע המסתכל בעריות אין חזקתו לשוב מעבירה זו?"
    },
    {
      "content": [
        "הלכה ו @@@ כָּל אֵלּוּ הַדְּבָרִים וְכַיּוֹצֵא בָּהֶן אַף עַל פִּי שֶׁמְּעַכְּבִין אֶת הַתְּשׁוּבָה אֵין מוֹנְעִין אוֹתָהּ אֶלָּא אִם עָשָׂה אָדָם תְּשׁוּבָה מֵהֶן הֲרֵי זֶה בַּעַל תְּשׁוּבָה וְיֵשׁ לוֹ חֵלֶק לָעוֹלָם הַבָּא:"
      ],
      "type": "materials",
      "title": "הלכות תשובה פרק ד"
    },
    {
      "content": [
        "לא",
        "כן",
        "חלק כן וחלק לא"
      ],
      "type": "single_choice",
      "question": "האם עשרים וארבעה הדברים אשר מעכבים את התשובה **מונעים** אותה?"
    }
  ]
}