{
  "subjects": [
    {
      "type": "series",
      "content": "משנה תורה בקיאות"
    },
    {
      "type": "title",
      "content": "הלכות תשובה פרק ג"
    },
    {
      "type": "author",
      "content": "ד\"ר אורן משלי"
    },
    {
      "type": "image",
      "content": "https://1.bp.blogspot.com/-w_mqhphAiaA/UdAMxaoWImI/AAAAAAAAFz0/p4MUO3Iluag/s306/maimonides.jpg"
    },
    {
      "content": [
        "הלכות תשובה להרמב\"ם מסיימות את **ספר המדע** ומכילות 10 פרקים, עם נושאים כגון תשובה, בחירת האדם, שכר ועונש, ועוד.",
        "שיעור זה מתמקד בפרק השלישי בהלכות תשובה להרמב\"ם, אשר ממשיך לעסוק בנושא התשובה.",
        "בהצלחה!"
      ],
      "type": "guidelines"
    },
    {
      "content": [
        "הלכה א @@@ כָּל אֶחָד וְאֶחָד מִבְּנֵי הָאָדָם יֵשׁ לוֹ זְכֻיּוֹת וַעֲוֹנוֹת. מִי שֶׁזְּכֻיּוֹתָיו יְתֵרוֹת עַל עֲוֹנוֹתָיו צַדִּיק. וּמִי שֶׁעֲוֹנוֹתָיו יְתֵרוֹת עַל זְכֻיּוֹתָיו רָשָׁע. מֶחֱצָה לְמֶחֱצָה בֵּינוֹנִי. וְכֵן הַמְּדִינָה אִם הָיוּ זְכֻיּוֹת כָּל יוֹשְׁבֶיהָ מְרֻבּוֹת עַל עֲוֹנוֹתֵיהֶן הֲרֵי זוֹ צַדֶּקֶת. וְאִם הָיוּ עֲוֹנוֹתֵיהֶם מְרֻבִּין הֲרֵי זוֹ רְשָׁעָה. וְכֵן כָּל הָעוֹלָם כֻּלּוֹ:"
      ],
      "type": "materials",
      "title": "הלכות תשובה פרק ג"
    },
    {
      "content": [
        "מי שיש לו יותר זכויות מעוונות",
        "מי שיש לו זכויות רבות ומעט עוונות",
        "מי שיש לו רק זכויות ללא עוונות"
      ],
      "type": "single_choice",
      "question": "מיהו לפי הרמב\"ם \"צדיק\"?"
    },
    {
      "content": [
        "מי שיש לו פחות זכויות מעוונות",
        "מי שיש לו עוונות רבים ומעט זכויות",
        "מי שיש לו רק עוונות ללא זכויות"
      ],
      "type": "single_choice",
      "question": "כיצד מגדיר הרמב\"ם \"רשע\"?"
    },
    {
      "content": [
        "מי שזכויותיו שקולות לעוונותיו",
        "מי שיש לו עוונות רבים ומעט זכויות",
        "מי שיש לו זכויות רבות ומעט עוונות"
      ],
      "type": "single_choice",
      "question": "מיהו \"בינוני\"?"
    },
    {
      "content": [
        "הלכה ב @@@ אָדָם שֶׁעֲוֹנוֹתָיו מְרֻבִּין עַל זְכֻיּוֹתָיו מִיָּד הוּא מֵת בְּרִשְׁעוֹ שֶׁנֶּאֱמַר עַל רֹב עֲוֹנֵךְ. וְכֵן מְדִינָה שֶׁעֲוֹנוֹתֶיהָ מְרֻבִּין מִיָּד הִיא אוֹבֶדֶת שֶׁנֶּאֱמַר (בראשית יח-כ) 'זַעֲקַת סְדֹם וַעֲמֹרָה כִּי רָבָּה' וְגוֹ'. וְכֵן כָּל הָעוֹלָם כֻּלּוֹ אִם הָיוּ עֲוֹנוֹתֵיהֶם מְרֻבִּין מִזְּכֻיּוֹתֵיהֶן מִיָּד הֵן נִשְׁחָתִין שֶׁנֶּאֱמַר (בראשית ו-ה) 'וַיַּרְא ה' כִּי רַבָּה רָעַת הָאָדָם'."
      ],
      "type": "materials",
      "title": "הלכות תשובה פרק ג"
    },
    {
      "content": [
        "ימות מיד",
        "ימות עד יום הכיפורים",
        "יתכן וימות לאחר יום הכיפורים"
      ],
      "type": "single_choice",
      "question": "מה דינו של אדם רשע שעוונותיו מרובים על זכויותיו?"
    },
    {
      "content": [
        "הלכה ב @@@ ...וְשִׁקּוּל זֶה אֵינוֹ לְפִי מִנְיַן הַזְּכֻיּוֹת וְהָעֲוֹנוֹת אֶלָּא לְפִי גָּדְלָם. יֵשׁ זְכוּת שֶׁהִיא כְּנֶגֶד כַּמָּה עֲוֹנוֹת שֶׁנֶּאֱמַר (מלכים א יד-יג) 'יַעַן נִמְצָא בוֹ דָּבָר טוֹב'. וְיֵשׁ עָוֹן שֶׁהוּא כְּנֶגֶד כַּמָּה זְכֻיּוֹת שֶׁנֶּאֱמַר (קהלת ט-יח) 'וְחוֹטֶא אֶחָד יְאַבֵּד טוֹבָה הַרְבֵּה'. וְאֵין שׁוֹקְלִין אֶלָּא בְּדַעְתּוֹ שֶׁל אֵל דֵּעוֹת וְהוּא הַיּוֹדֵעַ הֵיאַךְ עוֹרְכִין הַזְּכֻיּוֹת כְּנֶגֶד הָעֲוֹנוֹת:"
      ],
      "type": "materials",
      "title": "הלכות תשובה פרק ג"
    },
    {
      "content": [
        "אופן שקלול הזכויות מול העוונות נשגב מבינתנו",
        "אלו מקרים יוצאים מן הכלל בבחינת \"וחנותי את אשר אחון\"",
        "הקב\"ה מאריך אפיו על מנת שהרשע יחזור בתשובה",
        "הרשע אמנם חי אך \"רשעים בחייהם קרויים מתים\""
      ],
      "type": "single_choice",
      "question": "איך יתכן שרשע דינו מיתה מיידית בעוד אנו רואים רשעים אשר מאריכים ימים?"
    },
    {
      "content": [
        "הלכה ג @@@ כָּל מִי שֶׁנִּחַם עַל הַמִּצְוֹת שֶׁעָשָׂה וְתָהָה עַל הַזְּכֻיּוֹת וְאָמַר בְּלִבּוֹ וּמַה הוֹעַלְתִּי בַּעֲשִׂיָּתָן הַלְוַאי לֹא עָשִׂיתִי אוֹתָן הֲרֵי זֶה אִבֵּד אֶת כֻּלָּן וְאֵין מַזְכִּירִים לוֹ שׁוּם זְכוּת בָּעוֹלָם שֶׁנֶּאֱמַר (יחזקאל לג-יב) 'וְצִדְקַת הַצַּדִּיק לֹא תַצִּילֶנּוּ בְּיוֹם רִשְׁעוֹ', אֵין זֶה אֶלָּא בְּתוֹהֶה עַל הָרִאשׁוֹנוֹת."
      ],
      "type": "materials",
      "title": "הלכות תשובה פרק ג"
    },
    {
      "content": [
        "כל המצוות והזכויות שלו הולכות לאיבוד",
        "חלק משכר המצוות והזכויות שלו הולך לאיבוד",
        "מצוות וזכויות אשר כבר נעשו עומדות לעד"
      ],
      "type": "single_choice",
      "question": "מה קורה למי שהצטער על המצוות והמעשים הטובים שעשה?"
    },
    {
      "content": [
        "הלכה ג @@@ וּכְשֵׁם שֶׁשּׁוֹקְלִין זְכֻיּוֹת אָדָם וַעֲוֹנוֹתָיו בִּשְׁעַת מִיתָתוֹ כָּךְ בְּכָל שָׁנָה וְשָׁנָה שׁוֹקְלִין עֲוֹנוֹת כָּל אֶחָד וְאֶחָד מִבָּאֵי הָעוֹלָם עִם זְכֻיּוֹתָיו, בְּיוֹם טוֹב שֶׁל רֹאשׁ הַשָּׁנָה. מִי שֶׁנִּמְצָא צַדִּיק נֶחְתָּם לְחַיִּים. וּמִי שֶׁנִּמְצָא רָשָׁע נֶחְתָּם לְמִיתָה. וְהַבֵּינוֹנִי תּוֹלִין אוֹתוֹ עַד יוֹם הַכִּפּוּרִים אִם עָשָׂה תְּשׁוּבָה נֶחְתָּם לְחַיִּים וְאִם לָאו נֶחְתָּם לְמִיתָה:"
      ],
      "type": "materials",
      "title": "הלכות תשובה פרק ג"
    },
    {
      "content": [
        "צדיק",
        "רשע",
        "בינוני"
      ],
      "type": "multiple_choice",
      "num_of_correct": "2",
      "question": "מי הוא אשר חתימתו נעשית כבר בראש השנה?"
    },
    {
      "content": [
        "הלכה ד @@@ אַף עַל פִּי שֶׁתְּקִיעַת שׁוֹפָר בְּרֹאשׁ הַשָּׁנָה גְּזֵרַת הַכָּתוּב רֶמֶז יֵשׁ בּוֹ כְּלוֹמַר עוּרוּ יְשֵׁנִים מִשְּׁנַתְכֶם וְנִרְדָּמִים הָקִיצוּ מִתַּרְדֵּמַתְכֶם וְחַפְּשׂוּ בְּמַעֲשֵׂיכֶם וְחִזְרוּ בִּתְשׁוּבָה וְזִכְרוּ בּוֹרַאֲכֶם. אֵלּוּ הַשּׁוֹכְחִים אֶת הָאֱמֶת בְּהַבְלֵי הַזְּמַן וְשׁוֹגִים כָּל שְׁנָתָם בְּהֶבֶל וָרִיק אֲשֶׁר לֹא יוֹעִיל וְלֹא יַצִּיל, הַבִּיטוּ לְנַפְשׁוֹתֵיכֶם וְהֵיטִיבוּ דַּרְכֵיכֶם וּמַעַלְלֵיכֶם וְיַעֲזֹב כָּל אֶחָד מִכֶּם דַּרְכּוֹ הָרָעָה וּמַחֲשַׁבְתּוֹ אֲשֶׁר לֹא טוֹבָה."
      ],
      "type": "materials",
      "title": "הלכות תשובה פרק ג"
    },
    {
      "content": [
        "להתעורר \"מהשינה\" ולחזור בתשובה",
        "לזכור את בורא העולם",
        "לזכור את אילו של יצחק",
        "לזכור את מעמד הר סיני"
      ],
      "type": "multiple_choice",
      "num_of_correct": "2",
      "question": "מה באה תקיעת השופר לרמוז לאדם?"
    },
    {
      "content": [
        "הלכה ד @@@ לְפִיכָךְ צָרִיךְ כָּל אָדָם שֶׁיִּרְאֶה עַצְמוֹ כָּל הַשָּׁנָה כֻּלָּהּ כְּאִלּוּ חֶצְיוֹ זַכַּאי וְחֶצְיוֹ חַיָּב. וְכֵן כָּל הָעוֹלָם חֶצְיוֹ זַכַּאי וְחֶצְיוֹ חַיָּב. חָטָא חֵטְא אֶחָד הֲרֵי הִכְרִיעַ אֶת עַצְמוֹ וְאֶת כָּל הָעוֹלָם כֻּלּוֹ לְכַף חוֹבָה וְגָרַם לוֹ הַשְׁחָתָה. עָשָׂה מִצְוָה אַחַת הֲרֵי הִכְרִיעַ אֶת עַצְמוֹ וְאֶת כָּל הָעוֹלָם כֻּלּוֹ לְכַף זְכוּת וְגָרַם לוֹ וְלָהֶם תְּשׁוּעָה וְהַצָּלָה שֶׁנֶּאֱמַר (משלי י-כה) 'וְצַדִּיק יְסוֹד עוֹלָם' זֶה שֶׁצָּדַק הִכְרִיעַ אֶת כָּל הָעוֹלָם לִזְכוּת וְהִצִּילוֹ."
      ],
      "type": "materials",
      "title": "הלכות תשובה פרק ג"
    },
    {
      "content": [
        "כאילו יש לו חצי עוונות וחצי זכויות בדיוק",
        "כאילו יש לו זכות אחת יתירה על עוונותיו",
        "כאילו יש לו עבירה אחת יתירה על זכויותיו"
      ],
      "type": "single_choice",
      "question": "כיצד צריך אדם לראות את עצמו במהלך כל השנה כולה?"
    },
    {
      "content": [
        "שביכולת כל אדם להכריע את העולם כולו לכף זכות",
        "שביכולת אדם צדיק להכריע את העולם כולו לכף זכות",
        "שביכולת כל אדם להכריע את העולם כולו לכף חובה",
        "שביכולת אדם צדיק להכריע את העולם כולו לכף חובה"
      ],
      "type": "single_choice",
      "question": "מהו הלימוד היוצא מהפסוק \"וצדיק יסוד עולם\"?"
    },
    {
      "content": [
        "הלכה ה @@@ בְּשָׁעָה שֶׁשּׁוֹקְלִין עֲוֹנוֹת אָדָם עִם זְכֻיּוֹתָיו אֵין מְחַשְּׁבִין עָלָיו עָוֹן שֶׁחָטָא בּוֹ תְּחִלָּה וְלֹא שֵׁנִי אֶלָּא מִשְּׁלִישִׁי וְאֵילָךְ. אִם נִמְצְאוּ עֲוֹנוֹתָיו מִשְּׁלִישִׁי וְאֵילָךְ מְרֻבִּין עַל זְכֻיּוֹתָיו אוֹתָם שְׁתֵּי עֲוֹנוֹת מִצְטָרְפִים וְדָנִין אוֹתוֹ עַל הַכּל. וְאִם נִמְצְאוּ זְכֻיּוֹתָיו כְּנֶגֶד עֲוֹנוֹתָיו אֲשֶׁר מֵעָוֹן שְׁלִישִׁי וְאֵילָךְ מַעֲבִירִים כָּל עֲוֹנוֹתָיו רִאשׁוֹן רִאשׁוֹן. לְפִי שֶׁהַשְּׁלִישִׁי נֶחְשָׁב רִאשׁוֹן שֶׁכְּבָר נִמְחֲלוּ הַשְּׁנַיִם. וְכֵן הָרְבִיעִי הֲרֵי הוּא רִאשׁוֹן שֶׁכְּבָר נִמְחַל הַשְּׁלִישִׁי וְכֵן עַד סוֹפָן."
      ],
      "type": "materials",
      "title": "הלכות תשובה פרק ג"
    },
    {
      "content": [
        "עוון ראשון ושני בהתאם לנסיבות",
        "עוון ראשון ושני בכל אופן",
        "עוון ראשון שני ושלישי בהתאם לנסיבות",
        "עוון ראשון שני ושלישי בכל אופן"
      ],
      "type": "single_choice",
      "question": "כששוקלים עוונות אדם כנגד זכויותיו, באיזה עוון לא מתחשבים?"
    },
    {
      "content": [
        "הלכה ה @@@ בַּמֶּה דְּבָרִים אֲמוּרִים בְּיָחִיד שֶׁנֶּאֱמַר (איוב לג-כט) 'הֶן כָּל אֵלֶּה יִפְעַל אֵל פַּעֲמַיִם שָׁלוֹשׁ עִם גָּבֶר'. אֲבָל הַצִּבּוּר תּוֹלִין לָהֶן עָוֹן רִאשׁוֹן שֵׁנִי וּשְׁלִישִׁי שֶׁנֶּאֱמַר (עמוס ב-ו) 'עַל שְׁלֹשָׁה פִּשְׁעֵי יִשְׂרָאֵל וְעַל אַרְבָּעָה לֹא אֲשִׁיבֶנּוּ'. וּכְשֶׁמְּחַשְּׁבִין לָהֶן עַל דֶּרֶךְ זֶה מְחַשְּׁבִין לָהֶן מֵרְבִיעִי וְאֵילָךְ.",
        "כסף משנה @@@ **ומה שכתב תולין** עניינו שתולין להם שלש עונות אלו, ואין מניחין אותן במשקל עד שישקלו כל עונותיהם. כיון שנשקלו עונותיהם, אם נמצאו מרביעי ואילך מרובין על זכיותיהם, אותם ג' עונות מצטרפין ודנים אותם על הכל. ואם נמצאו זכיותיהם כנגד עונותיהם מרביעי ואילך, מעבירין כל עונותיהם ראשון ראשון."
      ],
      "type": "materials",
      "title": "הלכות תשובה פרק ג"
    },
    {
      "content": [
        "עוון ראשון שני ושלישי בהתאם לנסיבות",
        "עוון ראשון ושני בהתאם לנסיבות",
        "עוון ראשון ושני בכל אופן",
        "עוון ראשון שני ושלישי בכל אופן"
      ],
      "type": "single_choice",
      "question": "כששוקלים עוונות **ציבור** כנגד זכויותיו, באיזה עוון לא מתחשבים?"
    },
    {
      "content": [
        "הלכה ה @@@ ...וְכֵן כָּל הָרְשָׁעִים שֶׁעֲוֹנוֹתֵיהֶן מְרֻבִּים דָּנִין אוֹתָן כְּפִי חֲטָאֵיהֶם וְיֵשׁ לָהֶן חֵלֶק לָעוֹלָם הַבָּא שֶׁכָּל יִשְׂרָאֵל יֵשׁ לָהֶם חֵלֶק לָעוֹלָם הַבָּא אַף עַל פִּי שֶׁחָטְאוּ שֶׁנֶּאֱמַר (ישעיה ס-כא) 'וְעַמֵּךְ כֻּלָּם צַדִּיקִים לְעוֹלָם יִירְשׁוּ אָרֶץ'. אֶרֶץ זוֹ מָשָׁל כְּלוֹמַר אֶרֶץ הַחַיִּים וְהוּא הָעוֹלָם הַבָּא.",
        "הלכה ו @@@ וְאֵלּוּ הֵן שֶׁאֵין לָהֶן חֵלֶק לָעוֹלָם הַבָּא אֶלָּא נִכְרָתִים וְאוֹבְדִין וְנִדּוֹנִין עַל גֹּדֶל רִשְׁעָם וְחַטָּאתָם לְעוֹלָם וּלְעוֹלְמֵי עוֹלָמִים. הַמִּינִים. וְהָאֶפִּיקוֹרוֹסִין. וְהַכּוֹפְרִים בַּתּוֹרָה. וְהַכּוֹפְרִים בִּתְחִיַּת הַמֵּתִים וּבְבִיאַת הַגּוֹאֵל. הַמּוֹרְדִים. וּמַחֲטִיאֵי הָרַבִּים. וְהַפּוֹרְשִׁין מִדַּרְכֵי צִבּוּר. וְהָעוֹשֶׂה עֲבֵרוֹת בְּיָד רָמָה בְּפַרְהֶסְיָא כִּיהוֹיָקִים. וְהַמּוֹסְרִים. וּמַטִּילֵי אֵימָה עַל הַצִּבּוּר שֶׁלֹּא לְשֵׁם שָׁמַיִם. וְשׁוֹפְכֵי דָּמִים. וּבַעֲלֵי לָשׁוֹן הָרַע. וְהַמּוֹשֵׁךְ עָרְלָתוֹ:"
      ],
      "type": "materials",
      "title": "הלכות תשובה פרק ג"
    },
    {
      "content": [
        "תלוי בסוג הרשע",
        "כן",
        "לא"
      ],
      "type": "single_choice",
      "question": "האם לרשעים יש חלק לעולם הבא?"
    },
    {
      "content": [
        "הלכה ז @@@ חֲמִשָּׁה הֵן הַנִּקְרָאִים מִינִים. הָאוֹמֵר שֶׁאֵין שָׁם אֱלוֹהַּ וְאֵין לָעוֹלָם מַנְהִיג. וְהָאוֹמֵר שֶׁיֵּשׁ שָׁם מַנְהִיג אֲבָל הֵן שְׁנַיִם אוֹ יוֹתֵר. וְהָאוֹמֵר שֶׁיֵּשׁ שָׁם רִבּוֹן אֶחָד אֲבָל שֶׁהוּא גּוּף וּבַעַל תְּמוּנָה. וְכֵן הָאוֹמֵר שֶׁאֵינוֹ לְבַדּוֹ הָרִאשׁוֹן וְצוּר לַכּל. וְכֵן הָעוֹבֵד כּוֹכָב אוֹ מַזָּל וְזוּלָתוֹ כְּדֵי לִהְיוֹת מֵלִיץ בֵּינוֹ וּבֵין רִבּוֹן הָעוֹלָמִים. כָּל אֶחָד מֵחֲמִשָּׁה אֵלּוּ הוּא מִין:",
        "הלכה ח @@@ שְׁלֹשָׁה הֵן הַנִּקְרָאִים אֶפִּיקוֹרְסִין. הָאוֹמֵר שֶׁאֵין שָׁם נְבוּאָה כְּלָל וְאֵין שָׁם מַדָּע שֶׁמַּגִּיעַ מֵהַבּוֹרֵא לְלֵב בְּנֵי הָאָדָם. וְהַמַּכְחִישׁ נְבוּאָתוֹ שֶׁל משֶׁה רַבֵּנוּ. וְהָאוֹמֵר שֶׁאֵין הַבּוֹרֵא יוֹדֵעַ מַעֲשֵׂה בְּנֵי הָאָדָם. כָּל אֶחָד מִשְּׁלֹשָׁה אֵלּוּ הֵן אֶפִּיקוֹרוֹסִים."
      ],
      "type": "materials",
      "title": "הלכות תשובה פרק ג"
    },
    {
      "content": [
        "מין שוגה בתפיסת הבורא עצמו, ואפיקורס שוגה ביחס בין בורא לנברא",
        "אפיקורס שוגה בתפיסת הבורא עצמו, ומין שוגה ביחס בין בורא לנברא",
        "גם מין וגם אפיקורס שוגים בתפיסת הבורא עצמו, אך בדרגת חומרה שונה",
        "גם מין וגם אפיקורס שוגים ביחס בין בורא לנברא, אך בדרגת חומרה שונה"
      ],
      "type": "single_choice",
      "question": "מהו ההבדל בין התפיסות השגויות של \"מין\" לבין אלו של \"אפיקורס\"?"
    },
    {
      "content": [
        "הלכה ח @@@ שְׁלֹשָׁה הֵן הַכּוֹפְרִים בַּתּוֹרָה. הָאוֹמֵר שֶׁאֵין הַתּוֹרָה מֵעִם ה' אֲפִלּוּ פָּסוּק אֶחָד אֲפִלּוּ תֵּבָה אַחַת אִם אָמַר משֶׁה אֲמָרוֹ מִפִּי עַצְמוֹ הֲרֵי זֶה כּוֹפֵר בַּתּוֹרָה. וְכֵן הַכּוֹפֵר בְּפֵרוּשָׁהּ וְהוּא תּוֹרָה שֶׁבְּעַל פֶּה וְהַמַּכְחִישׁ מַגִּידֶיהָ כְּגוֹן צָדוֹק וּבַיְתּוֹס. וְהָאוֹמֵר שֶׁהַבּוֹרֵא הֶחֱלִיף מִצְוָה זוֹ בְּמִצְוָה אַחֶרֶת וּכְבָר בָּטְלָה תּוֹרָה זוֹ אַף עַל פִּי שֶׁהִיא הָיְתָה מֵעִם ה' כְּגוֹן הָהַגְרִים. כָּל אֶחָד מִשְּׁלֹשָׁה אֵלּוּ כּוֹפֵר בַּתּוֹרָה:"
      ],
      "type": "materials",
      "title": "הלכות תשובה פרק ג"
    },
    {
      "content": [
        "האומר שמשה אמר התורה מעצמו ולא מאת ה'",
        "הכופר בתורה שבעל פה ובמוסריה",
        "האומר שהתורה היתה אמת אך הוחלפה באחרת",
        "האומר שאין מצוותיה של התורה גזירות"
      ],
      "type": "multiple_choice",
      "num_of_correct": "3",
      "question": "מהם סוגי הכופרים בתורה?"
    },
    {
      "content": [
        "הלכה יד @@@ כָּל אֶחָד וְאֶחָד מֵעֶשְׂרִים וְאַרְבָּעָה אֲנָשִׁים אֵלּוּ שֶׁמָּנִינוּ אַף עַל פִּי שֶׁהֵן מִיִּשְׂרָאֵל אֵין לָהֶם חֵלֶק לָעוֹלָם הַבָּא. וְיֵשׁ עֲבֵרוֹת קַלּוֹת מֵאֵלּוּ וְאַף עַל פִּי כֵן אָמְרוּ חֲכָמִים שֶׁהָרָגִיל בָּהֶן אֵין לָהֶם חֵלֶק לָעוֹלָם הַבָּא (וּכְדֵי) [וּכְדַאי] הֵן לְהִתְרַחֵק מֵהֶן וּלְהִזָּהֵר בָּהֶן. וְאֵלּוּ הֵן. הַמְכַנֶּה שֵׁם לַחֲבֵרוֹ. וְהַקּוֹרֵא לַחֲבֵרוֹ בְּכִנּוּיוֹ. וְהַמַּלְבִּין פְּנֵי חֲבֵרוֹ בָּרַבִּים. וְהַמִּתְכַּבֵּד בִּקְלוֹן חֲבֵרוֹ. וְהַמְבַזֶּה תַּלְמִידֵי חֲכָמִים. וְהַמְבַזֶּה רַבּוֹתָיו. וְהַמְבַזֶּה אֶת הַמּוֹעֲדוֹת. וְהַמְחַלֵּל אֶת הַקָּדָשִׁים."
      ],
      "type": "materials",
      "title": "הלכות תשובה פרק ג"
    },
    {
      "content": [
        "כן, מדברי חכמים ובתנאי שזה לא נעשה לא הרגל",
        "כן, מדין תורה ובתנאי שזה לא נעשה לא הרגל",
        "לא, מדברי חכמים ובתנאי שלא עשה תשובה",
        "לא, מדין תורה ובתנאי שלא עשה תשובה"
      ],
      "type": "single_choice",
      "question": "האם המלבין פני חברו ברבים יש לו חלק לעולם הבא?"
    }
  ]
}