{
  "subjects": [
    {
      "type": "series",
      "content": "משנה תורה בקיאות"
    },
    {
      "type": "title",
      "content": "הלכות שופר סוכה ולולב פרק ג"
    },
    {
      "type": "author",
      "content": "ד\"ר אורן משלי"
    },
    {
      "type": "image",
      "content": "https://1.bp.blogspot.com/-w_mqhphAiaA/UdAMxaoWImI/AAAAAAAAFz0/p4MUO3Iluag/s306/maimonides.jpg"
    },
    {
      "content": [
        "הלכות שופר סוכה ולולב עוסקות בשלוש מצוות מרכזיות השייכות לראש השנה (שופר) ולחג הסוכות (סוכה ולולב). שלושת הפרקים הראשונים עוסקים במצוות השופר ולפנינו שיעור על הפרק השלישי.",
        "שימו לב כי ניתן להחליף בין מצב \"לימוד קלאסי\" המתאים ללימוד ראשוני לבין מצב \"מונחה שאלות\" המתאים יותר **לשינון חוזר**.",
        "בהצלחה!"
      ],
      "type": "guidelines"
    },
    {
      "content": [
        "הלכה א @@@ כַּמָּה תְּקִיעוֹת חַיָּב אָדָם לִשְׁמֹעַ בְּרֹאשׁ הַשָּׁנָה. תֵּשַׁע תְּקִיעוֹת. לְפִי שֶׁנֶּאֱמַר תְּרוּעָה בְּיוֹבֵל וּבְרֹאשׁ הַשָּׁנָה שָׁלֹשׁ פְּעָמִים. וְכָל תְּרוּעָה פְּשׁוּטָה לְפָנֶיהָ וּפְשׁוּטָה לְאַחֲרֶיהָ. וּמִפִּי הַשְּׁמוּעָה לָמְדוּ שֶׁכָּל תְּרוּעוֹת שֶׁל חֹדֶשׁ הַשְּׁבִיעִי אֶחָד הֵן. בֵּין בְּרֹאשׁ הַשָּׁנָה בֵּין בְּיוֹם הַכִּפּוּרִים שֶׁל יוֹבֵל תֵּשַׁע תְּקִיעוֹת תּוֹקְעִין בְּכָל אֶחָד מִשְּׁנֵיהֶן. תְּקִיעָה וּתְרוּעָה וּתְקִיעָה. תְּקִיעָה וּתְרוּעָה וּתְקִיעָה. תְּקִיעָה וּתְרוּעָה וּתְקִיעָה:"
      ],
      "type": "materials",
      "title": "הלכות שופר סוכה ולולב פרק ג"
    },
    {
      "content": [
        "שש פשוטות, שלוש תרועות",
        "שלוש פשוטות, שלוש תרועות",
        "שש תרועות, שלוש פשוטות",
        "שש פשוטות, שש תרועות"
      ],
      "type": "single_choice",
      "question": "כמה תקיעות פשוטות וכמה תרועות חייב אדם לשמוע בראש השנה דין תורה?"
    },
    {
      "content": [
        "הלכה ב @@@ תְּרוּעָה זוֹ הָאֲמוּרָה בַּתּוֹרָה נִסְתַּפֵּק לָנוּ בָּהּ סָפֵק לְפִי אֹרֶךְ הַשָּׁנִים וְרֹב הַגָּלוּת וְאֵין אָנוּ יוֹדְעִין הֵיאַךְ הִיא. אִם הִיא הַיְלָלָה שֶׁמְּיַלְּלִין הַנָּשִׁים בֵּינֵיהֶן בְּעֵת שֶׁמְּיַבְּבִין. אוֹ הָאֲנָחָה כְּדֶרֶךְ שֶׁיֵּאָנַח הָאָדָם פַּעַם אַחַר פַּעַם כְּשֶׁיִּדְאַג לִבּוֹ מִדָּבָר גָּדוֹל. אוֹ שְׁנֵיהֶם כְּאֶחָד הָאֲנָחָה וְהַיְלָלָה שֶׁדַּרְכָּהּ לָבוֹא אַחֲרֶיהָ הֵן הַנִּקְרָאִין תְּרוּעָה. שֶׁכָּךְ דֶּרֶךְ הַדּוֹאֵג מִתְאַנֵּחַ תְּחִלָּה וְאַחַר כָּךְ מְיַלֵּל. לְכָךְ אָנוּ עוֹשִׂין הַכּל:"
      ],
      "type": "materials",
      "title": "הלכות שופר סוכה ולולב פרק ג"
    },
    {
      "content": [
        "אם היא יללה, אנחה, או שניהם יחד",
        "אם היא יללה, אנחה, או יבבה",
        "אם היא יללה, יבבה, או שניהם יחד",
        "אם היא אנחה או יבבה"
      ],
      "type": "single_choice",
      "question": "מהו הספק שיש בידינו לגבי **התרועה** האמורה בתורה?"
    },
    {
      "content": [
        "הלכה ג @@@ הַיְלָלָה הִיא שֶׁאָנוּ קוֹרְאִין תְּרוּעָה. וְהָאֲנָחָה זוֹ אַחַר זוֹ הִיא שֶׁאָנוּ קוֹרְאִין אוֹתָהּ שְׁלֹשָׁה שְׁבָרִים. נִמְצָא סֵדֶר הַתְּקִיעוֹת כָּךְ הוּא. מְבָרֵךְ וְתוֹקֵעַ תְּקִיעָה וְאַחֲרֶיהָ שְׁלֹשָׁה שְׁבָרִים וְאַחֲרֶיהָ תְּרוּעָה וְאַחֲרֶיהָ תְּקִיעָה. וְחוֹזֵר כְּסֵדֶר זֶה שָׁלֹשׁ פְּעָמִים. וְתוֹקֵעַ תְּקִיעָה וְאַחֲרֶיהָ שְׁלֹשָׁה שְׁבָרִים וְאַחֲרֶיהָ תְּקִיעָה וְחוֹזֵר כַּסֵּדֶר הַזֶּה שָׁלֹשׁ פְּעָמִים. וְתוֹקֵעַ תְּקִיעָה וְאַחֲרֶיהָ תְּרוּעָה וְאַחֲרֶיהָ תְּקִיעָה וְחוֹזֵר כְּסֵדֶר זֶה שָׁלֹשׁ פְּעָמִים. נִמְצָא מִנְיַן הַתְּקִיעוֹת שְׁלֹשִׁים כְּדֵי לְהִסְתַּלֵּק מִן הַסָּפֵק:"
      ],
      "type": "materials",
      "title": "הלכות שופר סוכה ולולב פרק ג"
    },
    {
      "content": [
        "18 תקיעות, 6 שברים, 6 תרועות",
        "12 תקיעות, 6 שברים, 6 תרועות",
        "18 תקיעות, 3 שברים, 3 תרועות",
        "12 תקיעות, 3 שברים, 3 תרועות"
      ],
      "type": "single_choice",
      "question": "כמה תקיעות שברים ותרועות סך הכל, חייב אדם לשמוע בראש השנה על מנת להסתלק מן הספק?"
    },
    {
      "content": [
        "הלכה ד @@@ שִׁעוּר תְּרוּעָה כִּשְׁתֵּי תְּקִיעוֹת. שִׁעוּר שְׁלֹשָׁה שְׁבָרִים כִּתְרוּעָה. הֲרֵי שֶׁתָּקַע וְהֵרִיעַ וְתָקַע תְּקִיעָה אֲרֻכָּה וּמָשַׁךְ בָּהּ כִּשְׁתַּיִם בָּרִאשׁוֹנָה. אֵין אוֹמְרִין תֵּחָשֵׁב כִּשְׁתֵּי תְּקִיעוֹת וְיָרִיעַ אַחֲרֶיהָ וְיַחֲזֹר וְיִתְקַע. אֶלָּא אֲפִלּוּ מָשַׁךְ בָּהּ כָּל הַיּוֹם אֵינָהּ אֶלָּא תְּקִיעָה אַחַת וְחוֹזֵר וְתוֹקֵעַ וּמֵרִיעַ וְתוֹקֵעַ שָׁלֹשׁ פְּעָמִים:"
      ],
      "type": "materials",
      "title": "הלכות שופר סוכה ולולב פרק ג"
    },
    {
      "content": [
        "כשתי תקיעות",
        "כשלוש תקיעות",
        "כתקיעה אחת"
      ],
      "type": "single_choice",
      "question": "מהו שעור תרועה?"
    },
    {
      "content": [
        "כשתי תקיעות",
        "כשלוש תקיעות",
        "כתקיעה אחת"
      ],
      "type": "single_choice",
      "question": "מהו שעור שלושה שברים?"
    },
    {
      "content": [
        "הלכה ו @@@ שָׁמַע תֵּשַׁע תְּקִיעוֹת מִתִּשְׁעָה בְּנֵי אָדָם כְּאֶחָד לֹא יָצָא אֲפִלּוּ יְדֵי אַחַת. תְּקִיעָה מִזֶּה וּתְרוּעָה מִזֶּה וּתְקִיעָה מִשְּׁלִישִׁי בָּזֶה אַחַר זֶה יָצָא וַאֲפִלּוּ בְּסֵרוּגִין וַאֲפִלּוּ כָּל הַיּוֹם כֻּלּוֹ. וְאֵינוֹ יוֹצֵא יְדֵי חוֹבָתוֹ עַד שֶׁיִּשְׁמַע כָּל הַתֵּשַׁע תְּקִיעוֹת שֶׁכֻּלָּן מִצְוָה אַחַת הֵן לְפִיכָךְ מְעַכְּבוֹת זוֹ אֶת זוֹ:"
      ],
      "type": "materials",
      "title": "הלכות שופר סוכה ולולב פרק ג"
    },
    {
      "content": [
        "כן, בתנאי שתקעו זה אחר זה לפי סדר התקיעות",
        "כן, בתנאי שתקעו יחדיו לפי סדר התקיעות",
        "לא, יש לשמוע את כל סדר התקיעות מאדם אחד",
        "לא, יש לשמוע לכל הפחות שלוש תקיעות מאדם אחד"
      ],
      "type": "single_choice",
      "question": "אדם ששמע תשע תקיעות מתשעה בני אדם שונים, האם יצא ידי חובה?"
    },
    {
      "content": [
        "הלכה י @@@ הַמִּנְהָג הַפָּשׁוּט בְּסֵדֶר הַתְּקִיעוֹת שֶׁל רֹאשׁ הַשָּׁנָה בְּצִבּוּר כָּךְ הוּא. אַחַר שֶׁקּוֹרְאִין בַּתּוֹרָה וּמַחְזִירִין הַסֵּפֶר לִמְקוֹמוֹ יוֹשְׁבִין כָּל הָעָם וְאֶחָד עוֹמֵד וּמְבָרֵךְ בָּרוּךְ אַתָּה ה' אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם אֲשֶׁר קִדְּשָׁנוּ בְּמִצְוֹתָיו וְצִוָּנוּ לִשְׁמֹעַ קוֹל שׁוֹפָר וְכָל הָעָם עוֹנִין אָמֵן. וְחוֹזֵר וּמְבָרֵךְ שֶׁהֶחֱיָנוּ וְכָל הָעָם עוֹנִין אַחֲרָיו אָמֵן. וְתוֹקֵעַ שְׁלֹשִׁים תְּקִיעוֹת שֶׁאָמַרְנוּ מִפְּנֵי הַסָּפֵק עַל הַסֵּדֶר. וְאוֹמְרִים קַדִּישׁ וְעוֹמְדִין וּמִתְפַּלְּלִין תְּפִלַּת מוּסָף."
      ],
      "type": "materials",
      "title": "הלכות שופר סוכה ולולב פרק ג"
    },
    {
      "content": [
        "קריאה בתורה",
        "החזרת ספר התורה למקומו",
        "כל הקהל מתיישב",
        "התוקע עומד ומברך \"לשמוע קול שופר\"",
        "התוקע מברך \"שהחיינו\"",
        "תקיעת שלושים תקיעות",
        "אמירת קדיש",
        "תחילת תפילת מוסף"
      ],
      "type": "sort",
      "question": "יש לסדר את המאורעות הבאים, החל מסיום הקריאה בתורה עד לתחילת תפילת מוסף."
    },
    {
      "content": [
        "הלכה ז @@@ הַצִּבּוּר חַיָּבִין לִשְׁמֹעַ הַתְּקִיעוֹת עַל סֵדֶר הַבְּרָכוֹת. כֵּיצַד. אוֹמֵר שְׁלִיחַ צִבּוּר אָבוֹת וּגְבוּרוֹת וּקְדֻשַּׁת הַשֵּׁם וּמַלְכֻיּוֹת וְתוֹקֵעַ שָׁלֹשׁ. וְאוֹמֵר זִכְרוֹנוֹת וְתוֹקֵעַ שָׁלֹשׁ. וְאוֹמֵר שׁוֹפָרוֹת וְתוֹקֵעַ שָׁלֹשׁ. וְאוֹמֵר עֲבוֹדָה וְהוֹדָיָה וּבִרְכַּת כֹּהֲנִים:",
        "הלכה י @@@ וְאַחַר שֶׁגּוֹמֵר שְׁלִיחַ צִבּוּר בְּרָכָה רְבִיעִית שֶׁהִיא מַלְכֻיּוֹת תּוֹקֵעַ תְּקִיעָה שְׁלֹשָׁה שְׁבָרִים תְּרוּעָה תְּקִיעָה פַּעַם אַחַת. וּמְבָרֵךְ בְּרָכָה חֲמִישִׁית שֶׁהִיא זִכְרוֹנוֹת. וְאַחַר שֶׁגּוֹמְרָהּ תּוֹקֵעַ תְּקִיעָה שְׁלֹשָׁה שְׁבָרִים וּתְקִיעָה. וּמְבָרֵךְ בְּרָכָה שִׁשִּׁית שֶׁהִיא שׁוֹפָרוֹת. וְאַחַר שֶׁגּוֹמְרָהּ תּוֹקֵעַ תְּקִיעָה תְּרוּעָה וּתְקִיעָה פַּעַם אַחַת וְגוֹמֵר הַתְּפִלָּה:"
      ],
      "type": "materials",
      "title": "הלכות שופר סוכה ולולב פרק ג"
    },
    {
      "content": [
        "שש תקיעות, שני שברים, שתי תרועות",
        "שש תקיעות, שלושה שברים, שלוש תרועות",
        "שלוש תקיעות, שלושה שברים, שתי תרועות",
        "שלוש תקיעות, שלושה שברים, שלוש תרועות"
      ],
      "type": "single_choice",
      "question": "כמה תקיעות ומאיזה סוג תוקעים במהלך תפילת מוסף?"
    },
    {
      "content": [
        "הלכה ח @@@ שָׁלֹשׁ בְּרָכוֹת אֶמְצָעִיּוֹת אֵלּוּ שֶׁל רֹאשׁ הַשָּׁנָה וְיוֹם הַכִּפּוּרִים שֶׁל יוֹבֵל שֶׁהֵן מַלְכֻיּוֹת וְזִכְרוֹנוֹת וְשׁוֹפָרוֹת מְעַכְּבוֹת זוֹ אֶת זוֹ. וְצָרִיךְ לוֹמַר בְּכָל בְּרָכָה מֵהֶן עֲשָׂרָה פְּסוּקִים מֵעֵין הַבְּרָכָה. שְׁלֹשָׁה פְּסוּקִים מִן הַתּוֹרָה. וּשְׁלֹשָׁה מִסֵּפֶר תְּהִלִּים. וּשְׁלֹשָׁה מִן הַנְּבִיאִים. וְאֶחָד מִן הַתּוֹרָה מַשְׁלִים בּוֹ.",
        "הלכה ט @@@ אֵין מַזְכִּירִין זִכְרוֹנוֹת מַלְכֻיּוֹת וְשׁוֹפָרוֹת שֶׁל פֻּרְעָנוּת. זִכְרוֹנוֹת כְּגוֹן (תהילים עח-לט) 'וַיִּזְכֹּר כִּי בָשָׂר הֵמָּה' וְכוּ'. מַלְכֻיּוֹת כְּגוֹן (יחזקאל כ-לג) 'בְּחֵמָה שְׁפוּכָה אֶמְלוֹךְ עֲלֵיכֶם'. שׁוֹפָרוֹת כְּגוֹן (הושע ה-ח) 'תִּקְעוּ שׁוֹפָר בַּגִּבְעָה' וְכוּ'. וְלֹא זִכְרוֹן יָחִיד אֲפִלּוּ לְטוֹבָה כְּגוֹן (תהילים קו-ד) 'זָכְרֵנִי ה' בִּרְצוֹן עַמֶּךָ'. (נחמיה ה-יט) (נחמיה יג-לא) 'זָכְרָה לִּי אֱלֹהַי לְטוֹבָה'..."
      ],
      "type": "materials",
      "title": "הלכות שופר סוכה ולולב פרק ג"
    },
    {
      "content": [
        "עשרה פסוקים בכל ברכה, ארבעה מהתורה, שלושה מתהילים, שלושה מהנביאים",
        "עשרה פסוקים בכל ברכה, ארבעה מתהילים, שלושה מהתורה, שלושה מהנביאים",
        "עשרה פסוקים בכל ברכה, ארבעה מהנביאים, שלושה מהתורה, שלושה מתהילים"
      ],
      "type": "single_choice",
      "question": "כמה ואיזה סוג פסוקים יש לומר בברכות האמצעיות של מוסף - מלכויות זכרונות ושופרות?"
    },
    {
      "content": [
        "פסוקים של פורענות",
        "זכרונות של יחיד אפילו לטובה",
        "פסוקים של נחמה",
        "זכרונות של יחיד לרעה"
      ],
      "type": "multiple_choice",
      "num_of_correct": "2",
      "question": "אלו פסוקים אין להזכיר בברכות האמצעיות של תפילת מוסף?"
    },
    {
      "content": [
        "הלכה יב @@@ בְּדִין הָיָה שֶׁיִּתְקְעוּ עַל כָּל בְּרָכָה כָּל בָּבָא מֵהֶן שָׁלֹשׁ פְּעָמִים כְּדֶרֶךְ שֶׁתָּקְעוּ כְּשֶׁהֵן יוֹשְׁבִין אֶלָּא כֵּיוָן שֶׁיָּצְאוּ מִידֵי סָפֵק בַּתְּקִיעוֹת שֶׁמְּיֻשָּׁב אֵין מַטְרִיחִין עַל הַצִּבּוּר לַחֲזֹר בָּהֶן כֻּלָּן עַל סֵדֶר בְּרָכוֹת. אֶלָּא דַּי לָהֶן בָּבָא אַחַת עַל כָּל בְּרָכָה כְּדֵי שֶׁיִּשְׁמְעוּ תְּקִיעוֹת עַל סֵדֶר בְּרָכוֹת. וְכָל הַדְּבָרִים הָאֵלּוּ בְּצִבּוּר אֲבָל הַיָּחִיד בֵּין שֶׁשָּׁמַע עַל סֵדֶר בְּרָכוֹת בֵּין שֶׁלֹּא שָׁמַע עַל הַסֵּדֶר בֵּין מְעֻמָּד בֵּין מְיֻשָּׁב יָצָא וְאֵין בָּזֶה מִנְהָג:"
      ],
      "type": "materials",
      "title": "הלכות שופר סוכה ולולב פרק ג"
    },
    {
      "content": [
        "מפני שהספק הותר ולא רוצים להטריח את הציבור",
        "מפני שהדין הוא לתקוע שלושים רק בתקיעות דמיושב",
        "מפני שהספק הותר ולא רוצים לפגוע במהלך התפילה",
        "מפני שתוקעים שלושים רק בציבור ולא בתפילת היחיד"
      ],
      "type": "single_choice",
      "question": "מדוע אין תוקעים בתפילת מוסף שלושים תקיעות כפי שתקעו בתקיעות דמיושב?"
    }
  ]
}