package text2json;

import org.junit.BeforeClass;
import org.junit.Test;
import text2json.parsers.LikuteyMoharanParser;
import static text2json.JbsOntology.*;
import static text2json.TestUtils.*;
import static org.junit.Assert.*;

import java.io.BufferedReader;
import java.util.Map;

/**
 * Created by USER on 17-Mar-17.
 */
public class LikuteyMoharanParserTest {
    static SubjectsJson json;
    static SubjectsJson packageJson;

    @BeforeClass
    public static void setup() throws Exception {
        System.out.println("Creating json for likutey moharan");
        LikuteyMoharanParser parser = new LikuteyMoharanParser();
        BufferedReader reader = getText("/likuteymoharan/likuteymoharan.txt");
        parser.parse(reader, "../../jbs-text/likuteymoharan/likuteymoharan.json");
        json = getJson("../../jbs-text/likuteymoharan/likuteymoharan.json");
        packageJson = getJson("../../jbs-text/likuteymoharan/likuteymoharan-packages.json");
        System.out.println("");
    }

    @Test
    public void testNumOfSaifim(){
        System.out.println("testNumOfSaifim:");
        assertNotNull(json);
        int numOfSaifim= (286 - 3) + (125-1);
        assertEquals(numOfSaifim, json.subjects.size());
        System.out.println("Success! :)");
    }

    @Test
    public void testNumOfObjectsInPackage(){
        System.out.println("testNumOfObjectsInPackage:");
        assertNotNull(packageJson);
        //int numOfSaifim= (286 - 3) + (125-1);
        assertEquals(3, packageJson.subjects.size());
        System.out.println("Success! :)");
    }

    @Test
    public void testSpecificObjects(){
        System.out.print("testSpecificObjects: ");
        Map<String, String> object;
        String text;

        //chelek 1 saif 1
        object = json.getObject(0);
        assertEquals("jbr:likuteymoharan-1-1", object.get(URI));
        //assertEquals("jbr:likuteymoharan", object.get(JBO_SEFER));
        //assertEquals("jbr:likuteymoharan-1", object.get(JBO_CHELEK));
        assertEquals("1", object.get(JBO_POSITION));
        assertEquals("ליקוטי מוהר''ן א א", object.get(RDFS_LABEL));
        assertEquals("אשרי תמימי דרך", object.get(JBO_NAME));
        text = "אשרי תמימי דרך ההולכים בתורת ה' (תהלים קי\"ט):\n" +
                "דע, כי על ידי התורה נתקבלים כל התפלות וכל הבקשות, שאנו מבקשים ומתפללים. והחן והחשיבות של ישראל נתעלה ונתרומם בפני כל מי שצריכין, הן ברוחני הן בגשמי. כי עכשו בעוונותינו הרבים חן וחשיבות האמיתי של ישראל נפל, כי עכשו עקר החשיבות והחן הוא אצלם. אבל על ידי התורה נתעלה החן והחשיבות של ישראל, כי התורה נקראת (משלי ה): \"אילת אהבים ויעלת חן\"; שמעלה חן על לומדיה (ערובין נ\"ד: ). ועל ידי זה נתקבלין כל התפלות והבקשות:\n" +
                "כי איש הישראלי צריך תמיד להסתכל בהשכל, של כל דבר, ולקשר עצמו אל החכמה והשכל שיש בכל דבר, כדי שיאיר לו השכל, שיש בכל דבר, להתקרב להשם יתברך על ידי אותו הדבר. כי השכל הוא אור גדול ומאיר לו בכל דרכיו, כמו שכתוב (קהלת ח): \"חכמת אדם תאיר פניו\": וזה בחינת יעקב. כי יעקב זכה לבכורה שהוא ראשית, שהוא בחינת חכמה. (תקונים תקון י\"ד, זהר משפטים קכ\"א: ), כמו שכתוב (תהלים קי\"א): \"ראשית חכמה\". וזה בחינת (בראשית כ\"ז): \"ויעקבני זה פעמים\". ותרגום אונקלוס: וחכמני, וזה בחינת שמש. כי השכל הוא מאיר לו בכל דרכיו כמו השמש. וזה בחינת (משלי ד): \"וארח צדיקים כאור נגה הולך ואור עד נכון היום\": וזה בחינת חית - לשון חיות (עיין זוהר פנחס רמ\"ה: ובתיקונים תיקון ס\"ה). כי החכמה והשכל הוא החיות של כל דבר, כמו שכתוב (קהלת ז): \"החכמה תחיה\" וכו'. אך מחמת שאור השכל גדול מאד, אי אפשר לזכות אליו כי אם על ידי בחינת נון שהוא בחינת מלכות, כמו שכתוב (תהלים ע\"ב): \"לפני שמש ינון שמו\", ופרש רש\"י: 'לשון מלכות'. וזה בחינת לבנה, כי הלבנה אין לה אור מעצמה כי אם מה שמקבלת מהשמש (זהר ויחי רל\"ח. ורמ\"ט: ). וזהו בחינת מלכות, דלית לה מגרמה כלום, אלא מה שמקבלת מן החית, שהיא בחינת חכמה, בחינת שמש כנ\"ל, ונעשה (ישעיהו ל): \"אור הלבנה כאור החמה\": אבל מי שאינו מקשר עצמו אל השכל והחכמה והחיות, שיש בכל דבר, זה בחינת עשו שבזה את הבכורה, כמו שכתוב (בראשית כ\"ה): \"ויבז עשו את הבכורה\"; דהינו השכל כנ\"ל, בחינת (משלי י\"ח): \"לא יחפץ כסיל בתבונה כי אם בהתגלות לבו\". וזה בחינת מלכות הרשעה, בחינת לבנה דסטרא אחרא, שעליה נאמר (ישעיהו כ\"ד): \"וחפרה הלבנה\" וכו' (עין תיקון ח). וזה בחינת יצר טוב ויצר הרע. כי היצר טוב נקרא \"מסכן וחכם\" (קהלת ד), (עיין רש\"י ועיין זוהר וישב קע\"ט ובמ\"ר קהלת ובנדרים ל\"ב: ), בחינת מלכות, שהיא בחינת עניה ודלה דלית לה מגרמה כלום כי אם מה שמקבלת מחכמה. ויצר הרע נקרא \"מלך זקן וכסיל\" (שם), בחינת מלכות דסטרא אחרא, שאינה חפצה בחכמה ושכל, בחינת \"לא יחפץ כסיל בתבונה\" וכו', כנ\"ל. וצריך כל אחד לתן כח לבחינת מלכות דקדשה להתגבר על מלכות דסטרא אחרא. וכמו שאמרו רבותינו, זכרונם לברכה (ברכות ה.): 'לעולם ירגיז אדם יצר טוב על יצר הרע'. ועל ידי מה נותן כח למלכות דקדשה? על ידי התורה, שהוא עוסק בכח (כמו שאמרו רבותינו, זכרונם לברכה, שם: 'לעולם ירגיז וכו' - אי אזיל מוטב, ואם לאו - יעסק בתורה'). וכמו שאמרו רבותינו, זכרונם לברכה (קדושין ל: ): 'אם פגע בך מנול זה, משכהו לבית המדרש'. כי על ידי התורה נותן כח למלכות דקדשה. ואזי מקבלת המלכות, שהיא בחינת נ, חיות מן החכמה, שהיא בחינת ח, ונתחבר ונתקשר הח' והנ', ונעשה אור הלבנה כאור החמה: וכשזה קם, זה נופל (רש\"י בראשית כ\"ה פסוק כ\"ג), ואזי נופל ונתבטל מלכות הרשעה, כמו שכתוב (הושע י\"ד): \"כי ישרים דרכי ה', צדיקים ילכו בם, ופשעים יכשלו בם\". הינו על ידי דרכי ה', הינו התורה, על ידי זה הצדיקים, שדבקים במלכות דקדשה, הם נתחזקים ומקבלים כח על ידי זה. \"ופשעים יכשלו בם\" בחינת מלכות הרשעה, בחינת היצר הרע, שנופל ונכנע על ידי התורה, כנ\"ל.\n" +
                "ועל ידי זה נתקבלים כל התפלות והבקשות, כי עקר מה שאין נתקבלין הבקשות הוא מחמת שאין להדברים חן, ואין נכנסין בלב של זה שמבקשין ממנו, כאלו אין בלבו מקום שיכנסו הדברים בלבו, מחמת שאין להמבקש חן, שיכנסו הדברים בלבו של זה, שמבקשין ממנו. אבל על ידי התורה, שעל ידי זה נתחברין ונתקשרין הנ' והח כנ\"ל, ונעשה חן, ועל כן נקראת התורה (משלי ה): \"יעלת חן\", ואזי זוכה שדבריו הם דברי חן, ואזי נתקבלין דבריו ובקשותיו, כמו מי שמדבר דברי חן, שנכנסין הדברים בלב המתבקש, דהינו זה שמבקשין ממנו. וזה בחינת ת. הינו על ידי שנתחברו ונתקשרו החי\"ת והנו\"ן ונעשה בחינת ח\"ן - על ידי זה נעשה בחינת ת\"ו, שהוא לשון חקיקה ורשימה, כמו שכתוב (יחזקאל \"ט): \"והתוית ת\"ו\", כי על ידי החן נחקק ונרשם מקום בלב המתבקש לקבל הבקשה, כי על ידי החן נתקבלו דבריו. נמצא, שבחינת הח\"ן חקק מקום בלב זה שמבקשין ממנו, כדי שיכנסו דבריו בלבו, ויקבל בקשתו. והחקיקה ורשימה זה בחינת ת\"ו כנ\"ל וזהו (קהלת ט): \"דברי חכמים בנחת נשמעים\". נחת דיקא, הינו בחינת חן הנ\"ל והת' הנ\"ל, ועל ידי זה נעשה אותיות נחת, ואז נשמעים דבריו, ונתקבל בקשתו כנ\"ל:\n" +
                "ועל כן יעקב שהוא בחינת השכל כנ\"ל, על כן זכה לחן, כמו שכתוב (בראשית ל\"ג): \"כי חנני אלקים\" וכו'; ועל כן ברך את השבטים בחן, כמו שכתוב (שם): \"הילדים אשר חנן\" וכו'; ובנימין לא היה אז. ועל כן ברכו יוסף בחן, כמו שכתוב (שם .מ\"ג): \"אלקים יחנך בני\" (עיין ב\"ר וישלח פ' ע\"ח מקץ פ' צ\"ב): ודוקא יוסף היה יכול לברכו בחן, כי יוסף היה כלול ביותר מבחינת יעקב, כמו שכתוב (שם ל\"ז): \"אלה תלדות יעקב יוסף\"; כי הוא היה עקר תולדותיו. כי יעקב ויוסף כחדא חשיבי, (עין זוהר וישלח קע\"ו: וישב קפ\"ב). ועל כן נאמר ביוסף (דברים ל\"ג): \"בכור שורו הדר לו\". 'בכור' הוא בחינת השכל כנ\"ל. וזהו 'שורו' - לשון הסתכלות, כי צריכין להסתכל בהשכל שיש בכל דבר כנ\"ל. וזהו הדר לו - תרגם אונקלוס: זיו ליה - לשון אור. כי השכל מאיר לו בכל דבר; אפלו במקום שהיה אפל וחשך, מאיר לו השכל, כשזוכה להסתכל על השכל שיש שם בכל דבר ומקרב אותו להשם יתברך.\n" +
                "וזה פרוש מה שאמר רבה בר בר חנה (בבא בתרא עג.): האי גלא דמטבע לספינתא מתחזי כי צוציתא דנורא חורתא ברישא: פרש רשב\"ם: אש לבנה ומלאך מזיק הוא. ומחינן ליה באלותא דחקיק עליה \"אהיה אשר אהיה\":\n" +
                "גלא - הוא היצר הרע: דמטבע לספינתא - הוא החן והחשיבות, לשון ספון וחשוב, כי היצר הרע רוצה להטביע ולהשפיל, חס ושלום, בחינת החן והחשיבות של ישראל, בחינת מלכות דקדשה: ומתחזי כי צוציתא דנורא חורתא ברישא - כי מתחלה היצר הרע מתלבש עצמו במצוות ומטעה את האדם כאלו מסיתו לעשות מצוה. וזהו בחינת צוציתא דנורא חורתא - אש לבנה, אף על פי כן מלאך מזיק הוא. ומחינן ליה באלותא דחקיק עלה אהיה וכו', הינו שעקר הכנעתו של היצר הרע הוא על ידי התורה, שהיא כלה שמותיו של הקדוש ברוך הוא. והתורה היא בחינת ואו (עיין זוהר פקודי דרכ\"ו). כי הלוחות, ארכן וי\"ו ורחבן וי\"ו (בבא בתרא יד.). וזהו בחינת אלותא, דהינו מקלות דחקיק עלה אהיה וכו', הינו שמות, בחינת התורה, שהיא בחינת וי\"ו, והוי\"ו הוא צורת מקל, והיא כלה שמותיו של השם יתברך, הינו שהתורה הקדושה היא מכניע את היצר הרע שרוצה לעשות את האדם משגע ממש, חס ושלום. כי בעל עברה הוא משגע, כמו שאמרו רבותינו, זכרונם לברכה (סוטה ג.): 'אין אדם עובר עברה אלא אם כן נכנס בו רוח שטות'. וכמו שהמשגעים צריכים להכותם ולשום עליהם שמות, כמו כן ממש התורה שעוסקין הוא בחינת מקלות ושמות, שבזה מכין ומכניעין את היצר הרע ומגרשין מן האדם את השגעון והרוח שטות שנכנס בו, בחינת 'ומחינן ליה באלותא, דחקיק עליה שמות' וכו', כנ\"ל (עיין מ\"ר קדושים תחלת פ' כ\"ה: ):\n" +
                "וזהו: \"אשרי תמימי דרך\". אשרי - לשון הסתכלות. תמימי דרך - בחינת (בראשית כ\"ה): \"יעקב איש תם\"; שהוא בחינת השכל כנ\"ל. הינו לזכות להסתכל על השכל שיש בכל דבר, שהוא בחינת \"יעקב איש תם\" - זה זוכין על ידי התורה: וזהו: ההולכים בתורת ה'. כי על ידי שלומד תורה בכח, על ידי זה נותן כח למלכות דקדשה בחינת נו\"ן, לקבל מן השכל, שהוא בחינת חי\"ת, ואזי נעשה חן ונתקבלים דבריו כנ\"ל, ואזי נתעלה החן והחשיבות של ישראל, וכל התפלות והבקשות נתקבלים:";
        assertEquals(text, object.get(JBO_TEXT));

        //chelek 1 saif 284
        object = json.getObject(283-3);
        assertEquals("jbr:likuteymoharan-1-284", object.get(URI));
        //assertEquals("jbr:likuteymoharan", object.get(JBO_SEFER));
        //assertEquals("jbr:likuteymoharan-1", object.get(JBO_CHELEK));
        assertEquals("281", object.get(JBO_POSITION));
        assertEquals("ליקוטי מוהר''ן א רפד", object.get(RDFS_LABEL));
        assertEquals("הוכיח את אחד שאמר לו, שאין לו פנאי ללמד", object.get(JBO_NAME));
        text = "שמעתי בשמו, שהוכיח את אחד שאמר לו, שאין לו פנאי ללמד מחמת שעוסק במשא ומתן, אמר: שאף על פי כן ראוי לו לחטף איזה זמן לעסק בתורה בכל יום. ואמר, שזהו מה שאמרו רבותינו, זכרונם לברכה, (שבת לא), ששואלין את האדם: קבעת עתים לתורה? קבע הוא לשון גזלה, כמו שכתוב (משלי כ\"ב): \"וקבע את קבעיהם נפש\"; הינו ששואלין את האדם, אם גזל מן הזמן שהוא טרוד בעסקיו, אם גזלת מהן עתים לתורה, כי צריך האדם לחטף ולגזל עתים לתורה מתוך הטרדא והעסק:";
        assertEquals(text, object.get(JBO_TEXT));

        //chelek 2 saif 6
        object = json.getObject(283+5);
        assertEquals("jbr:likuteymoharan-2-6", object.get(URI));
        //assertEquals("jbr:likuteymoharan", object.get(JBO_SEFER));
        //assertEquals("jbr:likuteymoharan-2", object.get(JBO_CHELEK));
        assertEquals("289", object.get(JBO_POSITION));
        assertEquals("ליקוטי מוהר''ן ב ו", object.get(RDFS_LABEL));
        assertEquals("על ידי זעה טובה, על ידי זה נעשה שמחה", object.get(JBO_NAME));
        text = "על ידי זעה טובה (כגון כשמזיעין על ידי דבר שבקדשה), על ידי זה נעשה שמחה, בחינת (דברים ט\"ז): \"ושמחת בחגך\", בחינת שמחה של יום טוב. (ולאו דוקא יום טוב ממש, אלא כל יום שהוא בחינת טוב, נקרא יום טוב). כי השמחה - על ידי הדמים, כי העצבות - מן הטחול, וטחול היא עכירות הדמים. וכשמתגבר, חס ושלום, עכירת הדמים של הטחול, על ידי זה באין חלשות, חס ושלום, כי כשהעכירת הדמים הוא במדה בטחול, אזי אדרבא, הוא טובה מה שהטחול מקבל העכירת הדמים, כי נשארין הדמים זכים אבל כשעכירת הדמים של הטחול מתגבר, חס ושלום, נעשין חלשות, חס ושלום. והרפואה היא זעה, כי על ידי הזעה יוצא הארס, שיש בהדמים העכורים, שהם הפילו אותו למשכב, חס ושלום, ואזי נשארין הדמים זכים. ואזי זוכה לשמחה, כי עקר העצבות - על ידי הטחול, שהוא עכירת הדמים כנ\"ל, ועכשו שיוצאין עכירת הדמים על ידי זעה, נעשה שמחה וכו'. וזה אותיות זיעה - ראשי תבות: \"זה היום עשה י'י\" (תהלים קי\"ח) הינו בחינת שמחה של יום טוב, שנעשה על ידי זעה טובה כנ\"ל:\n" +
                "וזה שאנו רואין, שהחולה תכף כשמזיע, נמשך עליו שמחה, כי על ידי הזעה נעשה שמחה כנ\"ל:";
        assertEquals(text, object.get(JBO_TEXT));

        //chelek 2 saif 125
        object = json.getObject(json.subjects.size()-1);
        assertEquals("jbr:likuteymoharan-2-125", object.get(URI));
        //assertEquals("jbr:likuteymoharan", object.get(JBO_SEFER));
        //assertEquals("jbr:likuteymoharan-2", object.get(JBO_CHELEK));
        assertEquals("407", object.get(JBO_POSITION));
        assertEquals("ליקוטי מוהר''ן ב קכה", object.get(RDFS_LABEL));
        assertEquals("מענין אמירת תהלים", object.get(JBO_NAME));
        text = "מענין אמירת תהלים דבר עם אחד ואמר לו, שעקר אמירת תהלים לומר כל מזמורי תהלים על עצמו, למצא את עצמו בתוך כל מזמור ומזמור. ושאל אותו זכרונו לברכה: איך, ופרש לו רבנו, זכרונו לברכה, קצת, כי כל המלחמות שבקש דוד המלך, עליו השלום, שיצילהו השם יתברך מהם - הכל צריכין לפרש לעצמו על מלחמת היצר הרע וחילותיו, וכיוצא בזה בשאר המזמורים (וכמבאר מזה לעיל בסימן קא). ושאל אותו: איך יפרש לעצמו מהפסוקים, שדוד המלך, עליו השלום, משבח את עצמו, כגון: \"שמרה נפשי כי חסיד אני\" (תהלים פ\"ו), וכיוצא בזה. השיב לו: גם זה צריכין לפרש על עצמו, כי צריכין לדון את עצמו לכף זכות, ולמצא בעצמו איזה זכות ונקדה טובה, אשר בבחינת הנקדה טובה הזאת הוא בחינת חסיד, וכיוצא. ואמר לו רבנו, זכרונו לברכה: הלא אצל יהושפט כתיב (דברי הימים ב יז): \"ויגבה לבו בדרכי ה'\", שבדרכי ה' ועבודתו יתברך הגביה לבו קצת. עוד אמר לו רבנו, זכרונו לברכה: הלא בבקר אנו אומרים בתחלה: 'מה אנו מה חיינו' וכו', ואנו מקטינים עצמנו מאד, ואחר כך אנו אומרים: 'אבל אנחנו עמך בני בריתך' וכו', שאחר כך אנו מחזקים עצמנו ומרימים את עצמנו, ואנו מספרים את גדלתנו ומתפארים, שאנחנו עמו בני בריתו זרע אברהם יצחק ויעקב וכו', כי כך צריכין להתנהג בעבודת השם כנ\"ל. ועין מזה ספר הראשון בסימן רפ\"ב, על פסוק: \"אזמרה לאלקי בעודי\":";
        assertEquals(text, object.get(JBO_TEXT));

        System.out.println("Success! :)");
    }

    @Test
    public void testSpecificPackageObjects() {
        System.out.print("testSpecificPackageObjects: ");
        Map<String, String> object;

        //sefer
        object = packageJson.getObject(0);
        assertEquals("jbr:likuteymoharan",object.get(URI));
        assertEquals("ליקוטי מוהר''ן",object.get(RDFS_LABEL));

        //chelek 1
        object = packageJson.getObject(1);
        assertEquals("jbr:likuteymoharan-1",object.get(URI));
        assertEquals("ליקוטי מוהר''ן - חלק א",object.get(RDFS_LABEL));
        assertEquals("1", object.get(JBO_POSITION));

        //chelek 2
        object = packageJson.getObject(2);
        assertEquals("jbr:likuteymoharan-2",object.get(URI));
        assertEquals("ליקוטי מוהר''ן - חלק ב",object.get(RDFS_LABEL));
        assertEquals("2", object.get(JBO_POSITION));

        /* saifim packages removed
        //chelek 1 saif 2
        object = packageJson.getObject(2);
        assertEquals("jbr:likuteymoharan-1-2",object.get(URI));
        assertEquals("אמר אל הכהנים",object.get(RDFS_LABEL));
        assertEquals("2", object.get(JBO_POSITION));

        //chelek 1 saif 281
        object = packageJson.getObject(278);
        assertEquals("jbr:likuteymoharan-1-281",object.get(URI));
        assertEquals("אם ישב עצמו על הספר יכול לראות חדשות ונפלאות",object.get(RDFS_LABEL));
        assertEquals("278", object.get(JBO_POSITION));

        //chelek 2 saif 1
        object = packageJson.getObject(285);
        assertEquals("jbr:likuteymoharan-2-1",object.get(URI));
        assertEquals("תקעו בחדש שופר בכסא ליום חגנו",object.get(RDFS_LABEL));
        assertEquals("284", object.get(JBO_POSITION));

        //chelek 2 saif 124
        object = packageJson.getObject(packageJson.subjects.size()-2);
        assertEquals("jbr:likuteymoharan-2-124",object.get(URI));
        assertEquals("לפעמים מגיע לאדם הרהור תשובה",object.get(RDFS_LABEL));
        assertEquals("406", object.get(JBO_POSITION));
        */

        System.out.println("Success! :)");
    }

}
