package text2json;

import com.google.gson.stream.JsonReader;
import org.junit.BeforeClass;
import org.junit.Test;
//import text2json.TestUtils;
import text2json.parsers.SeferHakuzariParser;
import java.io.BufferedReader;
import java.io.File;
import java.io.IOException;

import static org.junit.Assert.assertNotNull;
import static org.junit.Assert.*;

/**
 * Created by shilonoa on 4/24/2017.
 */
public class SeferHakuzariParserTest {
    int uriMaamarNum = 0;
    int uriSeifNum = 0;

    @BeforeClass
    public static void setUp() throws Exception {
        SeferHakuzariParser parser = new SeferHakuzariParser();
        BufferedReader reader = TestUtils.getText("/seferhakuzari/seferhakuzari.txt");
        parser.parse(reader, "json/seferhakuzari.json");
        return;
    }

    @Test
    public void test() throws IOException {
        final File folder = new File("./json");
        System.out.println(folder.getAbsoluteFile() + "*******");
        for (final File fileEntry : folder.listFiles()) {
            System.out.println(fileEntry.getAbsoluteFile() + "&&&&&&");
            String fileName = fileEntry.getName();
            if (fileName.contains("packages")){
                continue;
            }
            System.out.println("Testing:" + fileName);
            testSeferHakuzari();
            System.out.println("SUCCESS");
        }
    }

    private void testSeferHakuzari() throws IOException {
        JsonReader jsonReader = new JsonReader(TestUtils.getJsonFileReader("SeferHakuzari.json"));
        jsonReader.beginObject();

        assertEquals(jsonReader.nextName(), "subjects");
        jsonReader.beginArray();
        int maamarNum = 1;
        int seifNum = 1;
        while (jsonReader.hasNext()) {
            jsonReader.beginObject();
            //======== URI ==============
            assertEquals(jsonReader.nextName(), "uri");
            testUri(jsonReader);
            //======== JBO_TEXT ==============
            assertEquals(jsonReader.nextName(), "jbo:text");
            assertNotNull(jsonReader.nextString());
            //testText(jsonReader, uriMaamarNum,uriSeifNum);
            //======== JBO_TEXT_NIKUD ==============
            assertEquals(jsonReader.nextName(), "jbo:textNikud");
            assertNotNull(jsonReader.nextString());
            //======== SEFER ==============
            assertEquals(jsonReader.nextName(), "jbo:sefer");
            assertEquals(jsonReader.nextString(),"jbr:seferhakuzari");
            //======== POSITION ==============
            assertEquals(jsonReader.nextName(), "jbo:position");
            assertNotNull(jsonReader.nextString());
            //======== LABLE ==============
            assertEquals(jsonReader.nextName(), "rdfs:label");
            assertNotNull(jsonReader.nextString());
            //======== CHELEK ==============
            assertEquals(jsonReader.nextName(), "jbo:chelek");
            testChelek(jsonReader);
            jsonReader.endObject();
        }
    }

    private void testUri(JsonReader jsonReader) throws IOException {
        boolean retval = false;
        Line uriLine = new Line(jsonReader.nextString());
        //System.out.println(uriLine.getLine());
        String uriMaamar = uriLine.extract("seferhakuzari-", "-");
        String uriSeif = uriLine.extract("seferhakuzari-" + uriMaamar + "-", " ");
        assertNotNull(Integer.valueOf(uriMaamar));
        assertNotNull(Integer.valueOf(uriSeif));

        uriMaamarNum = Integer.valueOf(uriMaamar);
        uriSeifNum = Integer.valueOf(uriSeif);
        return;
    }

    private void testText(JsonReader jsonReader, int MaamarNum, int SeifNum) throws IOException {
        String text = jsonReader.nextString();
        switch (MaamarNum) {
            case 2:
                switch (SeifNum){
                    case 5:
                        assertEquals(text,stripVowels("אָמַר הַכּוּזָרִי: אֱמֹר, שֶׁתִּהְיֶה נִצּוֹל מִכָּל הַמִּדּוֹת עַד שֶׁלֹּא נִתְחַיֵּב רִבּוּי, מַה יַצִּילְךָ מִמִּדַּת הַחֵפֶץ שֶׁאַתָּה מְיַחֵס אוֹתָה אֶל הַבּוֹרֵא וְהַפִּילוֹסוֹף מַרְחִיק אוֹתָה מִמֶּנּוּ?"));
                        break;
                    case 14:
                        assertEquals(text,stripVowels("אָמַר הֶחָבֵר: כָּל מִי שֶׁנִּתְנַבֵּא לֹא נִתְנַבֵּא כִּי אִם בָּהּ אוֹ בַעֲבוּרָהּ. הִנֵּה נִתְנַבֵּא אַבְרָהָם כְּדֵי שֶׁיַעֲבֹר בָּהּ, וִיחֶזְקֵאל וְדָנִיֵּאל בַּעֲבוּרָה, וּכְבָר הָיוּ נִמְצָאִים בְּבַיִת רִאשׁוֹן וְרָאוּ בוֹ הַשְּׁכִינָה אֲשֶׁר בְּהִמָּצְאָהּ הָיָה מַגִּיעַ לִנְבוּאָה כָּל הַמּוּכָן לָהּ מֵהַסְּגֻלָּה. אֲבָל אָדָם הָרִאשׁוֹן – הִיא הָיְתָה אַדְמָתוֹ וּבָה מֵת כַּאֲשֶׁר קִבַּלְנוּ, כִּי בַמְּעָרָה אַרְבָּעָה זוּגוֹת: אָדָם וְחַוָּה אַבְרָהָם וְשָׂרָה יִצְחָק וְרִבְקָה יַעֲקֹב וְלֵאָה, וְהִיא הָאָרֶץ הַנִּקְרֵאת: לִפְנֵי ה', הַנֶּאֱמַר עָלֶיהָ: תָּמִיד עֵינֵי ה' אֱלֹהֶיךָ בָּהּ, וְעָלֶיהָ נָפְלָה הַקִּנְאָה וְהַחֶמְדָּה בֵּין הֶבֶל וְקַיִן בַּתְּחִלָּה כְּשֶׁרָצוּ לָדַעַת, אֵיזֶה מֵהֶם הָרָצוּי לִהְיוֹת בִּמְקוֹם אָדָם וּסְגֻלָּתוֹ וְלִבּוֹ, לִנְחֹל אֶת הָאָרֶץ וּלְהִדָּבֵק בָּעִנְיָן הָאֱלֹהִי, וְיִהְיֶה זוּלָתוֹ כַקְּלִפָּה, וְאֵרַע מַה שֶּׁאֵרַע מֵהֲרִיגַת הֶבֶל וְנִשְׁאַר הַמַּלְכוּת עֲרִירִי וְנֶאֱמַר: וַיֵּצֵא קַיִן מִלִּפְנֵי ה', רְצוֹנוֹ לוֹמַר: מֵהָאָרֶץ הַזֹּאת שֶׁבָּהּ הָיוּ. וְכֵן נֶאֱמַר בְּיוֹנָה: וַיָּקָם יוֹנָה לִבְרֹחַ תַּרְשִׁישָׁה מִלִּפְנֵי ה', לֹא בָרַח כִּי אִם מִמְּקוֹם הַנְּבוּאָה, וְהֵשִׁיב אוֹתוֹ הָאֱלֹהִים אֵלֶיהָ מִמְּעֵי הַדָּגָה וְנִבָּא בָהּ. וְכַאֲשֶׁר נוֹלַד שֵׁת בִּדְמוּת אָדָם כְּמוֹ שֶׁאָמַר: וַיּוֹלֶד בִּדְמוּתוֹ כְּצַלְמוֹ, הָיָה בִמְקוֹם הֶבֶל, כְּמוֹׁ שֶׁאָמַר: כִּי שָׁת לִי אֱלֹהִים זֶרַע אַחֵר תַּחַת הֶבֶל, וְהָיָה רָאוּי שֶׁיִּקָּרֵא בֶּן אֱלֹהִים כְּאָדָם, וְזָכָה לָאָרֶץ הַהִיא שֶׁהִיא מַדְרֵגָה לְמַטָּה מִגַּן עֵדֶן, וְעָלֶיהָ נִתְקַנְּאוּ יִצְחָק וְיִשְׁמָעֵאל וְנִדְחָה יִשְׁמָעֵאל כִּקְלִפָּה, אַף עַל פִּי שֶׁנֶּאֱמַר בּוֹ: הִנֵּה בֵּרַכְתִּי אוֹתוֹ וְהִפְרֵיתִי אוֹתוֹ וגו' בַּטּוֹבָה הָעוֹלָמִית, וְנֶאֱמַר אַחַר כֵּן: וְאֶת בְּרִיתִי אָקִים אֶת יִצְחָק, רְצוֹנוֹ לוֹמַר: הִדָּבְקוֹ בָּעִנְיָן הָאֱלֹהִי וְהַטּוֹבָה בָּעוֹלָם הַבָּא, וְאֵין לְיִשְׁמָעֵאל בְּרִית וְלֹא לְעֵשָׂו וְאִם הִצְלִיחוּ. וְעַל הָאָרֶץ הַזֹּאת נָפְלָה הַקִּנְאָה בֵין יַעֲקֹב וְעֵשָׂו בַּבְּכוֹרָה וּבַבְּרָכָה, עַד שֶׁנִּדְחָה עֵשָׂו עִם חֶזְקָתוּ מִפְּנֵי יַעֲקֹב עִם חֻלְשָׁתוֹ. וּנְבוּאַת יִרְמְיָה בְמִצְרַיִם,בָּהּ וּבַעֲבוּרָהּ, וְכֵן נְבוּאַת מֹשֶׁה וְאַהֲרֹן וּמִרְיָם; וְאָמְנָם סִינַי וָּפאָרן כֻּלָּם מִגְּבוּל אֶרֶץ כְּנַעַן מִפְּנֵי שֶׁהֵם מִן יַם-סוּף, כְּמוֹ שֶׁאָמַר יִתְבָּרָךְ: וְשַׁתִּי אֶת גְּבֻלְךָ מִיַּם-סוּף וְעַד-יָם פְּלִשְׁתִּים וּמִמִּדְבָּר עַד-הַנָּהָר, וּמִדְבָּר הוּא מִדְבָּר פָּארָן, וְהוּא הַנֶּאֱמַר בּוֹ: הַמִּדְבָּר הַגָּדוֹל וְהַנּוֹרָא, זֶה הוּא גְבוּלָה הַדְּרוֹמִי. וְהַנָּהָר הוּא נְהַר פְּרָת גְּבוּלָהּ הַצְּפוֹנִי. וּבָהֶם הַמִּזְבְּחוֹת שֶׁהָיוּ לָאָבוֹת אֲשֶׁר נַעֲנוּ בָהֶם בָּאֵשׁ הָעֶלְיוֹנָה וְהָאוֹר הָאֱלֹהִי.וּכְבָר הָיְתָה עֲקֵדַת יִצְחָק אָבִינוּ בְהֵר שֶׁלֹא הָיָה בוֹ יִשּׁוּב הוּא הַר הַמּוֹרִיָּה,וְנִתְגַּלָּה הַדָּבָר בִּימֵי דַוִד כְּשֶׁהָיָה מְיֻשָּׁב, כִּי הוּא הַמָּקוֹם הַמְיֻחָד הַמּוּכָן לַשְּׁכִינָה, וַאֲרַוְנָה הַיְבוּסִי עוֹבֵד וְחוֹרֵשׁ בּוֹ, כְּמוֹ שֶׁנֶּאֱמַר:וַיִקְרָא אַבְרָהָם שֵׁם הַמָּקוֹם הַהוּא ה' יִרְאֶה.וּבֵאֵר בְּדִבְרֵי הַיָּמִים כִּי בֵית הַמִּקְדָשׁ בָּנוּי בְּהַר הַמּוֹרִיָּה,וְשָׁם מִבְּלִי סָפֵק הַמְּקוֹמוֹת שֶׁרְאוּיִים לְהִקָּרֵא שַׁעֲרֵי הַשָּׁמַיִם. הֲלֹא תִרְאֶה יַעֲקֹב אָבִינוּ, שֶׁלֹא תָלָה הַמַּרְאוֹת אֲשֶׁר רָאָה לֹא בִזְכוּת נַפְשׁוֹ וְלֹא בֶאֱמוּנָתוֹ וּבֹר לְבָבוֹ, אֲבָל תָּלָה אוֹתָם בַּמָּקוֹם, כְּמוֹ שֶׁאָמַר:וַיִּירָא וַיֹּאמַר מַה-נּוֹרָא הַמָּקוֹם הַזֶּה, וְעָלָיו אָמַר קֹדֶם לָזֶה: וַיִּפְגַּע בַּמָּקוֹם, רְצוֹנוֹ לוֹמַר:הַמָּקוֹם הַמְיֻחָד.וַהֲלֹא תִרְאֶה כִּי הָעְתַּק אַבְרָהָם מִאַרְצוֹ כַּאֲשֶׁר הִצְלִיחַ וְהָיָה רָאוּי לְהִדָּבֵק בָּעִנְיָן הָאֱלֹהִי, וְהָיָה לֵב הַסְּגֻלָּה הַהִיא, אֶל הַמָּקוֹם אֲשֶׁר בּוֹ תִגָּמֵר הַשְׁלָמָתוֹ, כַּאֲשֶׁר יִמְצָא עוֹבֵד הָאֲדָמָה אִילָן \"שֶׁפִּרְיוֹ טוֹב\" בַּמִּדְבָּר וּמַעְתִּיקוֹ אֶל אֲדָמָה נֶעֱבֶדֶת, מִטִּבְעָהּ שֶׁיַצְלִיחַ בָּהּ הַשֹּׁרֶש הַהוּא, וּמְגַדְלוֹ שָׁם, וְיָשׁוּב פַּרְדֵּסִי אַחֵר שֶׁהָיָה מִדְבָּרִי וְיִרְבֶּה אַחֵר שֶׁלֹא הָיָה נִמְצָא אֶלָּא בְעֵת שֶׁיִזְדַּמֵּן וּבַמָּקוֹם שֶׁיִּזְדַּמֵּן. וְכֵן שָׁבָה הַנְּבוּאָה בְזַרְעוֹ בְאֶרֶץ כְּנַעַן, רַבּוּ אֲנָשֶׁיהָ כָּל יְמֵי עָמְדָם בְּאֶרֶץ כְּנַעַן, עִם הָעִנְיָנִים הָעוֹזְרִים מֵהַטְּהָרוֹת וְהָעֲבוֹדוֹת והַקָּרְבָּנוֹת, כָּל שֶׁכֵּן בְּהִמָּצֵא הַשְּׁכִינָה.וְהָעִנְיָן הָאֱלֹהִי כְּמוֹ צוֹפֶה לְמִי שֶׁרָאוּי לְהִדָּבֵק בּוֹ שֶׁיִּהְיֶה לוֹ לֵאלֹהִים – כְּמוֹ הַנְּבִיאִים וְהַחֲסִידִים, כַּאֲשֶׁר הַשֵּׂכֶל צוֹפֶה לְמִי שֶׁנִּשְׁלְמוּ טְבָעָיו וְנִשְׁתַּוּוּ נַפְשׁוֹ וּמִדּוֹתָיו שֶׁיָחוּל בּוֹ עַל הַשְּׁלֵמוּת – כַּפִּילוֹסוֹפִים, וּכְמוֹ שֶׁהַנֶּפֶשׁ צוֹפָה לְמִי שֶׁנִּשְׁלְמוּ כֹּחוֹתָיו הַטִּבְעִיִּים הַשְׁלָמָה מְזֻמֶּנֶת לְמַעֲלָה יְתֵרָה, וְתָחוּל בּוֹ – כְּבַעֲלֵי חַיִּים, וּכְמוֹ שֶׁהַטֶּבַע צוֹפֶה לַמֶּזֶג הַשָּׁוֶה בְאֵיכֻיּוֹתָיו, שֶׁיָּחוּל בּוֹ וְיִּהְיֶה צֶמַח"));
                    default:
                        break;
                }
                break;
            case 4:
                switch (SeifNum){
                    case 5:
                        assertEquals(text, stripVowels("אָמַר הֶחָבֵר: זֹאת טַעֲנַת הַפִּילוֹסוֹפִים, וַאֲשֶׁר נִרְאֶה מִנֶּפֶשׁ הָאָדָם כִּי הִיא יְרֵאָה בְהִמָּצֵא הַמַּפְחִידוֹת מֻרְגָּשׁוֹת, מַה שֶּׁאֵינָהּ יְרֵאָה כַּאֲשֶׁר יְסֻפַּר לָהּ עֲלֵיהֶם, כַּאֲשֶׁר הִיא אוֹהֶבֶת הַצּוּרָה הַיָּפָה הַנִּמְצֵאת, מַה שֶּׁאֵינָהּ אוֹהֶבֶת כְּשֶׁיְּסֻפַּר עָלֶיהָ. וְאַל תַּאֲמִין לַמִּתְחַכֵּם, שֶּׁיֹּאמַר כִּי מַחֲשַׁבְתּוֹ מִתְחַבֶּרֶת עַל סֵדֶר עַד שֶׁיַּגִּיעַ אֶל כָּל הָעִנְיָנִים הַצְּרִיכִים בָּאֱלֹהוּת בְּשִׂכְלוֹ בִּלְבַד מִבִּלְתִּי שֶׁיִּסְמֹךְ אֶל מֻרְגָּשׁ, בִּרְאוֹת דִּמְיוֹן מִמִּלּוֹת אוֹ מִכְּתָב אוֹ מִצּוּרוֹת נִרְאוֹת אוֹ מִתְדַּמּוֹת. הֲלֹא תִרְאֶה שֶׁאֵינְךָ יָכוֹל לִכְלֹל כָּל עִנְיָנֵי תְפִלָּתְךָ בַּמַּחֲשָׁבָה לְבַדָּהּ בִּלְתִּי קְרִיאָה, וְלֹא תוּכַל לִסְפֹּר עַד מֵאָה, דֶּרֶךְ מָשָׁל, בַּמַּחֲשָׁבָה לְבַדָּהּ בְּלֹא דִּבּוּר, כָּל שֶׁכֵּן אִם תִּהְיֶה הַמֵּאָה מִמִּנְיָנִים מִתְחַלְּפִים, וְלוּלֵא הַהֶרְגֵּשׁ שֶׁהוּא כוֹלֵל הַסֵּדֶר הַהוּא הַשִּׂכְלִי בְּדִמְיוֹנוֹת וּתְנוּעוֹת, לֹא הָיָה נִכְלָל. וְכֵן מִסְתַּדֶּרֶת לַנָּבִיא גְּדֻלַּת הָאֱלֹהִים וִיכָלְתּוֹ וְרַחֲמָנוּתוֹ וְחָכְמָתוֹ וְחַיּוּתוֹ וּתְמִידוּתוֹ וּמַלְכוּתוֹ, וְשֶׁאֵינֶנּוּ צָרִיךְ לַכֹּל וְשֶׁהַכֹּל צְרִיכִים לוֹ, וּמַעֲלָתוֹ הַמְיֻחֶדֶת וּקְדֻשָּׁתוֹ, בְּמַה שֶּׁהוּא רוֹאֶה פִתְאוֹם בְּרֶגַע אֶחָד מִגְּדֻלַּת הַצּוּרָה הַהִיא הַנִּבְרֵאת לוֹ וְהוֹדָהּ וַהֲדָרָהּ, וְהַתְּכוּנוֹת וְהַכֵּלִים הַמּוֹרִים עַל הַיְכֹלֶת, כַּיָּד הַנְּטוּיָה וְהַחֶרֶב הַשְּׁלוּפָה וְהָאֵשׁ וְהָרוּחַ וְהַבְּרָקִים וְהָרְעָמִים הַמְשַׁמְּשִׁים בְּמַאֲמָרוֹ, וְהַדִּבּוּר הַיּוֹצֵא מִבֵּינֵיהֶם בְּאַזְהָרוֹת וּבְהוֹדָעַת מַה שֶּׁהָיָה וְיִהְיֶה, וּמַעֲמַד בְּנֵי אָדָם, וְהַמַּלְאָכִים לְפָנָיו נִכְנָעִים, וִיצִיאַת כָּל צָרְכֵיהֶם מֵאִתּוֹ, יַסְפִּיק לָהֶם וְלֹא יֶחְסַר מְאוּמָה, יַגְבִּיהַּ הַשָּׁפָל וְיַשְׁפִּיל הַגָּבֹהַּ, וְיִפְשֹׁט יְמִינוֹ לַשָּׁבִים וְיִקְרָא אֲלֵיהֶם: מִי-יוֹדֵעַ יָשׁוּב וְנִחַם הָאֱלֹהִים, וְיֶאֱנַף וְיִכְעַס עַל הָרְשָׁעִים, מְהַעְדֵּה מַלְכִין וּמְהָקִים מַלְכִין, וּלְפָנָיו אֶלֶף אַלְפִין יְשַׁמְּשׁוּנֵהּ וְגוֹ', כָּל זֶה וְהַדּוֹמֶה לָזֶה יִרְאֶה הַנָּבִיא בְּרֶגַע אֶחָד, וְיִכָּנֵס הַמּוֹרָא וְהָאַהֲבָה תְּקוּעִים בְּנַפְשׁוֹ כָּל יְמֵי חַיָּיו, וְהוֹלֵךְ כָּל יְמֵי חַיָּיו חוֹשֵׁק, הוֹמֶה וּמְבַקֵּשׁ שֶׁיִּתְרָאֶה אֵלָיו פַּעַם שְׁנִיָּה אוֹ שְׁלִישִׁית. וּכְבָר נֶחְשַׁב לִשְׁלֹמֹה לְדָבָר גָּדוֹל הַשְׁתֵּי פְעָמִים, בְּאָמְרוֹ: 'הַנִּרְאֶה אֵלָיו פַּעֲמָיִם'. מָתַי הִגִּיעַ הַפִּילוֹסוֹף עַל כָּזֶה בִּתְבוּנָתוֹ?"));
                        break;
                    case 22:
                        assertEquals(text, stripVowels("אָמַר הַכּוּזָרִי: לֹא הֵבֵאתִי מִזֶּה רְאָיָה, מִפְּנֵי שֶׁאֲנִי רוֹאֶה שְׁתֵּי הָאֻמּוֹת הַחוֹלְקוֹת זוֹ עַל זוֹ, יֵשׁ לְכָל אַחַת מֵהֶם גְּדֻלָּה וּמֶמְשָׁלָה וְלֹא יִתָּכֵן שֶׁיִּהְיֶה הָאֱמֶת בִּשְׁתֵּי קַצְווֹת הַסּוֹתֵר, אֶלָּא אוֹ בְאַחַת מֵהֶן אוֹ אֵינוֹ בְאַחַת מֵהֶן. וּכְבָר פֵּרַשְׁתָּ לִי בְּ,הִנֵּה יַשְׂכִּיל עַבְדִּי' מַה שֶּׁהוֹרָה שֶׁהַדַּלּוּת וְהַשִּׁפְלוּת יוֹתֵר רָאוּי בָּעִנְיָן הָאֳלֹהִי מֵהַגְּדֻלָּה וְהַגַּאֲוָה, וְהוּא גַם כֵּן גָּלוּי בִּשְׁתֵּי הָאֻמּוֹת, כִּי הַנּוֹצְרִים אֵינָם מִתְפָּאֲרִים בִּמְלָכִים וְלֹא בְגִבּוֹרִים וְלֹא בַעֲשִׁירִים, אֲבָל בָּאֲנָשִׁים הָהֵם שֶׁהָלְכוּ אַחֲרֵי יֵשׁוּ כָּל הַיָּמִים הָאֲרֻכִּים אֲשֶׁר לֹא נִקְבְּעָה בָהֶם דָּתוֹ, וְהָיוּ הָאֲנָשִׁים הָהֵם גּוֹלִים וְנֶחְבָּאִים וְנֶהֱרָגִים בְּכָל מָקוֹם שֶׁנִּמְצְאוּ, וְסָבְלוּ עַל חִזּוּק אֱמוּנָתָם עִנְיָנִים מֻפְלָאִים מִן הַבּוּז וְהַהֶרֶג, וְהֵם אֲשֶׁר בָּהֶם מִתְבָּרְכִים וּמְכַבְּדִים מְקוֹמוֹתָם וּמְקוֹמוֹת הֲרִיגָתָם וּבוֹנִים בָּמוֹת עַל שְׁמוֹתָם. וְכֵן עוֹזְרֵי בַעֲלֵי דָת יִשְׁמָעֵאל סָבְלוּ מִן הַבּוּז הַרְבֵּה עַד שֶׁנֶּעֱזְרוּ, וּבָהֶם הֵם מִתְפָּאֲרִים, וּבְשִׁפְלוּתָם וּבמֹוָתם עַל עֵזֶר דָּתָם מִשְׁתַּבְּחִים, לֹא בַמְּלָכִים הַמִּתְגַּדְּלִים בְּמָמוֹנָם וּגְדֻלַּת עִנְיָנָם, אַךְ בַֹאֲשֶׁר הָיוּ לוֹבְשִׁים הַבְּלָאִים וְאוֹכְלִים הַשְּׂעוֹרִים מִבְּלִי שָׂבְעָם, אֲבָל הָיוּ עוֹשִׂין כָּל זֶה עִם תַּכְלִית הִבָּדְלָם אֶל הָאֱלֹהִים. וְאִלּוּ הָיִיתִי רוֹאֶה הַיְּהוּדִים עוּשִׂים זֶה לְשֶׁם הָאֱלֹהִים, הָיִיתִי אוֹמֵר כִּי יֵשׁ לָהֶם מַעֲלָה עַל מַלְכֵי בֵית דָּוִד, מִפְּנֵי שֶׁאֲנִי זוֹכֵר מַה שֶּׁלִּמַּדְתַּנִי בַמַּאֲמָר,אֶת-דַּכָּא וּשְׁפַל רוּחַ', כִּי אוֹר הָאֱלֹהִים אֵינֶנּוּ חָל כִּי אִם בְּנַפְשׁוֹת הַנִּכְנָעִים."));
                }
                break;
            default:
                break;
        }
    }

    protected void testChelek(JsonReader jsonReader) throws IOException{
        String text = jsonReader.nextString();
        assertEquals(text, "jbr:seferhakuzari-" + uriMaamarNum);
        return;
    }

    public String stripVowels(String rawString){
        String newString = "";
        for(int j=0; j<rawString.length(); j++) {
            if(rawString.codePointAt(j)<1425
                    || rawString.codePointAt(j)>1479)
            { newString = newString + rawString.charAt(j); }
        }
        return(newString);
    }
}