package text2json;

import org.junit.BeforeClass;
import org.junit.Test;
import text2json.parsers.TalmudBavliParser;
import static text2json.JbsOntology.*;
import static text2json.TestUtils.*;
import static org.junit.Assert.*;
import java.io.BufferedReader;
import java.util.Map;

/**
 * Created by USER on 25-Jan-17.
 */
public class TalmudBavliParserTest {
    private static final int NUM_OF_FIRST_MASECHET = 1;
    private static final int NUM_OF_LAST_MASECHET = 37;
    static SubjectsJson json[] = new SubjectsJson[NUM_OF_LAST_MASECHET + 1];
    static SubjectsJson packageJson[] = new SubjectsJson[NUM_OF_LAST_MASECHET + 1];


    @BeforeClass
    public static void setup() throws Exception {
        for (int masechetNum = NUM_OF_FIRST_MASECHET; masechetNum <= NUM_OF_LAST_MASECHET; masechetNum++) {
            System.out.println("Creating json for masechet number " + masechetNum);
            TalmudBavliParser parser = new TalmudBavliParser();
            BufferedReader reader = getText("talmudbavli/talmudbavli-" + masechetNum + ".txt");
            parser.parse(reader, "../../jbs-text/talmudbavli/talmudbavli-" + masechetNum + ".json");
            json[masechetNum] = getJson("../../jbs-text/talmudbavli/talmudbavli-" + masechetNum + ".json");
            packageJson[masechetNum] = getJson("../../jbs-text/talmudbavli/talmudbavli-" + masechetNum + "-packages.json");
        }
        System.out.println("");
    }

    @Test
    public void testNumOfAmudimPerMasechet() {
        System.out.print("testNumOfAmudimPerMasechet: ");
        for (int masechetNum = NUM_OF_FIRST_MASECHET; masechetNum <= NUM_OF_LAST_MASECHET; masechetNum++) {
            assertNotNull(json[masechetNum]);
            assertEquals(numOfObjectsForMasechet(masechetNum),json[masechetNum].subjects.size());
        }
        System.out.print("Success! :)\n");
    }

    @Test
    public void testNumOfObjectsPerMasechetPackage() {
        System.out.print("testNumOfObjectsPerMasechetPackage: ");
        for (int masechetNum = NUM_OF_FIRST_MASECHET; masechetNum <= NUM_OF_LAST_MASECHET; masechetNum++) {
            assertNotNull(packageJson[masechetNum]);
            assertEquals(numOfObjectsForMasechetPackage(masechetNum),packageJson[masechetNum].subjects.size());
        }
        System.out.print("Success! :)\n");
    }


    @Test
    public void testSpecificObjects() {
        System.out.print("testSpecificObjects: ");
        Map<String, String> object;
        String text;
        //masechet 1 daf 2 amud 1
        object = json[1].getObject(0);
        assertEquals("jbr:bavli-1-2-1", object.get(URI));
        assertEquals("bavli-1", object.get(JBO_MASECHET));
        assertEquals("jbr:bavli-perek-1-1", object.get(JBO_PEREK));
        assertEquals("מסכת ברכות ב א", object.get(RDFS_LABEL));
        assertEquals("1", object.get(JBO_POSITION));
        text = "מתני' מאימתי קורין את שמע בערבין. משעה שהכהנים נכנסים לאכול בתרומתן עד סוף האשמורה הראשונה דברי ר' אליעזר. וחכמים אומרים עד חצות. רבן גמליאל אומר עד שיעלה עמוד השחר. מעשה ובאו בניו מבית המשתה אמרו לו לא קרינו את שמע אמר להם אם לא עלה עמוד השחר חייבין אתם לקרות ולא זו בלבד אמרו אלא כל מה שאמרו חכמים עד חצות מצותן עד שיעלה עמוד השחר הקטר חלבים ואברים מצותן עד שיעלה עמוד השחר וכל הנאכלים ליום אחד מצותן עד שיעלה עמוד השחר א''כ למה אמרו חכמים עד חצות כדי להרחיק אדם מן העבירה: גמ' תנא היכא קאי דקתני מאימתי ותו מאי שנא דתני בערבית ברישא לתני דשחרית ברישא תנא אקרא קאי דכתיב {דברים ו-ז} בשכבך ובקומך והכי קתני זמן קריאת שמע דשכיבה אימת משעה שהכהנים נכנסין לאכול בתרומתן ואי בעית אימא יליף מברייתו של עולם דכתיב {בראשית א-ה} ויהי ערב ויהי בקר יום אחד אי הכי סיפא דקתני בשחר מברך שתים לפניה ואחת לאחריה ובערב מברך שתים לפניה ושתים לאחריה לתני דערבית ברישא. תנא פתח בערבית והדר תני בשחרית עד דקאי בשחרית פריש מילי דשחרית והדר פריש מילי דערבית: אמר מר משעה שהכהנים נכנסים לאכול בתרומתן. מכדי כהנים אימת קא אכלי תרומה משעת צאת הכוכבים לתני משעת צאת הכוכבים. מלתא אגב אורחיה קמשמע לן כהנים אימת קא אכלי בתרומה משעת צאת הכוכבים והא קמשמע לן דכפרה לא מעכבא כדתניא {ויקרא כב-ז} ובא השמש וטהר ביאת שמשו מעכבתו מלאכול בתרומה ואין כפרתו מעכבתו מלאכול בתרומה. וממאי דהאי ובא השמש ביאת השמש והאי וטהר טהר יומא";
        assertEquals(text, object.get(JBO_TEXT));
        //masechet 1 daf 2 amud 1 - perush rashi
        object = json[1].getObject(1);
        assertEquals("jbr:bavli-rashi-1-2-1", object.get(URI));
        assertEquals("bavli-1", object.get(JBO_MASECHET));
        assertEquals("jbr:bavli-perek-1-1", object.get(JBO_PEREK));
        assertEquals("רש\"י ברכות ב א", object.get(RDFS_LABEL));
        assertEquals("1", object.get(JBO_POSITION));
        assertEquals("jbr:bavli-1-2-1", object.get(JBO_INTERPRETS));
        text = "רש\"י  מאימתי קורין את שמע בערבין. משעה שהכהנים נכנסים לאכול בתרומתן. כהנים שנטמאו וטבלו והעריב שמשן והגיע עתם לאכול בתרומה: עד סוף האשמורה הראשונה. שליש הלילה כדמפרש בגמ' (דף ג.) ומשם ואילך עבר זמן דלא מקרי תו זמן שכיבה ולא קרינן ביה בשכבך ומקמי הכי נמי לאו זמן שכיבה לפיכך הקורא קודם לכן לא יצא ידי חובתו. אם כן למה קורין אותה בבית הכנסת כדי לעמוד בתפלה מתוך דברי תורה והכי תניא בבריי' בברכות ירושלמי. ולפיכך חובה עלינו לקרותה משתחשך. ובקריאת פרשה ראשונה שאדם קורא על מטתו יצא: עד שיעלה עמוד השחר. שכל הלילה קרוי זמן שכיבה: הקטר חלבים ואברים. של קרבנות שנזרק דמן ביום: מצותן. להעלות כל הלילה ואינן נפסלים בלינה עד שיעלה עמוד השחר והן למטה מן המזבח דכתי' לא ילין לבקר (שמות לד): חלבים. של כל קרבנות: אברים. של עולה: וכל הנאכלים ליום אחד. כגון חטאת ואשם וכבשי עצרת ומנחות ותודה: מצותן. זמן אכילתן: עד שיעלה עמוד השחר. והוא מביאן להיות נותר דכתיב בתודה לא יניח ממנו עד בקר (ויקרא ז) וכלם מתודה ילמדו: אם כן למה אמרו חכמים עד חצות. בקריאת שמע ובאכילת קדשי': כדי להרחיק אדם מן העבירה. ואסרום באכילה קודם זמנן כדי שלא יבא לאכלן לאחר עמוד השחר ויתחייב כרת וכן בקריאת שמע לזרז את האדם שלא יאמר יש לי עוד שהות ובתוך כך יעלה עמוד השחר ועבר לו הזמן. והקטר חלבים דקתני הכא לא אמרו בו חכמים עד חצות כלל ולא נקט להו הכא אלא להודיע שכל דבר הנוהג בלילה כשר כל הלילה. והכי נמי תנן בפרק שני דמגילה (דף כ:) כל הלילה כשר לקצירת העומר ולהקטר חלבים ואברים: גמ' היכא קאי. מהיכא קא סליק דתנא ביה חובת קריאת שמע שהתחיל לשאול כאן זמן הקריאה: אקרא קאי. ושם למד חובת הקריאה: ואיבע''א. הא דתנא ערבין ברישא יליף מברייתו של עולם: והדר תנא בשחרית. מאימתי קורין את שמע בשחרית: משעת צאת הכוכבים. שהוא גמר ביאת השמש. כדיליף לקמן (עמוד ב): (רש\"י)";
        assertEquals(text, object.get(JBO_TEXT));
        //masechet 1 daf 2 amud 1 - perush tosafot
        object = json[1].getObject(2);
        assertEquals("jbr:bavli-tosafot-1-2-1", object.get(URI));
        assertEquals("bavli-1", object.get(JBO_MASECHET));
        assertEquals("jbr:bavli-perek-1-1", object.get(JBO_PEREK));
        assertEquals("תוספות ברכות ב א", object.get(RDFS_LABEL));
        assertEquals("1", object.get(JBO_POSITION));
        assertEquals("jbr:bavli-1-2-1", object.get(JBO_INTERPRETS));
        text = "תוספות  מאימתי קורין וכו'. פי' רש''י ואנן היכי קרינן מבעוד יום ואין אנו ממתינין לצאת הכוכבים כדמפרש בגמ' על כן פירש רש''י שקריאת שמע שעל המטה עיקר והוא לאחר צאת הכוכבים. והכי איתא בירושלמי אם קרא קודם לכן לא יצא ואם כן למה אנו מתפללין קריאת שמע בבית הכנסת כדי לעמוד בתפלה מתוך דברי תורה. תימא לפירושו והלא אין העולם רגילין לקרות סמוך לשכיבה אלא פרשה ראשונה (לקמן דף ס:) ואם כן שלש פרשיות היה לו לקרות. ועוד קשה דצריך לברך בקריאת שמע שתים לפניה ושתים לאחריה בערבית. ועוד דאותה קריאת שמע סמוך למטה אינה אלא בשביל המזיקין כדאמר בסמוך (דף ה.) ואם תלמיד חכם הוא אינו צריך. ועוד קשה דא''כ פסקינן כרבי יהושע בן לוי דאמר תפלות באמצע תקנום פי' באמצע בין שני קריאת שמע בין קריאת שמע של שחרית ובין ק''ש של ערבית. ואנן קיי''ל כר' יוחנן דאמר לקמן (דף ד) איזהו בן העולם הבא זה הסומך גאולה של ערבית לתפלה. לכן פי' ר''ת דאדרבה קריאת שמע של בית הכנסת עיקר. ואם תאמר היאך אנו קורין כל כך מבעוד יום. ויש לומר דקיימא לן כרבי יהודה דאמר בפרק תפלת השחר (דף כו.) דזמן תפלת מנחה עד פלג המנחה דהיינו אחד עשר שעות פחות רביע ומיד כשיכלה זמן המנחה מתחיל זמן ערבית. ואם תאמר היאך אנו מתפללין תפלת מנחה סמוך לחשכה ואפילו לאחר פלג המנחה. יש לומר דקיימא לן כרבנן דאמרי זמן תפלת המנחה עד הערב ואמרינן לקמן (דף כז.) השתא דלא אתמר הלכתא לא כמר ולא כמר דעבד כמר עבד ודעבד כמר עבד. מכל מקום קשיא דהוי כתרי קולי דסתרן אהדדי שהרי מאיזה טעם אנו מתפללין ערבית מיד לאחר פלג המנחה משום דקיימא לן דשעת המנחה כלה כדברי רבי יהודה ומיד הוי זמן ערבית ובזמן התפלה עצמה לא קיימא לן כרבי יהודה אלא כרבנן. על כן אומר ר''י דודאי קריאת שמע של בית הכנסת עיקר ואנו שמתפללין ערבית מבעוד יום סבירא לן כהני תנאי דגמרא דאמרי משעה שקדש היום וגם משעה שבני אדם נכנסים להסב דהיינו סעודת ע''ש והיא היתה מבעוד יום ומאותה שעה הוי זמן תפלה. וגם ראיה (לקמן כז) דרב הוי מצלי של שבת בערב שבת ומסתמא גם היה קורא קריאת שמע. מכל אותן הראיות משמע דקריאת שמע של בית הכנסת היא עיקר. והא דקאמר בירושלמי למה היו קורין בבהכ''נ וכו' אומר ר''ת שהיו רגילין לקרות ק''ש קודם תפלתם כמו שאנו רגילין לומר אשרי תחלה ואותה ק''ש אינה אלא לעמוד בתפלה מתוך דברי תורה. ומכאן נראה מי שקורא ק''ש על מטתו שאין לברך וגם אינו צריך לקרות אלא פרשה ראשונה: ליתני דשחרית ברישא. כדאשכחן בתמיד דכתיב של בקר תחלה: אי הכי סיפא דקתני שחרית ברישא. אי אמרת בשלמא דסמיך אקרא דבשכבך א''כ אינו מקפיד קרא אלא אק''ש. אלא א''א דסמיך אקרא דברייתו של עולם א''כ קפיד אכל מילי א''כ סיפא דקתני וכו': מברך שתים לפניה וכו'. (ירושלמי) ושבע ברכות הוי כנגד שבע ביום הללתיך (תהילים קיט) ולא קא חשיב יראו עינינו דההיא ברכה תקנו רבנן כדי להמתין לחבריהם בבית הכנסת. ודוקא בבית הכנסת שלהם שהיו עומדים בשדה והם מסוכנים מן המזיקים אבל בבתי כנסיות שלנו אין צריכין להמתין לחבריהם אלא בלילה: והא קמ''ל דכפרה לא מעכבא. וא''ת הא תנינא חדא זימנא במס' נגעים (פי''ד) ומייתי לה בהערל (דף עד:) העריב שמשו אוכל בתרומה וי''ל דרגילות של משניות לאשמועינן בקוצר אף למה שמפורש כבר: (תוספות)";
        assertEquals(text, object.get(JBO_TEXT));

        //masechet 1 daf 64 amud 1
        object = json[1].getObject(json[1].subjects.size()-3);
        assertEquals("jbr:bavli-1-64-1", object.get(URI));
        assertEquals("bavli-1", object.get(JBO_MASECHET));
        assertEquals("jbr:bavli-perek-1-9", object.get(JBO_PEREK));
        assertEquals("מסכת ברכות סד א", object.get(RDFS_LABEL));
        assertEquals("125", object.get(JBO_POSITION));
        text = "שנאמר {דברי הימים א כו-ה} פעלתי השמיני וכתיב {דברי הימים א כו-ה} כי ברכו אלהים {דברי הימים א כו-ח} כל אלה [מבני] (ל) עובד אדום המה ובניהם ואחיהם (אנשי) [איש] חיל בכח לעבודה ששים ושנים לעובד אדום אמר ר' אבין הלוי כל הדוחק את השעה שעה דוחקתו וכל הנדחה מפני השעה שעה נדחת מפניו מדרבה ורב יוסף. דרב יוסף סיני ורבה עוקר הרים אצטריכא להו שעתא שלחו להתם סיני ועוקר הרים איזה מהם קודם שלחו להו סיני קודם שהכל צריכין למרי חטיא אף על פי כן לא קבל עליו ר' יוסף דאמרי ליה כלדאי מלכת תרתין שנין מלך רבה עשרין ותרתין שנין מלך רב יוסף תרתין שנין ופלגא כל הנך שני דמלך רבה אפילו אומנא לביתיה לא קרא: ואמר רבי אבין הלוי מאי דכתיב {תהילים כ-ב} יענך ה' ביום צרה ישגבך שם אלהי יעקב אלהי יעקב ולא אלהי אברהם ויצחק מכאן לבעל הקורה שיכנס בעביה של קורה: ואמר רבי אבין הלוי כל הנהנה מסעודה שתלמיד חכם שרוי בתוכה כאילו נהנה מזיו שכינה שנאמר {שמות יח-יב} ויבא אהרן וכל זקני ישראל לאכל לחם עם חותן משה לפני האלהים וכי לפני אלהים אכלו והלא לפני משה אכלו אלא לומר לך כל הנהנה מסעודה שתלמיד חכם שרוי בתוכה כאילו נהנה מזיו שכינה: ואמר רבי אבין הלוי הנפטר מחברו אל יאמר לו לך בשלום אלא לך לשלום שהרי יתרו שאמר לו למשה {שמות ד-יח} לך לשלום עלה והצליח דוד שאמר לו לאבשלום {שמואל ב טו-ט} לך בשלום הלך ונתלה: ואמר רבי אבין הלוי הנפטר מן המת אל יאמר לו לך לשלום אלא לך בשלום שנאמר {בראשית טו-טו} ואתה תבא אל אבותיך בשלום: אמר רבי לוי בר חייא היוצא מבית הכנסת ונכנס לבית המדרש ועוסק בתורה זוכה ומקבל פני שכינה שנאמר {תהילים פד-ח} ילכו מחיל אל חיל יראה אל אלהים בציון. אמר רבי חייא בר אשי אמר רב תלמידי חכמים אין להם מנוחה לא בעולם הזה ולא בעולם הבא שנאמר ילכו מחיל אל חיל יראה אל אלהים בציון: אמר רבי אלעזר אמר רבי חנינא תלמידי חכמים מרבים שלום בעולם שנאמר {ישעיה נד-יג} וכל בניך למודי ה' ורב שלום בניך אל תקרי בניך אלא בוניך {תהילים קיט-קסה} שלום רב לאוהבי תורתך ואין למו מכשול {תהילים קכב-ז} יהי שלום בחילך שלוה בארמנותיך {תהילים קכב-ח} למען אחי ורעי אדברה נא שלום בך {תהילים קכב-ט} למען בית ה' אלהינו אבקשה טוב לך {תהילים כט-יא} ה' עוז לעמו יתן ה' יברך את עמו בשלום:";
        assertEquals(text, object.get(JBO_TEXT));
        //masechet 1 daf 64 amud 1 - perush rashi
        object = json[1].getObject(json[1].subjects.size()-2);
        assertEquals("jbr:bavli-rashi-1-64-1", object.get(URI));
        assertEquals("bavli-1", object.get(JBO_MASECHET));
        assertEquals("jbr:bavli-perek-1-9", object.get(JBO_PEREK));
        assertEquals("רש\"י ברכות סד א", object.get(RDFS_LABEL));
        assertEquals("125", object.get(JBO_POSITION));
        assertEquals("jbr:bavli-1-64-1", object.get(JBO_INTERPRETS));
        text = "רש\"י  שנאמר פעלתי השמיני. בני עובד אדום קא חשיב בדברי הימים וקא חשיב תמניא והיא תשיעית כל אחת ילדה ששה הם חמשים וארבע הוסיף עליהם שמונה בנים הראשונים הרי ששים ושנים לעובד אדום: הדוחק את השעה. כגון אבשלום שבקש למלוך בחזקה: אצטריכא להו שעתא. להיות אחד מהם ראש ישיבה. אצטריכא להו גרסי' הוצרכו להם חכמים: סיני. היו קורין לרב יוסף שהיה בקי בברייתות הרבה: עוקר הרים. לרבה בר נחמני שהיה מחודד יותר בפלפול: למרי חטיא. למי שקבץ תבואה למכור כלומר למי שקבץ שמועות: דאמרי ליה כלדאי. לרב יוסף: מלכת תרתין שנין. אמר אם אמלוך תחלה אמות לסוף שנתים ונדחה מפני השעה ולא אבה למלוך והשעה עמדה לו שלא הפסיד שנותיו בכך: אומנא לביתיה לא קרא. לא נהג כל אותן השנים שום צד שררה וכשהיה צריך להקיז דם היה הולך לבית הרופא ולא היה שולח לבא אליו: שיאחז בעובי הקורה. אם בא לטלטלה ממקום למקום לתתה בבנין כלומר יעקב שכל הבנים שלו וטרח בגידולם יבקש עליהם רחמים: הנפטר מן המת. כשהיו מוליכים ארונות ממקום למקום לקבורה היו מלוים אותו מעיר לעיר וחוזרים אלו ואחרים מלוים אותו משם והלאה והחוזרים קרי נפטרים נוטלין רשות להפטר ממנו: אין להם מנוחה. מישיבה לישיבה וממדרש למדרש: (רש\"י)";
        assertEquals(text, object.get(JBO_TEXT));
        //masechet 1 daf 64 amud 1 - perush tosafot
        object = json[1].getObject(json[1].subjects.size()-1);
        assertEquals("jbr:bavli-tosafot-1-64-1", object.get(URI));
        assertEquals("bavli-1", object.get(JBO_MASECHET));
        assertEquals("jbr:bavli-perek-1-9", object.get(JBO_PEREK));
        assertEquals("תוספות ברכות סד א", object.get(RDFS_LABEL));
        assertEquals("125", object.get(JBO_POSITION));
        assertEquals("jbr:bavli-1-64-1", object.get(JBO_INTERPRETS));
        text = "תוספות  אין פירוש לקטע זה (תוספות)";
        assertEquals(text, object.get(JBO_TEXT));

        //masechet 2 daf 157 amud 2
        object = json[2].getObject(json[2].subjects.size()-3);
        assertEquals("jbr:bavli-2-157-2", object.get(URI));
        assertEquals("bavli-2", object.get(JBO_MASECHET));
        assertEquals("jbr:bavli-perek-2-24", object.get(JBO_PEREK));
        assertEquals("מסכת שבת קנז ב", object.get(RDFS_LABEL));
        assertEquals("312", object.get(JBO_POSITION));
        text = "וגיגית סדוקה מונחת על גבן ופקקו את המאור בטפיח וקשרו את המקידה בגמי לידע אם יש שם בגיגית פותח טפח אם לאו: ומדבריהם למדנו שפוקקין ומודדין וקושרין בשבת: עולא איקלע לבי ריש גלותא חזייה לרבה בר רב הונא דיתיב באוונא דמיא וקא משח ליה אמר ליה אימר דאמרי רבנן מדידה דמצוה דלאו מצוה מי אמור אמר ליה מתעסק בעלמא אנא:";
        assertEquals(text, object.get(JBO_TEXT));
        //masechet 2 daf 157 amud 2 - perush rashi
        object = json[2].getObject(json[2].subjects.size()-2);
        assertEquals("jbr:bavli-rashi-2-157-2", object.get(URI));
        assertEquals("bavli-2", object.get(JBO_MASECHET));
        assertEquals("jbr:bavli-perek-2-24", object.get(JBO_PEREK));
        assertEquals("רש\"י שבת קנז ב", object.get(RDFS_LABEL));
        assertEquals("312", object.get(JBO_POSITION));
        assertEquals("jbr:bavli-2-157-2", object.get(JBO_INTERPRETS));
        text = "רש\"י  וגיגית סדוקה מונחת על גביו. והמת מוטל בהילקטי תחת הגיגית [כנגד] הסדק ולפני מות המת פקקו בשבת המאור בטפיח שמא אין בסדק הגיגית פותח טפח ונמצא המת מוטל באהל שאין לו מקום לצאת דרך מעלה וחור שבין שני בתים מכניס את הטומאה לצד שני במלא אגרוף לפיכך סתמוהו בכלי חרס וגבו כנגד ההילקט וכלי חרס אינו מטמא מגבו וחוצץ: וקשרו מקידה. שהיא רחבה טפח: בגמי לידע. אם תכנס בסדק הגיגית ובמסכת אהלות (פ''י) שנינו (דאין) חילוק בארובה שבתוך הבית וטומאה מקצתה כנגד ארובה ומקצתה בתוך הבית בין יש בארובה פותח טפח לאין בארובה פותח טפח ואני לא יכולתי להבין בו ולהכי נקט גמי שראוי למאכל בהמה ולא מיבטל ליה להיות קשר של קיימא דמנתק כשיבש: באוונא. בגיגית מלאה מים: מתעסק. שלא לצורך אלא לאיעסוקי בעלמא: (רש\"י)";
        assertEquals(text, object.get(JBO_TEXT));
        //masechet 2 daf 157 amud 2 - perush tosafot
        object = json[2].getObject(json[2].subjects.size()-1);
        assertEquals("jbr:bavli-tosafot-2-157-2", object.get(URI));
        assertEquals("bavli-2", object.get(JBO_MASECHET));
        assertEquals("jbr:bavli-perek-2-24", object.get(JBO_PEREK));
        assertEquals("תוספות שבת קנז ב", object.get(RDFS_LABEL));
        assertEquals("312", object.get(JBO_POSITION));
        assertEquals("jbr:bavli-2-157-2", object.get(JBO_INTERPRETS));
        text = "תוספות  באוונא דמיא. אמבטי של מים וכך פירש בערוך: מדידה דמצוה דלאו דמצוה מי אמור כו'. בפקיקה לא בעינן של מצוה כדפירש' לעיל בשילהי כל הכלים (דף קכו:) אלא דווקא במדידה בעינן של מצוה: (תוספות)";
        assertEquals(text, object.get(JBO_TEXT));

        //masechet 3 daf 2 amud 2
        object = json[3].getObject(3);
        assertEquals("jbr:bavli-3-2-2", object.get(URI));
        assertEquals("bavli-3", object.get(JBO_MASECHET));
        assertEquals("jbr:bavli-perek-3-1", object.get(JBO_PEREK));
        assertEquals("מסכת עירובין ב ב", object.get(RDFS_LABEL));
        assertEquals("2", object.get(JBO_POSITION));
        text = "ההוא בארון כתיב אלא מהכא {שמות כה-ח} ועשו לי מקדש ושכנתי בתוכם בין לרבנן ובין לרבי יהודה לילפו מפתח שער החצר דכתיב {שמות כז-יח} אורך החצר מאה באמה ורחב חמשים בחמשים וקומה חמש אמות וכתיב {שמות כז-יד} וחמש עשרה אמה קלעים לכתף וכתיב {שמות לח-טו} ולכתף השנית מזה ומזה לשער החצר קלעים חמש עשרה אמה מה להלן חמש ברוחב עשרים אף כאן חמש ברוחב עשרים פתח שער החצר איקרי פתח סתמא לא איקרי ואיבעית אימא כי כתיב קלעים חמש עשרה אמה לכתף בגובהה הוא דכתיב גובהה והא כתיב וקומה חמש אמות ההוא משפת מזבח ולמעלה ורבי יהודה מפתחו של אולם גמר והא תנן והרחב מעשר אמות ימעט ולא פליג ר' יהודה אמר אביי פליג בברייתא דתניא והרחב מי' אמות ימעט ר' יהודה אומר אינו צריך למעט וליפלוג במתני' פליג בגובהה וה''ה לרחבה ואכתי ר' יהודה מפתחו של אולם גמר והתניא מבוי שהוא גבוה מכ' אמה ימעט ורבי יהודה מכשיר עד מ' ונ' אמה ותני בר קפרא עד מאה בשלמא לבר קפרא גוזמא אלא לרב יהודה מאי גוזמא בשלמא לרבי יהודה ארבעים גמר מפתחו של אולם אלא נ' מנא ליה א''ר חסדא הא מתניתא אטעיתיה לרב דתניא מבוי שהוא גבוה מכ' אמה יותר מפתחו של היכל ימעט הוא סבר מדרבנן מפתחו של היכל גמרי רבי יהודה מפתחו של אולם גמר ולא היא ר' יהודה מפתחא דמלכין גמר ורבנן אי מפתחו של היכל גמירי ליבעו דלתות כהיכל אלמה תנן הכשר מבוי ב''ש אומרים לחי וקורה וב''ה אומרים לחי או קורה דלתות היכל לצניעות בעלמא הוא דעבידן אלא מעתה לא תיהני ליה צורת הפתח דהא היכל צורת הפתח הויא לו אפילו הכי עשר אמות הוא דרויח אלמה תנן אם יש לו צורת הפתח אע''פ שרחב מעשר אמות אינו צריך למעט מידי הוא טעמא אלא לרב הא מתני ליה רב יהודה לחייא בר רב קמיה דרב אינו צריך למעט וא''ל אתנייה צריך למעט אלא מעתה";
        assertEquals(text, object.get(JBO_TEXT));
        //masechet 3 daf 2 amud 2 - perush rashi
        object = json[3].getObject(4);
        assertEquals("jbr:bavli-rashi-3-2-2", object.get(URI));
        assertEquals("bavli-3", object.get(JBO_MASECHET));
        assertEquals("jbr:bavli-perek-3-1", object.get(JBO_PEREK));
        assertEquals("רש\"י עירובין ב ב", object.get(RDFS_LABEL));
        assertEquals("2", object.get(JBO_POSITION));
        assertEquals("jbr:bavli-3-2-2", object.get(JBO_INTERPRETS));
        text = "רש\"י  ההוא בארון כתיב. שהוא משא בני קהת ועל שם שהוא מקודש משאר המשאות קרוי מקדש: לילפו מפתח שער החצר. ארוחב פריך דתנן במתניתין והרחב מעשר אמות ימעט הא אשכחן פתח חצר דהוי עשרים רוחב ואיקרי פתח דכתיב ואת קלעי החצר ואת מסך פתח שער החצר בפרשת נשא כתיב אבל אגובה ולמיפסל בגובה יותר מה' אמות לא מצי פריך דהא אשכחן פתח ההיכל דגבוה כ' וקא קרי ליה פתח: רוחב חצר המשכן נ' אמה. והא דכתיב חמשים בחמשים בפרק שני (ד' כג:) מפרש לה ופתחה באמצע רחבה וסתמו בקלעים ט''ו אמה מצד זה של פתח וט''ו אמה מצד זה של פתח נשארו כ' אמה רוחב באמצע כדכתיב חמש עשרה אמה קלעים לכתף וכתף הוא צידו של פתח: מה להלן. גובה חמש שהרי כל קלעי החצר סביב לא היה גובהן אלא חמש כדכתיב (שמות כז) וקומה חמש אמות: בגובהה הוא דכתיב. שגבהו הקלעים המזרחיות מזה ומזה לפתח ט''ו אמה יותר משאר קלעי החצר דהוו להו גובה כ' ולרוחב לא ניתנה מדה: ההוא. חמש אמות: משפת קלעים ולמטה. למטה מאותן ט''ו שנעדפו מזה ומזה לפתח היו עוד חמש גובה שוה לשאר הקלעים ועליהן ניתוספו ט''ו בגובה מב' עברי הפתח דהוו להו כ' לישנא אחרינא בגובהה הוא דכתיב דגובה כל קלעי החצר סביב ט''ו אמה אבל לרוחב הפתח לא למדנו שיעור ולהך לישנא גרסינן במסקנא ההוא משפת מזבח ולמעלה שהמזבח גובהו עשר והקלעים גבוהות ממנו חמש דהוו להו ט''ו כדי שלא יהא כהן עומד עליו ועבודה בידו וכל העם רואין אותו מבחוץ ושתיהן שמעתי וזה עיקר וכן מפורש בזבחים בפרק קדשי קדשים (ד' נט:) והמפרש לשון ראשון טועה הוא שהיה סבור דמאן דפריך לילפו מפתח שער החצר אגובהה פריך למיפסל גובה יותר מה' אמות ומשום הכי אהדר לאוקומי פתח החצר בגובה כ': ולא פליג ר' יהודה. ואי מאולם גמר ליכשר ברוחב כ': ותני בר קפרא. במילתיה דר' יהודה עד מאה אמה: בשלמא לבר קפרא. איכא למימר דר' יהודה מאולם גמר ולא מכשר בגבוה מארבעים והא דתני בר קפרא מאה גוזמא נקט משום דאכשר ר' יהודה ביותר מכ' ומשלשים נראים לבר קפרא גוזמא ונקיט במילתיה טפי: אטעיתיה לרב. דאמר לעיל ר' יהודה לא למדה אלא מפתח אולם הא מתניתא דלקמיה אטעיתיה: פיתחא דמלכין. סתם פתחי מלכים גבוהין הרבה: לחי. קנה או לוח נעוץ אצל כותל האחד בראשו: לא תיהני ליה צורת הפתח. להכשיר רוחבו ביותר מעשרה: (רש\"י)";
        assertEquals(text, object.get(JBO_TEXT));
        //masechet 3 daf 2 amud 2 - perush tosafot
        object = json[3].getObject(5);
        assertEquals("jbr:bavli-tosafot-3-2-2", object.get(URI));
        assertEquals("bavli-3", object.get(JBO_MASECHET));
        assertEquals("jbr:bavli-perek-3-1", object.get(JBO_PEREK));
        assertEquals("תוספות עירובין ב ב", object.get(RDFS_LABEL));
        assertEquals("2", object.get(JBO_POSITION));
        assertEquals("jbr:bavli-3-2-2", object.get(JBO_INTERPRETS));
        text = "תוספות  בין לרבנן ובין לרבי יהודה לילפו מפתח שער החצר. ארוחבה פריך כדפי' בקונט' דאגובהה לא מצי פריך כיון דאשכחן דאיקרי פתח היכל ועזרה דהוו גביהי עשרים ועוד אי אגובהה פריך לא הוה משני מידי פתח שער החצר איקרי דכל שכן לא איקרי פתח יותר מחמש דשער גדול מפתח אלא ארוחבה פריך דלילפו משער החצר דהוה רוחב כ' כדמייתי מקראי אע''ג דג' עמודים היו עומדים ברוחב הפתח כדמוכחי קראי מ''מ אתי אויר' דהאי גיסא ודהאי גיסא ומבטל ליה כדאמר לקמן (ד' י:) ומשני דפתח שער איקרי פתח סתמא לא איקרי ואע''ג דבפרשת במדבר סיני מצינו דאיקרי נמי פתח סתמא אין לחוש הואיל ובשאר מקומות איקרי פתח שער וכענין זה מצינו בהקומץ רבה (מנחות ד' לז.) דקאמר מצינו ימין שנקראת יד דכתיב כי ישית אביו יד ימינו ואידך יד ימין איקרי יד סתמא לא איקרי ואע''ג דבתר הכי כתיב ויתמוך יד אביו: ואיבעית אימא כי כתיב. ט''ו אמות בגובה הוא דכתיב אבל ברוחב אין שיעור מפורש ואפשר שהיה הפתח רחב עשר או פחות וגרסי' בתר הכי משפת מזבח ולמעלה והיינו כר' יוסי דבפ' קדשי קדשים (זבחים דף נט:) דאמר מזבח גובהו י' אמות פי שנים כאורכו והקלעים סביב ט''ו שלא יהא כהן עומד ועבודה בידו וכל העם רואין אותו והא דכתיב בקלעים וקומה ה' אמות היינו משפת מזבח ולמעלה והא דכתיב במזבח (שמות כז) ושלש אמות קומתו היינו משפת סובב ולמעלה ור' יהודה פליג התם דהמזבח ג' אמות דברים ככתבן והקלעים גובהן ה' והאי שינויא בתרא דהכא לא משני לר' יהודה אלא לרבנן דלר' יהודה קלעים ט''ו אמות לאו בגובהן כתיב וא''ת מאי פריך. שאני פתח החצר דהוה ליה צורת הפתח שהכלונסות היו על גבי ווי עמודים שהקלעים תלויים בהן וי''ל דאמר לקמן (ד' יא.) דצורת הפתח שעשאה מן הצד לא עשה ולא כלום ועוד דלא קשה מידי דאליבא דרב קיימינן ורב תני צריך. למעט אע''ג דאית ליה צורת הפתח ולהכי נמי כי פריך בסמוך ור' יהודה מפתחו של אולם גמר והא תנן כו' ולא פליג ר' יהודה ולא משני שאני אולם דה''ל צורת הפתח משום דאליבא דרב קיימינן אך קשה דקראי מוכחי דברוחב כתיב ונראה לריצב''א דמשמע ליה והרחב מי' אמות ימעט אפילו אינו גבוה אלא חמש ולהכי פריך היכא דאינו גבוה אלא ה' לילפו מפתח החצר דאפילו רוחב כ' הוי פתח ואין נראה למקשה דפתח שער איקרי כיון דנמוך כ''כ ועוד דבפ' מדבר סיני איקרי פתח סתמא ואתי שפיר דגרס בכל הספרים מה להלן גבוה ה' ברוחב כ' ומשני דאפ''ה פתח שער איקרי הואיל ורחב כ''כ והא דאיקרי בפרשת במדבר סיני פתח סתמא אין לחוש כדפי' לעיל ואיבעית אימא קלעים ט''ו אמה בגובה הוא דכתיב כלומר קרא דויקהל דההוא ודאי ע''כ בגובה נמי כתיב דהא כתיב קלעים חמש עשרה אמה אל הכתף וגו' וכתיב ולכתף השנית מזה ומזה לשער החצר והשתא אי לאו דקרא דלפניו בגובהה כתיב לא הוצרך לכתוב מזה ומזה לשער החצר כיון דכבר פי' צד אחד אלא וודאי קרא קמא איירי בגובה והא דכתיב בקרא קמא עמודיהם שלשה דמשמע דארוחבן קאי י''ל דאדלבתריה קאי ותדע דהמקשה הביא קרא דתרומה חמש עשרה אמה קלעים והמתרץ הביא קרא דויקהל קלעים חמש עשרה אמה אל הכתף וגם רב אשי שסידר הש''ס הביא למעלה ולכתף השנית מזה ומזה דויקהל ולא הביא קרא דתרומה שהוא אצל הפסוק שהביא תחלה דהיינו ולכתף השנית חמש עשרה קלעים והביאו בשביל שתירץ בזה הפסוק והשתא ודאי הואיל וגובה היה כ''כ פשיטא דנקרא שער ומתחלה לא הקשה אלא דלא משמע ליה דאיקרי שער בעבור גובהו חמש: אמר אביי פליג בברייתא. משמע ולעולם מפתח אולם גמר ומכשיר עד רוחב כ' וקשה דלקמן (ד' י.) אמר דלא מכשיר ר' יהודה אלא עד י''ג אמה ושליש: עד ארבעים וחמשים אמה. אין להקשות השתא נ' שרי מ' מיבעיא דאיכא למימר מ' ונ' כדחמרי אינשי כדמשמע בפרק מפנין (שבת ד' קכו:): ליבעו דלתות כהיכל. ואע''ג דבאהל מועד שהיה נמי הפתח רחב י' לא היו דלתות ואפי' הכי קרי ליה פתח היינו משום שלא היה גבוה אלא י' א''נ ע''כ אהל מועד שלא כדין נקרא פתח שהרי היה פרוץ במלואו דלא הוה ליה גיפופי: אלא מעתה לא תיהני ליה צורת הפתח. אבל לא תיהני ליה דלתות לא פריך דפשיטא הואיל ואית ליה דלתות והן ננעלות דהויא כמחיצה מעלייתא ולא שייך נמי למיפרך דליבעי צורת הפתח דצורת הפתח לא הוי אלא משום נוי בעלמא אבל האי פריך שפיר דלא תהני ליה צורת הפתח דאי הוה קרוי פתח אף כשגדול ביותר ע''י צורת הפתח היה לו לעשותו שוה לאולם: מידי הוא טעמא אלא לרב. ואע''ג דברייתא נמי גמרה מהיכל איכא למימר דפליגא אמתני' א''נ לא נקט היכל אלא לסימנא בעלמא כדאמרינן בסמוך: (תוספות)";
        assertEquals(text, object.get(JBO_TEXT));

        //masechet 4 daf 21 amud 1 2nd part - in perek 2
        object = json[4].getObject(117);
        assertEquals("jbr:bavli-4-21-1", object.get(URI));
        assertEquals("bavli-4", object.get(JBO_MASECHET));
        assertEquals("jbr:bavli-perek-4-2", object.get(JBO_PEREK));
        assertEquals("פסחים כא א", object.get(RDFS_LABEL));
        assertEquals("39", object.get(JBO_POSITION));
        text = "מתני' כל שעה שמותר לאכול מאכיל לבהמה לחיה ולעופות ומוכר לנכרי ומותר בהנאתו עבר זמנו אסור בהנאתו ולא יסיק בו תנור וכירים ר' יהודה אומר אין ביעור חמץ אלא שריפה וחכמים אומרים אף מפרר וזורה לרוח או מטיל לים: גמ' כל שעה שמותר לאכול מאכיל הא כל שעה שאינו מותר לאכול אינו מאכיל לימא מתני' דלא כר' יהודה דאי ר' יהודה הא איכא חמש דאינו אוכל ומאכיל דתנן ר' מאיר אומר אוכלין כל חמש ושורפין בתחלת שש רבי יהודה אומר אוכלין כל ארבע ותולין כל חמש ושורפין בתחלת שש ואלא מאי ר' מאיר היא האי כל שעה שמותר לאכול מאכיל כל שעה שאוכל מאכיל מיבעי ליה אמר רבה בר עולא מתניתין רבן גמליאל היא דתנן רבן גמליאל אומר חולין נאכלין כל ארבע תרומה כל חמש ושורפין בתחלת שש והכי קאמר כל שעה שמותר לאכול כהן בתרומה ישראל מאכיל חולין לבהמה לחיה ולעופות למה לי למיתנא בהמה למה לי למיתנא חיה צריכא דאי תנא בהמה דאי משיירא חזי לה אבל חיה דאי משיירא קמצנעא לה אימא לא ואי תנא חיה משום דאי משיירא מיהת מצנעא אבל בהמה זימנין דמשיירא ולא מסיק אדעתיה וקאי עליה בבל יראה ובבל ימצא אימא לא צריכא עופות ל''ל איידי דתנא בהמה וחיה תנא נמי עופות: ומוכרו לנכרי: פשיטא לאפוקי מהאי תנא דתניא ב''ש אומרים לא ימכור אדם חמצו לנכרי אא''כ יודע בו שיכלה קודם פסח וב''ה אומרים כל שעה שמותר לאכול מותר למכור";
        assertEquals(text, object.get(JBO_TEXT));
        //masechet 4 daf 21 amud 1 2nd part - in perek 2 - perush rashi
        object = json[4].getObject(118);
        assertEquals("jbr:bavli-rashi-4-21-1", object.get(URI));
        assertEquals("bavli-4", object.get(JBO_MASECHET));
        assertEquals("jbr:bavli-perek-4-2", object.get(JBO_PEREK));
        assertEquals("רש\"י פסחים כא א", object.get(RDFS_LABEL));
        assertEquals("39", object.get(JBO_POSITION));
        assertEquals("jbr:bavli-4-21-1", object.get(JBO_INTERPRETS));
        text = "רש\"י  מתני' כל שעה שמותר לאכול מאכיל. לדוקייא איצטריך דתידוק הא משעה שאינו מותר לאכול אינו מותר להאכיל: ולא יסיק בו תנור וכירים. בגמרא פריך פשיטא הא נמי הנאה היא: גמ' כל שעה שאוכל מאכיל מבעי ליה. אבל השתא דנקט לה בתרי לישני משמע דאתרי גברי קאי והא ליכא למימר דהכי קאמר כל שעה שמותר לאכול מן התורה מאכיל אפילו מדרבנן ותיתוקם אליבא דר' יהודה דהא איכא שש דמותר לאכול מן התורה ואסור להאכיל לדברי הכל: אלא הכי קאמר כל שעה. שיש היתר לשום אדם לאכול מאכיל אף האסור לאכול לבהמתו כו': בהמה אי משיירא חזי ליה. שאין דרכה להצניע אבל חיה כגון חולדה ונמיה וחתול דרכן להצניע: ואי תנא חיה. הוה אמינא היא עדיפא משום דאי משיירא מצנעא לה ולא עבר עליה בבל יראה: ולאו אדעתיה. לבטלו קודם שיבוא הפסח דקסברי מצוה עליו לבערו מן העולם ולא שיהא קיים: (רש\"י)";
        assertEquals(text, object.get(JBO_TEXT));
        //masechet 4 daf 21 amud 1 2nd part - in perek 2 - perush tosafot
        object = json[4].getObject(119);
        assertEquals("jbr:bavli-tosafot-4-21-1", object.get(URI));
        assertEquals("bavli-4", object.get(JBO_MASECHET));
        assertEquals("jbr:bavli-perek-4-2", object.get(JBO_PEREK));
        assertEquals("תוספות פסחים כא א", object.get(RDFS_LABEL));
        assertEquals("39", object.get(JBO_POSITION));
        assertEquals("jbr:bavli-4-21-1", object.get(JBO_INTERPRETS));
        text = "תוספות  מתני' כל שעה. עבר זמנו אסור בהנאה. ואסור למכור ואם מכר דמיו מותרין דאין תופס את דמיו כדתנן בפ''ב דקדושין (דף נו:) מכרן וקידש בדמיהן מקודשת: לימא מתניתין דלא כר' יהודה. אף לפי המסקנא לא אתיא כר' יהודה אלא הכי קאמר לימא מתני' דלא כר' יהודה אלא כר' מאיר ומסיק דכר' מאיר נמי לא אתי: ואי אשמעינן חיה משום דמצנעא לה. ואין עובר משום בל יטמין דבל יטמין נפקא לן מלא ימצא ואין זה מצוי כיון שאין ידוע היכן הוא וכן משמע בפ''ק (דף ו:) דפריך וכי משכחת לה ליבטלה משמע דכל כמה דלא משכחת לא עבר בבל יראה הק' רשב''א היכי שרי להאכיל לחיה שדרכה להטמין הא תנן בפ''ק (דף ט:) מה שמשייר יניחנו בצינעא כדי שלא תטול חולדה בפניו ויהא צריך בדיקה אחריו וכ''ש שאסור ליתן בפניהם ויש לחלק בין חיה לחולדה המגדלים בבתים דההיא לא מצנעא כולי האי כמו חולדה הטומנת בחורים ובסדקין: וקאי עליה בבל יראה. פי' אם לא ביטלו והוא הדין דהוה מצי למימר דילמא אתי למיכל מיניה: (תוספות)";
        assertEquals(text, object.get(JBO_TEXT));

        //masechet 6 daf 87 amud 2
        object = json[6].getObject(json[6].subjects.size()-6);
        assertEquals("jbr:bavli-6-87-2", object.get(URI));
        assertEquals("bavli-6", object.get(JBO_MASECHET));
        assertEquals("jbr:bavli-perek-6-8", object.get(JBO_PEREK));
        assertEquals("מסכת יומא פז ב", object.get(RDFS_LABEL));
        assertEquals("172", object.get(JBO_POSITION));
        text = "אתא ר' חייא הדר לרישא עייל בר קפרא הדר לרישא אתא ר''ש ברבי הדר לרישא אתא ר' חנינא (בר) חמא אמר כולי האי נהדר וניזיל לא הדר איקפיד ר' חנינא אזל רב לגביה תליסר מעלי יומי דכפורי ולא איפייס והיכי עביד הכי והאמר ר' יוסי בר חנינא כל המבקש מטו מחבירו אל יבקש ממנו יותר משלש פעמים רב שאני ור' חנינא היכי עביד הכי והאמר רבא כל המעביר על מדותיו מעבירין לו על כל פשעיו אלא ר' חנינא חלמא חזי ליה לרב דזקפוהו בדיקלא וגמירי דכל דזקפוהו בדיקלא רישא הוי אמר שמע מינה בעי למעבד רשותא ולא איפייס כי היכי דליזיל ולגמר אורייתא בבבל ת''ר מצות וידוי ערב יוה''כ עם חשכה אבל אמרו חכמים יתודה קודם שיאכל וישתה שמא תטרף דעתו בסעודה ואע''פ שהתודה קודם שאכל ושתה מתודה לאחר שיאכל וישתה שמא אירע דבר קלקלה בסעודה ואף על פי שהתודה ערבית יתודה שחרית שחרית יתודה במוסף במוסף יתודה במנחה במנחה יתודה בנעילה והיכן אומרו יחיד אחר תפלתו ושליח צבור אומרו באמצע מאי אמר אמר רב אתה יודע רזי עולם ושמואל אמר ממעמקי הלב ולוי אמר ובתורתך כתוב לאמר ר' יוחנן אמר רבון העולמים ר' יהודה אמר כי עונותינו רבו מלמנות וחטאתינו עצמו מספר רב המנונא אמר אלהי עד שלא נוצרתי איני כדאי עכשיו שנוצרתי כאילו לא נוצרתי עפר אני בחיי ק''ו במיתתי הרי אני לפניך ככלי מלא בושה וכלימה יהי רצון מלפניך שלא אחטא ומה שחטאתי מרוק ברחמיך אבל לא ע''י יסורין והיינו וידויא דרבא כולה שתא ודרב המנונא זוטא ביומא דכפורי אמר מר זוטרא לא אמרן אלא דלא אמר אבל אנחנו חטאנו אבל אמר אבל אנחנו חטאנו תו לא צריך דאמר בר המדודי הוה קאימנא קמיה דשמואל והוה יתיב וכי מטא שליחא דצבורא ואמר אבל אנחנו חטאנו קם מיקם אמר שמע מינה עיקר וידוי האי הוא תנן התם בשלשה פרקים בשנה כהנים נושאין את כפיהן ארבעה פעמים ביום בשחרית במוסף במנחה ובנעילת שערים ואלו הן שלשה פרקים בתעניות ובמעמדות וביום הכפורים מאי נעילת שערים רב אמר צלותא יתירתא ושמואל אמר מה אנו מה חיינו מיתיבי אור יוה''כ מתפלל שבע ומתודה בשחרית מתפלל שבע ומתודה במוסף מתפלל שבע ומתודה במנחה מתפלל שבע ומתודה בנעילה מתפלל שבע ומתודה תנאי היא דתניא יום הכפורים עם חשיכה מתפלל שבע ומתודה וחותם בוידוי דברי ר''מ וחכמים אומרים מתפלל שבע ואם רצה לחתום בוידוי חותם תיובתא דשמואל תיובתא עולא בר רב נחית קמיה דרבא פתח באתה בחרתנו וסיים במה אנו מה חיינו ושבחיה רב הונא בריה דרב נתן אמר ויחיד אומרה אחר תפלתו אמר רב תפלת נעילה פוטרת את של ערבית רב לטעמיה דאמר צלותא יתירא היא וכיון דצלי ליה תו לא צריך ומי אמר רב הכי והאמר רב הלכה כדברי האומר תפלת ערבית רשות לדברי האומר חובה קאמר מיתיבי אור יום הכפורים מתפלל שבע ומתודה שחרית שבע ומתודה מוסף שבע ומתודה בנעילה מתפלל שבע ומתודה ערבית מתפלל שבע מעין שמונה עשרה רבי חנינא בן גמליאל משום אבותיו מתפלל שמונה עשרה שלימות";
        assertEquals(text, object.get(JBO_TEXT));
        //masechet 6 daf 87 amud 2 - perush rashi
        object = json[6].getObject(json[6].subjects.size()-5);
        assertEquals("jbr:bavli-rashi-6-87-2", object.get(URI));
        assertEquals("bavli-6", object.get(JBO_MASECHET));
        assertEquals("jbr:bavli-perek-6-8", object.get(JBO_PEREK));
        assertEquals("רש\"י יומא פז ב", object.get(RDFS_LABEL));
        assertEquals("172", object.get(JBO_POSITION));
        assertEquals("jbr:bavli-6-87-2", object.get(JBO_INTERPRETS));
        text = "רש\"י  אתא ר' חייא. וגם הוא היה חפץ לפסוק עמו וחזר בשבילו לראש הפרשה: רב שאני. מחמיר היה לעצמו: חלמא חזא ליה לרב. ראה חלום על רב שתלאוהו בדקל והוא סימן נשיאות ראש וגדולה ור' חנינא ראש ישיבה היה כדאמר רבי (כתובוח דף קג:) בשעת פטירתו חנינא בר חמא ישב בראש וכשראה חלום זה על רב דאג למות לפי שאין מלכות נוגעת בחברתה אמר אדחייה מהכא ויברח לבבל מפני ושם יהיה ראש ולא נדחין למות בשבילו: עם חשיכה. לאחר אכילה משקיבל עליו יוה''כ: שמא תטרף דעתו. מחמת שכרות: דבר קלקלה. של חטא: ממעמקי הלב. תפלה היא: בתורתך כתוב. כי ביום הזה יכפר: רבון העולמים. כי לא על צדקותינו וכו': בתענית. של גשמים: ובמעמדות. ארבעה ימים בכל שבת שאנשי משמר ישראל מתכנסין בעריהן ומתענין וקורין במעשה בראשית כדאמרינן במס' תענית (דף כו.) והתם מקשינן ותעניות ומעמדות מי אית בהו מוסף ומשנינן הכי קאמר כהנים נושאין את כפיהן כל זמן שמתפללין ואפי' במנחה לפי ששלשה פרקים הללו תעניות הם ואין שכרות במנחה אבל שאר ימות השנה אין נשיאות כפים במנחה ויש מהן ארבע פעמים ביום: צלותא יתירתא. מתפלל שבע כשאר התפלות: ושמואל אמר מה אנו ומה חיינו. אומר ואינו מתפלל: אור יום הכפורים. ליל יום הכפורים: וחותם בוידוי. גרס בתוספתא אינו חותם מקדש ישראל אלא האל הסולחן וחכמים אומרים כל מקום שזקוק לשבע אף בשאר התפלות אם רצה לחתום בוידוי חותם כך שמעתי אבל לא גרס לה בתוספתא הכי אלא וחכמים אומרים מתפלל שבע ואם רצה לחתום בוידוי חותם ואנעילה קיימי קתני מיהת נעילה מתפלל שבע ומתודה תיובתא דשמואל תיובתא: נחית קמיה דרבא. בנעילה ולשון נעילה פליגי אמוראי בברכו' ירושלמי חד אמר נעילת שערי שמים וחד אמר נעילת שערי עזרה: וכיון דצלי. משחשיכה תו לא צריך: והא אמר רב. במס' ברכות תפלת ערבית רשות ומאי פוטרת דקאמר: לדברי האומר חובה קאמר. דזו פוטרתה: מיתיבי וכו'. קתני נעילה וקתני ערבית: שבע מעין שמונה עשרה. ג' ראשונות וג' אחרונות כתיקנן ואומר הביננו באמצע שיש בה מעין שלש עשרה ברכות והיא תפלה קצרה שתיקנו לעוברי דרכים ולמוצאי יוה''כ התירו לצאת בה מפני הטורח: (רש\"י)";
        //text = " רש\"י  אתא ר' חייא. וגם הוא היה חפץ לפסוק עמו וחזר בשבילו לראש הפרשה: רב שאני. מחמיר היה לעצמו: חלמא חזא ליה לרב. ראה חלום על רב שתלאוהו בדקל והוא סימן נשיאות ראש וגדולה ור' חנינא ראש ישיבה היה כדאמר רבי (כתובוח דף קג:) בשעת פטירתו חנינא בר חמא ישב בראש וכשראה חלום זה על רב דאג למות לפי שאין מלכות נוגעת בחברתה אמר אדחייה מהכא ויברח לבבל מפני ושם יהיה ראש ולא נדחין למות בשבילו: עם חשיכה. לאחר אכילה משקיבל עליו יוה''כ: שמא תטרף דעתו. מחמת שכרות: דבר קלקלה. של חטא: ממעמקי הלב. תפלה היא: בתורתך כתוב. כי ביום הזה יכפר: רבון העולמים. כי לא על צדקותינו וכו': בתענית. של גשמים: ובמעמדות. ארבעה ימים בכל שבת שאנשי משמר ישראל מתכנסין בעריהן ומתענין וקורין במעשה בראשית כדאמרינן במס' תענית (דף כו.) והתם מקשינן ותעניות ומעמדות מי אית בהו מוסף ומשנינן הכי קאמר כהנים נושאין את כפיהן כל זמן שמתפללין ואפי' במנחה לפי ששלשה פרקים הללו תעניות הם ואין שכרות במנחה אבל שאר ימות השנה אין נשיאות כפים במנחה ויש מהן ארבע פעמים ביום: צלותא יתירתא. מתפלל שבע כשאר התפלות: ושמואל אמר מה אנו ומה חיינו. אומר ואינו מתפלל: אור יום הכפורים. ליל יום הכפורים: וחותם בוידוי. גרס בתוספתא אינו חותם מקדש ישראל אלא האל הסולחן וחכמים אומרים כל מקום שזקוק לשבע אף בשאר התפלות אם רצה לחתום בוידוי חותם כך שמעתי אבל לא גרס לה בתוספתא הכי אלא וחכמים אומרים מתפלל שבע ואם רצה לחתום בוידוי חותם ואנעילה קיימי קתני מיהת נעילה מתפלל שבע ומתודה תיובתא דשמואל תיובתא: נחית קמיה דרבא. בנעילה ולשון נעילה פליגי אמוראי בברכו' ירושלמי חד אמר נעילת שערי שמים וחד אמר נעילת שערי עזרה: וכיון דצלי. משחשיכה תו לא צריך: והא אמר רב. במס' ברכות תפלת ערבית רשות ומאי פוטרת דקאמר: לדברי האומר חובה קאמר. דזו פוטרתה: מיתיבי וכו'. קתני נעילה וקתני ערבית: שבע מעין שמונה עשרה. ג' ראשונות וג' אחרונות כתיקנן ואומר הביננו באמצע שיש בה מעין שלש עשרה ברכות והיא תפלה קצרה שתיקנו לעוברי דרכים ולמוצאי יוה''כ התירו לצאת בה מפני הטורח: (רש\"י)";
        assertEquals(text, object.get(JBO_TEXT));
        //masechet 6 daf 87 amud 2 - perush tosafot
        object = json[6].getObject(json[6].subjects.size()-4);
        assertEquals("jbr:bavli-tosafot-6-87-2", object.get(URI));
        assertEquals("bavli-6", object.get(JBO_MASECHET));
        assertEquals("jbr:bavli-perek-6-8", object.get(JBO_PEREK));
        assertEquals("תוספות יומא פז ב", object.get(RDFS_LABEL));
        assertEquals("172", object.get(JBO_POSITION));
        assertEquals("jbr:bavli-6-87-2", object.get(JBO_INTERPRETS));
        text = "תוספות  והאמר רב תפלת ערבית רשות. תימה לרב דאמר תפלת ערבית רשות האמר פרק תפלת השחר (ברכות דף כו.) טעה ולא התפלל ערבית מתפלל שחרית שתים ואמר נמי התם בסוף פרק תפלת השחר (שם דף ל:) טעה ולא הזכיר של ראש חודש בלילה אין מחזירין אותו לפי שאין מקדשין את החודש בלילה הא לאו הכי מחזירין ואמאי תיפוק ליה דתפלת ערבית רשות ואומר ר''י נהי דרשות היא אין לבטלה בחנם אם לא מפני שום מצוה עוברת או שרא המייניה דפ''ק דשבת (דף ט:) דלא מטרחינן ליה וכן עלה על מטתו דירושלמי דאין מטריחין אותו שירד תדע כיון דיעקב אבינו תיקנה לא תיקנה לבטלה ועוד כיון דכנגד אברים ופדרים היא שמעלן ומקטירן כל הלילה נהי דלא מעכבי כפרה מ''מ מצוה להקטיר תפלת ערבית נמי מצוה ותימה מאי פריך הכא והאמר רב תפלת ערבית רשות והאמרינן דבחנם אין לבטלה וי''ל דאין זה בחנם דבליל יוה''כ מצוה לטרוח ולהכין צורכי סעודה דהוי כעין יו''ט כדאמרי' במדרש דבמוצאי יוה''כ בת קול יוצאת ואומרת לך אכול בשמחה לחמך וכמו שפירשנו שאין לבטלה בחנם אפי' למ''ד תפלת ערבית רשות הכי משמע בירושלמי דתפלת השחר דלמ''ד תפלת ערבית חובה אין תפלת נעילה פוטרתה ולמ''ד רשות תפלת נעילה פוטרתה משמע אבל בחנם אין לבטלה ואע''פ שחולק על הש''ס שלנו בזה דבגמרא דידן משמע דרב לדברי האומר חובה קאמר אבל למ''ד רשות לא בעיא תפלה לפוטרה מ''מ במה שאנו יכולין להשוותם יש לנו להשוותם וכה''ג פי' גבי אין מקדשין את החודש בלילה אע''ג דתפלת ערבית רשות כיון דשווייה עליה חובה שפיר דמי ולהכי צריך לההוא טעמא דאין מקדשין החודש בלילה ואין נראה לר''י דהאמר בפ''ק דשבת למ''ד תפלת ערבית רשות מכי שרא המייניה לא מטרחינן ליה הא אי לא שרא המייני' מטרחינן ליה אע''פ שלא התפלל כלל וכי תימא כיון שהתפלל בשאר לילות שויא עליה חובה א''כ אמאי איצטריך לשנויי הכא דרב לדברי האומר חובה קאמר לימא דאפי' לדידיה דס''ל רשות כיון דשויא עליה חובה בשאר לילות חובה היא עילויה ובעיא תפלה למיפטריה על כן נראה כדפרישית: מתפלל שבע מעין שמונה עשרה ברכות. פירש רשב''ם טעמא משום דכיון דאכתי הוא בתענית חשוב כיוה''כ להכי מתפלל שבע ולפי שכבר פנה היום וחול הוי להכי מתפלל מעין י''ח: (תוספות)";
        assertEquals(text, object.get(JBO_TEXT));

        //masechet 9 daf 2 amud 1
        object = json[9].getObject(0);
        assertEquals("jbr:bavli-9-2-1", object.get(URI));
        assertEquals("bavli-9", object.get(JBO_MASECHET));
        assertEquals("jbr:bavli-perek-9-1", object.get(JBO_PEREK));
        assertEquals("מסכת תענית ב א", object.get(RDFS_LABEL));
        assertEquals("1", object.get(JBO_POSITION));
        text = "מתני' מאימתי מזכירין גבורות גשמים רבי אליעזר אומר מיום טוב הראשון של חג ר' יהושע אומר מיום טוב האחרון של חג אמר לו ר' יהושע הואיל ואין הגשמים אלא סימן קללה בחג למה הוא מזכיר אמר לו ר' אליעזר אף אני לא אמרתי לשאול אלא להזכיר משיב הרוח ומוריד הגשם בעונתו אמר לו א''כ לעולם יהא מזכיר אין שואלין את הגשמים אלא סמוך לגשמים ר' יהודה אומר העובר לפני התיבה ביו''ט האחרון של חג האחרון מזכיר הראשון אינו מזכיר ביו''ט הראשון של פסח הראשון מזכיר האחרון אינו מזכיר: גמ' תנא היכא קאי דקתני מאימתי תנא התם קאי דקתני מזכירין גבורות גשמים בתחיית המתים ושואלין בברכת השנים והבדלה בחונן הדעת וקתני מאימתי מזכירין גבורות גשמים וליתני התם מ''ש דשבקיה עד הכא אלא תנא מראש השנה סליק דתנן ובחג נידונין על המים ואיידי דתנא ובחג נידונין על המים תנא מאימתי מזכירין גבורות גשמים וליתני מאימתי מזכירין על הגשמים מאי גבורות גשמים א''ר יוחנן מפני שיורדין בגבורה שנאמר {איוב ט-י} עושה גדולות עד אין חקר ונפלאות עד אין מספר וכתיב {איוב ה-י} הנותן מטר על פני ארץ ושולח מים על פני חוצות מאי משמע אמר רבה בר שילא אתיא חקר חקר מברייתו של עולם כתיב הכא עושה גדולות עד אין חקר וכתיב התם {ישעיה מ-כח} הלא ידעת אם לא שמעת אלהי עולם ה' בורא קצות הארץ לא ייעף ולא ייגע אין חקר לתבונתו וכתיב {תהילים סה-ז} מכין הרים בכחו נאזר בגבורה ומנא לן דבתפלה דתניא {דברים יא-יג} לאהבה את ה' אלהיכם ולעבדו בכל לבבכם איזו היא עבודה שהיא בלב הוי אומר זו תפלה וכתיב בתריה {דברים יא-יד} ונתתי מטר ארצכם בעתו יורה ומלקוש אמר ר' יוחנן ג' מפתחות בידו של הקב''ה שלא נמסרו ביד שליח ואלו הן מפתח של גשמים ומפתח של חיה ומפתח של תחיית המתים מפתח של גשמים דכתיב {דברים כח-יב} יפתח ה' לך את אוצרו הטוב את השמים לתת מטר ארצך בעתו מפתח של חיה מנין דכתיב {בראשית ל-כב} ויזכור אלהים את רחל וישמע";
        assertEquals(text, object.get(JBO_TEXT));
        //masechet 9 daf 2 amud 1 - perush rashi
        object = json[9].getObject(1);
        assertEquals("jbr:bavli-rashi-9-2-1", object.get(URI));
        assertEquals("bavli-9", object.get(JBO_MASECHET));
        assertEquals("jbr:bavli-perek-9-1", object.get(JBO_PEREK));
        assertEquals("רש\"י תענית ב א", object.get(RDFS_LABEL));
        assertEquals("1", object.get(JBO_POSITION));
        assertEquals("jbr:bavli-9-2-1", object.get(JBO_INTERPRETS));
        text = "רש\"י  מתני' מאימתי מזכירין גבורות גשמים. שאומר משיב הרוח ומוריד הגשם ובגמרא מפרש טעמא אמאי קרי ליה גבורות גשמים מפני שיורדין בגבורה שנאמר עושה גדולות וגו': סימן קללה בחג הן. כדאמרינן במס' סוכה בפרק הישן (דף כח:) מאימתי מותר לפנות משתסרח המקפה משל לעבד שבא למזוג כוס לרבו ושפך לו קיתון על פניו וא''ל אי אפשי בשמושך כלומר כשהגשמים יורדין לסוכה הכל יוצאין ונראה שאין הקב''ה חפץ שנשתמש לפניו ואמאי מתחילין להזכיר גבורות גשמים בחג ונראה שהוא מתפלל שיבא מטר בחג: לא אמרתי לשאול. שיתפלל על הגשמים בחג כגון ותן טל ומטר: אלא להזכיר. שמתחיל להזכיר בחג גבורות של מקום שמוריד גשמים: בעונתו. כלומר בזמנו: אם כן. ואמאי פוסק בפסח מלהזכיר: גמ' תנא היכא קאי. כלומר מדקתני מאימתי מכלל דפשיטא ליה להאי תנא דחייבים להזכיר והיכא חזינן דמחייב להזכיר: התם קאי. מזכירין גבורות גשמים כו' במסכת ברכות: (וליתני התם. במסכת ברכות סמוך דתני מזכירין ליתני ): מ''ש דשבקיה עד הכא. כלומר האי דקתני הכא בסדר מועד מאימתי ליתני התם דקתני מזכירין במסכת ברכות היינו סדר זרעים: עד הכא. עד סדר מועד: אלא. לא תימא דהא דקתני מאימתי דהתם קאי דתנא מראש השנה סליק ששניהן בסדר אחד הן להכי לא מצי למימר מאי שנא דשבקיה עד הכא: (בחג. הוי דין על המים ומשום דתני מאימתי הוי דין על המים קתני נמי אימתי זמן הזכרה): ואיידי דתני בחג נידונין. כלומר אגב דתנא בחג נידונין על המים קסבר בנפשיה הואיל ונידונין בחג על המים ש''מ בעינן להזכיר עניינא דמיא לרצויי על המים דליתו לברכה להכי קתני מאימתי מזכירין: כתיב עושה גדולות עד אין חקר. אלמא דכתיב חקר בגשמים וכתיב חקר בברייתו של עולם מה ברייתו של עולם כתיב ביה גבורה אף גשמים הוי כמאן דכתיב ביה גבורה: ואמר רבי יוחנן שלש מפתחות. היינו שלא נמסרו לשליח אחד ביחד: יפתח ה'. ולא שליח: (רש\"י)";
        assertEquals(text, object.get(JBO_TEXT));
        //masechet 9 daf 2 amud 1 - perush tosafot
        object = json[9].getObject(2);
        assertEquals("jbr:bavli-tosafot-9-2-1", object.get(URI));
        assertEquals("bavli-9", object.get(JBO_MASECHET));
        assertEquals("jbr:bavli-perek-9-1", object.get(JBO_PEREK));
        assertEquals("תוספות תענית ב א", object.get(RDFS_LABEL));
        assertEquals("1", object.get(JBO_POSITION));
        assertEquals("jbr:bavli-9-2-1", object.get(JBO_INTERPRETS));
        text = "תוספות  מתני' מאימתי. מיום טוב האחרון של חג. שמיני דלא יתבון בסוכה ואפילו האידנא אינו אלא מדרבנן משום ספיקא ואע''ג דבקיאינן בקביעא דירחא גזרה שמא יחזור הדבר לקלקולו או משום מנהג אבותינו בידינו כדאי' פ''ק דביצה (דף ד:) ולכן מדכרינן אבל כל שבעה לא שהגשמים בימי סוכה סימן קללה הן כדתנן פרק שני דסוכה (דף כח:) משל לעבד וכו': אם כן. אם אתה אומר מזכירין אע''פ שאין שואלין הואיל ומשמע בעונתו אף בקיץ יזכירו ומה אתה נותן סימן מי''ט הראשון ור' אליעזר אומר בברייתא בגמרא כל הקיץ אם בא להזכיר מזכיר דלעולם בעונתו משמע מיהו עד השתא לא רמי עליה חובה אבל בי''ט ראשון חובה לרצות לפני שאלה שכל הבא לבקש מקדים ומרצה ואסימן קללה לא קפדינן ורבי יהושע קפיד: התם קאי. פירוש בסדר זרעים בברכות פרק אין עומדין (דף לג.) וליתני התם מאי שנא כו' כלומר אמאי תנא הכא במועד מאי דתני התם בסדר זרעים: אלא תנא מראש השנה קא סליק. פירוש ור''ה הויא בסדר nועד ואם תאמר ואכתי ליתני בסדר זרעים וי''ל דהכא עיקר דאמר בחג נידונין על המים ואורחא דמילתא לרצות לפני שאלה לכך שביק עד הכא אבל בסדר זרעים אומרים מזכירין גבורות גשמים אפשר דמשמע לעולם כמו תחיית המתים או הבדלה בחונן הדעת: וליתני מאימתי מזכירין גשמים מאי גבורות גשמים אמר ר' יוחנן שיורדין בגבורה. תימה התם בברכות פ' אין עומדין (שם) קתני כי הכא מזכירין גבורות גשמים ושואלין הגשמים וכו' אמאי לא קא מקשה כמו הכא וליתני מזכירין על הגשמים מאי גבורות ויש לומר שאני הכא דהוי עיקר סדר של גשמים באיזה זמן מתחילין לאומרו ומאימתי פוסקין מלאומרו ומשום הכי פריך הכא טפי מהתם: וכתיב מכין הרים בכחו נאזר בגבורה. וזה גבי בריאת עולם וכי היכי דהאי חקר בבריאת העולם רוצה לומר בגבורות כמו כן הכא גבי גשמים האי חקר נמי רוצה לומר גבורות אכן יש להקשות אמאי נקט גבורות טפי מכח וכמו כן הוה ליה למימר מאימתי מזכירין כח גשמים או ליתני גדולות גשמים וי''ל דמן הדין נקט גבורות משום טעמא דאיכא כח ואיכא גדולה אי נמי משום דהברכה מתחלת בגבורה להכי נקט גבורות: שלשה מפתחות שלא נמסרו לשליח. וא''ת והא אמרינן (סנהדרין דף קיג.) דמפתח הגשמים נמסרין לאליהו וכן מפתח של תחיית המתים וכן לאלישע דכתיב (מלכים א יז) ויאמר אליהו חי ה' וגו' דה''נ אומר בפירקין דלקמן (דף כג.) וי''ל דהא דקאמר שלא נמסרו לשליח אינו ר''ל שלא נמסרו מעולם דהא של תחיית המתים ושל גשמים נמסרו אלא לא נמסרו לשליח להיות לעולם ממונה עליהם: וישמע אליה אלהים ויפתח את רחמה. פירוש שהוא בעצמו עשה וא''ת מהכא משמע דליכא אלא שלשה מפתחות וא''כ יש להקשות והא כתיב (ירמיה נ) פתח ה' את אוצרו ויוצא את כלי זעמו ומשמע נמי שלא נמסרו לשליח וכמו ההיא וישמע אליה אלהים וגו' וא''כ אמאי לא חשיב לה וי''ל דלא חשיב כי אם אותן מפתחות של טובה ולהכי לא קא חשיב מפתח של זעם וא''ת דמשמע מהאי קרא דפתח ה' שלא נמסר מפתח של זעם לשליח והא אמרינן (פסחים דף קיח.) יורקמי שר של ברד הוי וי''ל מכלי זעם אחרינא קאמר שלא נמסרו לשליח אבל משום ברד לא דאותו של ברד נמסרו: (תוספות)";
        assertEquals(text, object.get(JBO_TEXT));

        //masechet 12 daf 11 amud 2 - 1st part in perek 1
        object = json[12].getObject(57);
        assertEquals("jbr:bavli-12-11-2", object.get(URI));
        assertEquals("bavli-12", object.get(JBO_MASECHET));
        assertEquals("jbr:bavli-perek-12-1", object.get(JBO_PEREK));
        assertEquals("מסכת חגיגה יא ב", object.get(RDFS_LABEL));
        assertEquals("20", object.get(JBO_POSITION));
        text = "לבתו מאנוסתו דלא כתיבא דאמר רבא אמר לי ר' יצחק בר אבדימי אתיא הנה הנה אתיא זימה זימה: הן הן גופי תורה: הני אין הנך לא אלא אימא הן והן גופי תורה:";
        assertEquals(text, object.get(JBO_TEXT));
        //masechet 12 daf 11 amud 2 - 1st part in perek 1 - perush rashi
        object = json[12].getObject(58);
        assertEquals("jbr:bavli-rashi-12-11-2", object.get(URI));
        assertEquals("bavli-12", object.get(JBO_MASECHET));
        assertEquals("jbr:bavli-perek-12-1", object.get(JBO_PEREK));
        assertEquals("רש\"י חגיגה יא ב", object.get(RDFS_LABEL));
        assertEquals("20", object.get(JBO_POSITION));
        assertEquals("jbr:bavli-12-11-2", object.get(JBO_INTERPRETS));
        text= "רש\"י  לבתו מאנוסתו דלא כתיבא. דאילו בתו מאשתו כתיבא ערות אשה ובתה וגו' (ויקרא יח) משמע בין שהבת ממנו בין מאיש אחר וכתיב קרא אחרינא ערות בת בנך או בת בתך וגו' ומוקמינן לה ביבמות (דף צז.) בבתו מאנוסתו מדלא אסר הכתוב בת בתה של אשה זו אלא בבת הבת שנולדה הימנו ובהאי קרא דאנוסה בת בתו ובת בנו כתיב בתו לא כתיב וא''ת ק''ו הוא אין מזהירין מן הדין ואין עונשין מדין ק''ו דיני ממונות ומצות עשה והלכות עבודה ופסולי קדשים אתה למד בק''ו אבל לא אזהרות ועונשין ומקראי נפקא לן במס' מכות (דף ה:) ומהיכן נפקא לן לבתו מאנוסתו: אמר רבא אמר לי ר' יצחק בר אבדימי אתיא הנה הנה. לאיסורא אתיא זימה זימה לשריפה כתיב בנישואין שארה הנה זימה היא וכתיב באונסין כי ערותך הנה מה האמור בנשואין עשה הכתוב בתה כבת בתה וכבת בנה אף באונסין עשה הכתוב בתו כבת בתו וכבת בנו אתיא זימה זימה לשריפה מאחר שלמדת אנוסה מנשואה ובנשואה כתיב זימה היא כמה דכתיב באנוסה דמי וחזור ולמוד בה שריפה מאיש אשר יקח את אשה ואת אמה זימה היא באש ישרפו אותו ואתהן (ויקרא כ): הני אין הנך לא. הני דמיפרשי הוו גופי תורה הנך דלא מיפרשי כולי האי לאו גופי תורה בתמיה: הן והן. אלו ואלו: (רש\"י)";
        assertEquals(text, object.get(JBO_TEXT));
        //masechet 12 daf 11 amud 2 - 1st part in perek 1 - perush tosafot
        object = json[12].getObject(59);
        assertEquals("jbr:bavli-tosafot-12-11-2", object.get(URI));
        assertEquals("bavli-12", object.get(JBO_MASECHET));
        assertEquals("jbr:bavli-perek-12-1", object.get(JBO_PEREK));
        assertEquals("תוספות חגיגה יא ב", object.get(RDFS_LABEL));
        assertEquals("20", object.get(JBO_POSITION));
        assertEquals("jbr:bavli-12-11-2", object.get(JBO_INTERPRETS));
        text = "תוספות  לבתו מאנוסתו. ההיא דערות בת בנך מוקמינן לה בריש נושאין על האנוסה (יבמות צז.) דמשמע הא בת בנה דידה גלי באנוסתו ואידך דאשה ובתה לא תגלה בנישואין דכתיב בה שאר: דאמר רבא אמר לי רב יצחק בר אבדימי. תרי הוו פי' בפ''ק דיבמות (דף ג. ושם) ובפרק כל הבשר (חולין דף קי. ושם): (תוספות)";
        assertEquals(text, object.get(JBO_TEXT));

        //masechet 17 daf 2 amud 1
        object = json[17].getObject(0);
        assertEquals("jbr:bavli-17-2-1", object.get(URI));
        assertEquals("bavli-17", object.get(JBO_MASECHET));
        assertEquals("jbr:bavli-perek-17-1", object.get(JBO_PEREK));
        assertEquals("מסכת סוטה ב א", object.get(RDFS_LABEL));
        assertEquals("1", object.get(JBO_POSITION));
        text = "מתני' המקנא לאשתו רבי אליעזר אומר מקנא לה על פי שנים ומשקה על פי עד אחד או ע''פ עצמו רבי יהושע אומר מקנא לה על פי שנים ומשקה ע''פ שנים כיצד מקנא לה אומר לה בפני שנים אל תדברי עם איש פלוני ודברה עמו עדיין היא מותרת לביתה ומותרת לאכול בתרומה נכנסה עמו לבית הסתר ושהתה עמו כדי טומאה אסורה לביתה ואסורה לאכול בתרומה ואם מת חולצת ולא מתייבמת: גמ' מכדי תנא מנזיר סליק מאי תנא דקא תנא סוטה כדרבי דתניא רבי אומר למה נסמכה פרשת נזיר לפרשת סוטה לומר לך שכל הרואה סוטה בקלקולה יזיר עצמו מן היין וליתני סוטה והדר ליתני נזיר איידי דתנא כתובות ותנא המדיר תנא נדרים ואיידי דתנא נדרים תנא נזיר דדמי לנדרים וקתני סוטה כדרבי: המקנא דיעבד אין לכתחילה לא קסבר תנא דידן אסור לקנאות א''ר שמואל בר רב יצחק כי הוה פתח ריש לקיש בסוטה אמר הכי אין מזווגין לו לאדם אשה אלא לפי מעשיו שנא' {תהילים קכה-ג} כי לא ינוח שבט הרשע על גורל הצדיקים אמר רבה בר בר חנה אמר ר' יוחנן וקשין לזווגן כקריעת ים סוף שנאמר {תהילים סח-ז} אלהים מושיב יחידים ביתה מוציא אסירים בכושרות איני והא אמר רב יהודה אמר רב ארבעים יום קודם יצירת הולד בת קול יוצאת ואומרת בת פלוני לפלוני בית פלוני לפלוני שדה פלוני לפלוני לא קשיא הא בזוג ראשון הא בזוג שני: ר''א אומר מקנא לה על פי שנים וכו': עד כאן לא פליגי אלא בקינוי וסתירה אבל בטומאה עד אחד מהימן ותנן נמי עד אחד אומר אני ראיתי שניטמאת לא היתה שותה מדאורייתא מנלן דמהימן עד אחד דתנו רבנן {במדבר ה-יג} ועד אין בה בשנים הכתוב מדבר או אינו אלא אפילו באחד ת''ל {דברים יט-טו} לא יקום עד אחד באיש";
        assertEquals(text, object.get(JBO_TEXT));
        //masechet 17 daf 2 amud 1 - perush rashi
        object = json[17].getObject(1);
        assertEquals("jbr:bavli-rashi-17-2-1", object.get(URI));
        assertEquals("bavli-17", object.get(JBO_MASECHET));
        assertEquals("jbr:bavli-perek-17-1", object.get(JBO_PEREK));
        assertEquals("רש\"י סוטה ב א", object.get(RDFS_LABEL));
        assertEquals("1", object.get(JBO_POSITION));
        assertEquals("jbr:bavli-17-2-1", object.get(JBO_INTERPRETS));
        text = "רש\"י  מתני' המקנא לאשתו. לישנא דקרא נקט וקנא את אשתו (במדבר ה) ולקמן בגמ' מפרש מאי לשון קינוי ובמתניתין מפרש כיצד מקנא לה אומר לה אל תסתרי עם איש פלוני: מקנא לה ע''פ שנים. אם בא להשקותה צריך להביא שני עדים שאמר לה בפניהם אל תסתרי עמו ואם לא קינא לה בפני שנים אינה נאסרת עליו בסתירתה ואינו משקה: ומשקה ע''פ עד א' או ע''פ עצמו. ואפי' אין עדים שנסתרה אלא עד אחד או הוא עצמו אומר ראיתיה שנסתרה אחר שקינאתי לה נאסרת בסתירה עד שתשתה ולקמן ילפינן מקראי שסתירתה אוסרתה עליו מספק: ר' יהושע אומר. צריך ב' עדים אף לסתירתה: ודברה עמו. שלא במקום סתר: עדיין מותרת לביתה. לשמש עם בעלה: ומותרת בתרומה. אם אשת כהן היא: כדי טומאה. כדי העראה: אסורה לביתה. מספק כדילפינן לקמן (דף כח.) שלשה ונטמאה אמורים בפרשה וקנא את אשתו והיא נטמאה ונסתרה והיא נטמאה תחת אישה ונטמאה אחד שאסורה לבעל ואחד שאסורה לבועל אם ימות בעלה או יגרשנה ואחד שאסורה לתרומה: ואם מת. קודם שהשקה ואין לו בנים והיא זקוקה ליבם: חולצת. לינשא לשוק ולא מתייבמת ובגמרא יליף לה: גמ' מכדי תנא מנזיר קא סליק. כן סדר המשנה סוטה אחר נזיר: מאי תנא דתנא סוטה. מאי תנא בנזירות דדמי לסוטה דתנא סוטה בתרה: בקלקולה. בניוולה ובבשתה שמנוולין אותה כדקתני מתני' (לקמן דף ז:) קושר חבל למעלה מדדיה: יזיר עצמו מן היין. שהיין מביא לידי קלות ראש והוא גרם לה: וליתני סוטה והדר נזיר. שכך היא סמיכת פרשתייהו: ותנא המדיר. פרק הוא בכתובות המדיר את אשתו ואיידי דאיירי בנדרי' תנא נדרים אחר כתובו' ואיידי דתנא נדרים תנא נזיר בתרה שאף הנזירות באה על ידי נדר והדר תנא סוטה בתרה: לכתחילה לא. מדלא תני רבי אליעזר אומר מקנא אדם לאשתו על פי שנים: אסור לקנאות. שמביא עצמו לידי תגר ואת אשתו לידי ניוול ואפי' היא טהורה: כי פתח. כשהיה בא לדרוש בפרשת סוטה: מזווגין אשה לפי מעשיו. צנועה לצדיק ופרוצה לרשע: כי לא ינוח שבט הרשע על גורל הצדיקים. לא יזדווג ממשלת רשע בגורל צדיק: וקשין. לפני המקום: לזווגם. הנך דלפי מעשיו: כקריעת ים סוף. שנשתנו סדרי בראשית: מושיב יחידים ביתה. אדם יחיד ואשה יחידה והוא מזווגם יחד ומיישב מהם בית: מוציא אסירים בכושרות. הוציא את ישראל ממצרים בחדש כשר לא חמה ולא צינה מקיש זיווג יחידים ליציאת מצרים: איני. מי הוי זיווג לפי רשע וזכות והא מקודם יצירתם שאין נודע רשעו וזכותו מכריזין את זוגו ואם תאמר הכל גלוי לפניו הכל בידי שמים חוץ מיראת שמים כדאמר במסכת נדה (דף טז:) מלאך הממונה על ההריון נוטל טיפה ומביאה לפני המקום ואומר לפניו טיפה זו מה תהא עליה גבור או חלש חכם או טיפש עשיר או עני אבל צדיק ורשע לא קאמר ליה דאין זה בידי שמים: זוג ראשון. לפי המזל: זוג שני. לפי מעשיו וקשה לזווגן לפי שאינה בת זוגו: עד כאן לא פליגי אלא בקינוי וסתירה. כלומר עד כאן לא שמענו מפלוגתייהו דבעינן שני עדים אלא בקינוי לר''א ובסתירה לר' יהושע: אבל בטומאה. אם יש עדים בקינוי וסתירה ויש עד אחד שקילקלה בסתירתה נאמן ואינה שותה אלא יוצאה בלא כתובה ואסורה לבעל ולבועל ולתרומה: שנטמאת באותה סתירה: מנלן דמהימן עד אחד. בטומאה של סתירה אחר קינוי: ועד אין בה בשנים הכתוב מדבר. וקאמר עדים שנים אין בטומאה זו אלא עד א' וקרא בטומאה קמישתעי ושכב איש אותה שכבת זרע ועדים שנים אין בה אלא א' והיא לא נתפשה לא נאנסה וממילא שמעינן דמהימן מדכתיב והיא לא נתפשה להחמיר עליה בא הכתוב לדונה כמזידה ומרישא דקרא נמי שמעת דמהימן דקאמר ומעלה בו מעל ושכב איש אותה ואין מעיד בדבר אלא זה ולקמן (דף ג.) מפרש דהאי קרא בתר קינוי כתיב דכתיב בתריה ועבר עליו רוח קנאה וגו' ודרשינן ליה לקמן שכבר עבר: או אינו אלא אחד. דקאמר קרא דאפילו עד אחד אין בה ולקמן פריך אלא במאי מיתסרא דקאמר קרא והיא לא נתפשה אלמא פשיטא דנטמאת מדמהדר בתר אונס ורצון: ת''ל לא יקום עד א' וגו'. מהאי קרא שמעינן דכל עד האמור בתורה שנים הם כדמפרש ואזיל: (רש\"י)";
        assertEquals(text, object.get(JBO_TEXT));
        //masechet 17 daf 2 amud 1 - perush tosafot
        object = json[17].getObject(2);
        assertEquals("jbr:bavli-tosafot-17-2-1", object.get(URI));
        assertEquals("bavli-17", object.get(JBO_MASECHET));
        assertEquals("jbr:bavli-perek-17-1", object.get(JBO_PEREK));
        assertEquals("תוספות סוטה ב א", object.get(RDFS_LABEL));
        assertEquals("1", object.get(JBO_POSITION));
        assertEquals("jbr:bavli-17-2-1", object.get(JBO_INTERPRETS));
        text = "תוספות  מתני' המקנא. איידי דתנא נדרים תנא נמי נזיר דדמיא לנדרים. תימה והא בריש מסכת נזיר (דף ב.) אמר דלא תנא ליה אלא אגב סוטה כדרבי וי''ל דלא קבעה בסדר נשים אלא אגב סוטה ומשום דדמיא לנדרים קבעה בתר נדרים מ''ר. ותימה אמאי לא קבעה אגב נדרים דהא בפ''ד [דנזיר] תנא משניות טובא דמיירי בנדרי נשים ובהפרת בעל ויש לומר דעדיפא ליה למימר משום סוטה דפרשיות נמי נסמכו ובריש מסכת שבועות (דף ב:) דייק נמי בכה''ג: המקנא דיעבד אין. וא''ת וכי כל היכא דתני ה''א בתחילתן לשון דיעבד הוא והא קתני בסוף אלו עוברין (פסחים דף מט.) ההולך לשחוט את פסחו ובעבודה זרה פרק השוכר (דף סט.) המניח עובד כוכבים בחנותו דמסיק בשמעתתא קמייתא דשחיטת חולין (דף ג.) דמיירי לכתחילה ובפרק ב' דשחיטת חולין (דף לז.) השוחט את המסוכנת ובפרק קמא דביצה (דף ו:) השוחט את התרנגולת ומצא בה ביצים גמורות ויש לומר דכל היכא דאיכא למיתלי בלישנא דייק הכי כגון הכא ובריש פ''ב דשחיטת חולין (דף כז.) והתם נמי בפ' קמא (דף טו:) השוחט במגל יד ובפ' קמא דביצה (דף ז:) השוחט חיה ועוף יחפור בדקר ובפ' חבית (שבת דף קמז.) הרוחץ במי מערה או במי טבריא ותימה היכי דייק מהכא דאסור לקנאות אמאי לא מתרץ המקנא שבא כדמתרץ בפ''ק דביצה (דף ז:) ועל כרחך אית לן למימר דהכא ממשנה יתירא דייק כדפרש''י: הא בזוג ראשון הא בזוג שני. תימה בפ' ואלו מגלחין (מו''ק דף יח:) דאמר שמואל מותר לארס בחולו של מועד שמא יקדמנו אחר קפריך ליה מהכא ארבעים יום קודם יצירת הולד אמאי לא מוקי התם מלתיה דשמואל בזוג שני: קודם יצירת הולד. נראה לרבי קודם יצירת הזכר בין אם לא נולדה הנקיבה עדיין בין אם נולדה: אבל בטומאה עד אחד מהימן. תימה אדרבה איכא למימר איפכא אבל בטומאה בעינן בי תרי ומשום דאוסרתה איסור עולם ואי לאו ממתני' דמייתי מהיכא פשיטא ליה למימר הכי וי''ל דעדיפא ליה טומאה מקינוי וסתירה אף על גב דאוסרתה איסור עולם משום דרגלים לדבר: (תוספות)";
        assertEquals(text, object.get(JBO_TEXT));

        //masechet 36 daf 25 amud 2
        object = json[36].getObject(0);
        assertEquals("jbr:bavli-36-25-2", object.get(URI));
        assertEquals("bavli-36", object.get(JBO_MASECHET));
        assertEquals("jbr:bavli-perek-36-1", object.get(JBO_PEREK));
        assertEquals("מסכת תמיד כה ב", object.get(RDFS_LABEL));
        assertEquals("1", object.get(JBO_POSITION));
        text = "מתני' בשלשה מקומות הכהנים שומרים בבית המקדש בית אבטינס בית הניצוץ בית המוקד בבית אבטינס ובבית הניצוץ היו עליות הרובים שומרים שם בית המוקד כיפה ובית הגדול היה מוקף רובדין של אבן זקני בית אב ישנים שם ומפתחות העזרה בידם פרחי כהונה איש בארץ לא היו ישנים בבגדי קדש אלא היו פושטין ומניחין אותן תחת ראשיהם ומתכסין בכסות עצמן אירע קרי לאחד מהן יוצא והולך לו";
        assertEquals(text, object.get(JBO_TEXT));
        //masechet 36 daf 25 amud 2 - perush rashi
        object = json[36].getObject(1);
        assertEquals("jbr:bavli-rashi-36-25-2", object.get(URI));
        assertEquals("bavli-36", object.get(JBO_MASECHET));
        assertEquals("jbr:bavli-perek-36-1", object.get(JBO_PEREK));
        assertEquals("רש\"י תמיד כה ב", object.get(RDFS_LABEL));
        assertEquals("1", object.get(JBO_POSITION));
        assertEquals("jbr:bavli-36-25-2", object.get(JBO_INTERPRETS));
        text = "פירוש  מתני' בשלשה מקומות. משום דבעי לאורויי במעשה דתמיד עבודת כהנים נקט תחלה שמירתן ומקום שכיבתן עד שהוא מסדר כל הסדר שבתחלה טובלין וכו' כאשר הוא מסודר במשנה ובגמ' נפקא לן מקרא דבית המקדש צריך שימור דאי לא נפקא לן מקרא הוה אמינא דלא צריכי שומרים דאין עניות במקום עשירות ואי גנבי כלי המקדש קנו אחרים ועוד דהוה אמינא דבחד שומר סגי. ומקום שמירתן היא בבית אבטינס ובבית הניצוץ ובבית המוקד: הכי גרסינן בבית אבטינס ובבית הניצוץ היו עליות. בית אבטינס היא לשכת מפטמי הקטורת כדתנן בפ''ק דיומא (דף יח:) הוליכוהו לעליית בית אבטינס גבי כהן גדול ללמדו לשם הלכות חפינה שהיא אחת מעבודות קשות שבמקדש כדמפרש ביומא (דף מט:) ולפי שהיו אומנין על מעשה הקטרת נקראת על שמם ומספקא לן ביומא במקום עליית בית אבטינס היכן היא דאמרינן בפ''ק דיומא (דף יט.) שתי לשכות היו לכהן גדול לשכת פרהדרין ולשכת בית אבטינס אחת בצפון ואחת בדרום ולא ידענא אי לשכת פרהדרין בצפון ולשכת בית אבטינס בדרום או לשכת בית אבטינס בצפון ולשכת פרהדרין בדרום ושם היה כהן גדול ישן וביומא (דף ח:) מפרש למה נקרא כן: בית הניצוץ. לא שמעתי בו טעם למה נקרא כן: היו עליות. לשמירת כהנים צריך עליות מקום גבוה כדנפקא לן בגמרא וילוו עליך וישרתוך וגזירת הכתוב היא ושמירת לוים לא היתה אלא למטה אצל השערים ולכך קרי ליה הפסוק ללוים שוערים במקרא לפי שלא היתה שמירתן אלא אצל השער והכהנים היו שומרין אותו בעליות על מקום גבוה כדרך שומרי עיר וכל שומרי עיר בין ביום בין בלילה לא היו ישנים. ועשרים וארבעה שומרים בעשרים וארבעה מקומות נפקא לן בגמ' שצריך לבית המקדש שהיו שומרים יום ולילה שלשה בכהנים ועשרים ואחד בלוים ואפילו היו אותן עליות בנויות מקצתן בעזרה יכולים כהנים לישב שם כשהיו עייפים דגגין ועליות לא נתקדשו כדאמרינן בפסחים (דף פה:) ובעזרה אין אדם יכול לישב דאין ישיבה בעזרה אלא למלכי בית דוד: והרובין שומרין שם. רובין קרי כהנים שלא הגיעו עדיין לעשות עבודה כגון פחותים מי''ג שנה כמו (שמואל א ב) ויגדל הנער [ומתרגמינן] ורבא רביא ולפי שעדיין לא הגיעו לעשות עבודה (אין יכולין לעשותה) עבדינן להו שומרים שאותן שיכולין לעבוד אינן רוצין לשמור ועוד הואיל ויכולין לעבוד אין אנו מניחין אותן לשמור: בית המוקד כיפה. בית המוקד פר''ח בפ''ק דיומא (דף טו: ד''ה ואחת) על שם שלא היה האש כבה משם לעולם מפני שהיו נוטלין האש לצורך המזבח דאמרינן בתורת כהנים שמצוה להביא מן ההדיוט שנאמר ונתנו בני אהרן [הכהנים] אש על המזבח אע''פ שהאש יורד מן השמים מצוה להביא מן ההדיוט וביציאות השבת (שבת כ.) תנן ומאחיזין את האור במדורת בית המוקד ערב שבת עם חשיכה דכהנים זריזין הם ולא אתו להבעיר ופירש רש''י להתחמם שם כהנים שהיו הולכים יחפים על גבי רצפת העזרה דאמרינן בזבחים (דף כד.) הואיל וכלי שרת מקדשים ועזרה מקדשת מה מצינו בכלי שרת שלא יהא דבר חוצץ בין ידו לכלי התם נפקא לן מקרא אף עזרה לא יהא דבר חוצץ בינו לבין הרצפה: כיפה. כלומר לשכת בית המוקד ע''ג לשכה של אבנים היתה ובשביל שהכהנים שומרים לשם בנאוה ע''ג כיפה דשמירתן צריך לעשותה ע''ג מקום גבוה כדנ''ל מקרא ובית גדול היה וד' לשכות פתוחות לשם כדאמר לקמן ובמסכת מדות (דף לד.) ד' לשכות פתוחות לבית המוקד כקטוניות פתוחות לטרקלין כלומר כחדרים הפתוחות לבירה וע''י מעלות עולין מהלשכות שמה לבית המוקד ב' בקדש וב' בחול כלומר שתי הלשכות הפתוחות לו ב' מהם בנויות בקדש ובעזרה וב' בחול בהר הבית ובית המוקד בנוי חציו בקדש וחציו בחול וראשי פשפשים קנים מפסיקין בין קדש לחול כדי שיזהרו כהנים ולא ינהגו במקום קדש מנהג חול וא''ת כיון שעל מקום גבוה היה בנוי בית המוקד א''כ הרי הוא חול דגגין ועליות לא נתקדשו תריץ הכיפה היתה שוה לקרקע עזרה לפיכך לא בטלה קדושת כיפה וכהאי גוונא סוגיא אחרת בפסחים (דף כה:) על אותה שמועה של גגין ועליות דאמר התם גגין ועליות לא נתקדשו ופרכינן מיתיבי החלונות ועובי החומה כלפנים ואמרינן בשלמא דחלונות משכחת דקדושות כששוות לקרקע עזרה אלא עובי החומה היכי משכחת לה ומתרצינן כבר שורא פירוש החומה קטנה לפנים מחומה גדולה והיא נמוכה ושוה לקרקע גובה עזרה שקרקע עזרה הולך ועולה במעלות ומה היו משמשות מערבית דרומית היא היתה לשכת טלה קרבן דשם נותנים הטלאים המבוקרים דרומית מזרחית היא היתה לשכת עושי לחם הפנים מזרחית צפונית בה גנזו בית חשמונאי אבני מזבח ששיקצום מלכי יון צפונית מערבית בה יורדים לבית הטבילה טמא יורד דרך אותה לשכה למעיין לטבול ובית המוקד היתה בצפון עזרה כדתניא במסכת מדות (דף לד:): מוקף רובדין של אבן. רובדין כמו יצא והניחו על רובד רביעי שבהיכל (יומא דף מג:) והוא דבר הבולט מן החומה ולכך עשוין שמן הרובדין היו עולין ע''ג מטותיהן שהיו בתוך כניסת החומה כעין מטות: וזקני בית אב ישנים שם. אותם שהיה להם לעבוד למחר היו ישנים בתוך כניסת החומה ולא ארובדין קאי דא''כ ה''ל למימר על גביהם ובגמרא מוכיח שלא על אלו הרובדין היו ישנים דקאמר איצטוותא דקא סלקי בהו לאיצטוותא ומוקף לאו דווקא אלא אותו בית המוקד שבנוי בחול היה מוקף רובדין של אבן כדי לעלות במטות שהן בתוך החומה דבמקום חול היו ישנים ולא במקום קדוש דראשי פשפשין מבדילין בין קדש לחול כדי שלא ינהגו בקדש מנהג חול: ומפתחות [העזרה] בידם. כלומר בידי אותם כהנים לשם היו מונחות כל מפתחות העזרה ומפרש במסכת מדות (דף לד:) היכן היתה הנחתן מקום היה שם אמה על אמה בלשכת בית המוקד וטבלא של שיש באותו מקום וטבעת היתה קבועה ומגביהין אותן ע''י אותן הטבעות הגיע זמן הנעילה הגביה את הטבלא מן הטבעות על ידי טבעת אי נמי ע''י אותן הטבעות היתה הטבלא נטולה בארץ וכשרוצין להגביה מגביהין אותה מן הטבעת נוטל את המפתחות מן השלשלת המפתחות נתונין תחת אותה טבלא בשלשלת ונעל הכהן בפנים שערי עזרה ובן לוי ישן לו מבחוץ גמר מלנעול החזיר המפתחות למקומן תחת הטבלא ונותן עליו כסות שלו וישן על אותו טבלא: ופרחי כהונה איש כסותו בארץ. פרחי כהונה בחורים שהגיעו לעבודה איש כסותו בארץ כסות שלו בארץ שלא היה להם כניסה בחומה ומטות נמי לאו אורח ארעא לעיולי התם כדמפרש בגמ': ולא היו ישנים בבגדי קדש. בגמ' מפרש טעמא אלא פושטין ומקפלין אותן תחת ראשיהם לא כנגד ראשיהם: ומתכסים בכסות עצמן. בגדי חול: אירע קרי לאחד מהם. סדר מעשיהם מפרש: (רש\"י)";
        assertEquals(text, object.get(JBO_TEXT));

        //masechet 37 daf 72 amud 2
        object = json[37].getObject(json[37].subjects.size()-4);
        assertEquals("jbr:bavli-37-72-2", object.get(URI));
        assertEquals("bavli-37", object.get(JBO_MASECHET));
        assertEquals("jbr:bavli-perek-37-10", object.get(JBO_PEREK));
        assertEquals("מסכת נדה עב ב", object.get(RDFS_LABEL));
        assertEquals("142", object.get(JBO_POSITION));
        text = "ותניא המסיט את הראייה ב''ש אומרים תולין וב''ה מטהרין משכבות ומושבות שבין ראייה ראשונה לראייה שנייה ב''ש תולין וב''ה מטהרין וקתני רישא הרואה ראייה אחת של זוב ב''ש אומרים כשומרת יום כנגד יום אלמא שומרת יום כנגד יום לב''ש תולין לא תימא שומרת יום כנגד יום אלא אימא כבועל שומרת יום כנגד יום מאי שנא איהו דלא מטמא משכב ומושב ומאי שנא איהי דמטמיא ליה איהו דלא שכיחי ביה דמים לא גזור ביה רבנן איהי דשכיחי בה דמים גזור בה רבנן ומאי שנא משכב ומושב דמטמיא ליה ומאי שנא בועל דלא מטמיא ליה משכב ומושב דשכיח מטמיא ליה בועל דלא שכיח לא מטמיא תנן טבלה יום שלאחריו ושמשה הרי זו תרבות רעה מגען ובעילתן תלויין מאי לאו דברי הכל היא לא ב''ה היא דתניא אמר להם רבי יהודה לב''ה וכי לזו אתם קורין תרבות רעה והלא לא נתכוון זה אלא לבעול את הנדה נדה ס''ד אלא אימא לבעול את הזבה זבה ס''ד אלא אימא לבעול שומרת יום כנגד יום איתמר עשירי רבי יוחנן אמר עשירי כתשיעי מה תשיעי בעי שימור אף עשירי בעי שימור ר''ל אמר עשירי כאחד עשר מה אחד עשר לא בעי שימור אף עשירי לא בעי שימור איכא דמתני לה אהא אמר לו רבי אלעזר בן עזריה לר''ע אפי' אתה מרבה בשמן [בשמן] כל היום כולו איני שומע לך אלא חצי לוג שמן לתודה ורביעית יין לנזיר ואחד עשר יום שבין נדה לנדה הלכה למשה מסיני מאי הלכה ר' יוחנן אמר הלכה י''א ר''ל אומר הלכות אחד עשר ר' יוחנן אמר הלכה אחד עשר אחד עשר הוא דלא בעי שימור הא לאחריני עביד שימור ור''ל אמר הלכות אחד עשר לא אחד עשר בעי שימור ולא שימור לעשירי הוי הני הלכות נינהו הני קראי נינהו דתניא יכול הרואה ג' ימים בתחילת נדה רצופים תהא זבה ומה אני מקיים {ויקרא טו-יט} אשה כי תהיה זבה דם יהיה זובה ברואה יום אחד (אבל הרואה ג' ימים בתחילה תהיה זבה) תלמוד לומר";
        assertEquals(text, object.get(JBO_TEXT));
        //masechet 37 daf 72 amud 2 - perush rashi
        object = json[37].getObject(json[37].subjects.size()-3);
        assertEquals("jbr:bavli-rashi-37-72-2", object.get(URI));
        assertEquals("bavli-37", object.get(JBO_MASECHET));
        assertEquals("jbr:bavli-perek-37-10", object.get(JBO_PEREK));
        assertEquals("רש\"י נדה עב ב", object.get(RDFS_LABEL));
        assertEquals("142", object.get(JBO_POSITION));
        assertEquals("jbr:bavli-37-72-2", object.get(JBO_INTERPRETS));
        text = "רש\"י  ותניא. בזב בראייה ראשונה: המסיט את הראייה. טהור שהסיט את הטפה ראשונה: ב''ש אומרים תולין. אם יחזור הזב ויראה היום שנים נמצא זב גמור למפרע וזוב מטמא במשא: וב''ה מטהרין. כמסיט את הקרי דלא מטמא במשא: משכבות ומושבות כו'. אלמא מדמקשי ב''ש ראייה ראשונה לשומרת יום וקתני משכב ומושב של בין ראייה ראשונה לשניה תולין אלמא משכב ומושב דשומרת יום בשני שלה תולין ואם לא תראה טהורה ודוקא בשני אבל בראשון לא סלקא לה טבילה עד שתשמור קצת שני וכל זמן שלא טבלה זבה היא: אלא אימא כבועל שומרת יום. דמודה רב הונא בבעילה בשני לאחר טבילתה שהיא תולה כל זמן שלא ראתה ואין טומאתה עליו אפילו מדרבנן: מאי שנא איהו. בועל: דלא מטמא משכב ומושב. דיליה ומאי שנא איהי דמטמאה: איהו דלא שכיח ביה דמים לא גזרו ביה רבנן. לטמא משכב ומושב כל זמן שלא ראתה לאחר תשמיש: ומאי שנא משכב ומושב. כיון דאמרת איהי דשכיחי בה דמים גזרו בה רבנן מאי שנא בועל דלא גזרו ביה רבנן שתטמאנו: דברי הכל. ואפילו ב''ש וקתני בשני שבתוך י''א מגעה תלוי וקשיא לרב הונא: עשירי. אין לו צרוף לזיבה שאין מצטרף עמו אלא י''א דהוי להו תרי: כתשיעי. דפשיטא לן ביה דבעי שימור אם ראתה בו דהא ראוי להביאה לידי זבה גמורה: אף עשירי. אם התחילה לראות בו: בעי שימור. י''א כנגדו אע''ג דאינה ראויה לבא לידי זבה גמורה: כי''א. לב''ה דאמרי לא בעי שימור: בשמן בשמן. גבי רבוכה של תודה במנחות בפ' ב' מדות (דף פט.) דכתיב והקריב על זבח התודה וכתיב תלתא בשמן ותניא אילו נאמר בשמן הייתי אומר כל המנחות ללוג ת''ל בשמן בשמן דחלות ורקיקין הוי ריבוי אחר ריבוי למעט לחצי לוג: איני שומע לך. ללמד דבר זה מן המקרא שהלכה למשה מסיני על פה הוא: שבין נדה לנדה. בין סוף נדה לתחילת נדה משכלו ימי נדה אינה חוזרת להיות נדה לישב לראייה אחת ששה והוא עד שיכלו י''א יום: מאי הלכה. דמשמע איום י''א קאמר רבי אלעזר בן עזריה דהוי הלכה למשה מסיני ובעי הש''ס מאי הלכותיו משאר הימים שלפניו: הלכה י''א. בדבר אחד הוא חלוק משלפניו: הלכות י''א. בשני דברים הוא חלוק: שימור לאחריני. לעשירי: לא איהו בעי שימור. מדאורייתא לשמור י''א כנגדו ולא לאחריני הוי שימור דעשירי לא בעי שימור מדאורייתא הואיל ולא תבא בהן לידי זיבה ומדרבנן מיהא אפילו רואה יום י''א אסורה לשמש ביום שלאחריו כדקתני מתני' ה''ז גרגרן ואמרינן בפרק בא סימן (לעיל דף נד.) גרגרן דתנן אסור: יכול הרואה ג' ימים בתחלת נדה רצופים תהא זבה. לספירת ז' נקיים ולקרבן דכתיב (ויקרא טו) ימים רבים וקמצריך לה ספירה וקרבן: מה אני מקיים ואשה כי תהיה זבה. האמור בפרשה ראשונה שלא הצריכה ספירת נקיים וקרבן: ברואה יום אחד. אבל ראתה ג' תהא זבה: תלמוד לומר. בפרשה שניה: (רש\"י)";
        assertEquals(text, object.get(JBO_TEXT));
        //masechet 37 daf 72 amud 2 - perush tosafot
        object = json[37].getObject(json[37].subjects.size()-2);
        assertEquals("jbr:bavli-tosafot-37-72-2", object.get(URI));
        assertEquals("bavli-37", object.get(JBO_MASECHET));
        assertEquals("jbr:bavli-perek-37-10", object.get(JBO_PEREK));
        assertEquals("תוספות נדה עב ב", object.get(RDFS_LABEL));
        assertEquals("142", object.get(JBO_POSITION));
        assertEquals("jbr:bavli-37-72-2", object.get(JBO_INTERPRETS));
        text = "תוספות  אלא אימא כבועל שומרת יום כנגד יום. וקשה דא''כ מסקינן דשומרת יום כנגד יום בשני שלה אין בועלה מטמא משכב ומושב והא תניא טבלה ביום שלאחריו ושמשה את ביתה ואח''כ ראתה מטמאין משכב ומושב ומטמאין משמע לשון רבים דקאי אתרווייהו היא ובועלה וליכא למימר ראתה שאני דהא מתרצא מילתא דרב יוסף ואידחי רב כהנא וי''ל דהך מסקנא דהכא ליישובי מילתא דרב הונא אתא דלא תקשי ליה מברייתא ומיהו מילתא דרב יוסף אדחי וניחא נמי טפי לרב הונא דלא תקשי מאי קמ''ל דודאי ראתה שאני כדמתרץ אביי מילתיה דרב כהנא וסבר רב הונא דלענין בועלה דלא שכיח אית לן למימר ראתה שאני אבל איהי דשכיחי בה דמים אפי' לא ראתה גזרינן אטו ראתה כי היכי דגזרינן ראתה ביום י''ב אטו ראתה תוך י''א ואע''ג דראיית י''ב אינה סותרת ועוד אור''י דאפילו קיימא מילתא דרב יוסף ניחא דלא קשה ממתני' דודאי ביום שלאחריו דהיינו ביום י''ב דשכיח בועל גבה דליכא איסור דאורייתא מטמא בועל משכב ומושב אע''ג דלא ראתה אבל תוך י''א יום בשני שלה אע''ג דגבי דידה לא מפלגינן בין ראתה ללא ראתה מ''מ בועל אינו מטמא משכב ומושב אלא בראתה: מאי שנא איהו. פי' בקונטרס מאי שנא בועל דלא מטמא משכב ומושב ותימה דהיינו האי דפריך בתר הכי מאי שנא בועל דלא מטמא משכב ומושב וי''ל דמעיקרא פריך משום לתאי דידיה וכי משני דלא שכיח ביה דמים פריך ולטמא משום לתאי דידה ור''י מפרש מ''ש דאיהו רואה ראייה אחת של זוב דתולין משכבות ומושבות שבין ראשונה לשניה ואין מטמא אלא ע''י תלייה אם יראה ואם לא יראה טהורין ומאי שנא איהי דכי רואה תוך י''א יום דמטמאה משכב ומושב ואע''ג דלא ראתה לרב הונא מיהו לא דמי דהתם משום דכי ראתה סתרה ולכך החמירו בלא ראתה אבל זב אפילו יראה לא יסתור לכך נראה מאי שנא איהי דכי טבלה יום שלאחר י''א יום ושמשה וראתה דמטמא משכב ומושב בלא תלייה אע''ג דהתם נמי אין סתירה ולהאי פירוש דפרשינן דראתה לאו דוקא פריך אבל לאידך פירושא דאמרינן ראתה שאני אבל לא ראתה תולין שוין איהו ואיהי: אלא חצי לוג שמן לתודה ורביעית יין לנזיר. נראה דהכי שמע מרביה וגרסינהו א''נ ר''ע חלק עליו מכל שלשה אלה כדאמר לקמן גבי אחד עשר יום הלכתא לר' אלעזר בן עזריה קראי לרבי עקיבא והוא הדין נמי דבשלישי פליג אע''ג דלא אשכחן: רבי יוחנן אמר הלכה אחד עשר. תימה במאי פליגי ר' יוחנן ור''ל הא רבי אלעזר בן עזריה לא איירי אלא בחשבון הימים שבתוך אחד עשר דשייכא בהו זיבה אבל בשימור אחד עשר לא איירי כלל וכן משמע מדפריך לקמן הני קראי נינהו ואי איהו איירי בהלכתא אחד עשר לישני קרא למנין הימים שהיא זבה והלכתא לשימור אחד עשר ויש לומר דודאי הלכה דקאמר רבי אלעזר בן עזריה לא איירי אלא במנין הימים דשייכי בהו זיבה ורבי יוחנן ור''ל בסברא בעלמא פליגי דרבי יוחנן קאמר כיון דיום שאחר י''א הוא נדות אין י''א צריך ספירה ור''ל סבר דאפילו שימור אינו נעשה לעשירי כיון דאינו ראוי להצטרף לזיבה גדולה דליכא אלא ב' ימים והשתא ניחא דהש''ס פריך שפיר קראי נינהו: (תוספות)";
        assertEquals(text, object.get(JBO_TEXT));
        //masechet 37 daf 73 amud 1
        object = json[37].getObject(json[37].subjects.size()-1);
        assertEquals("jbr:bavli-37-73-1", object.get(URI));
        assertEquals("bavli-37", object.get(JBO_MASECHET));
        assertEquals("jbr:bavli-perek-37-10", object.get(JBO_PEREK));
        assertEquals("מסכת נדה עג א", object.get(RDFS_LABEL));
        assertEquals("143", object.get(JBO_POSITION));
        text = "{ויקרא טו-כה} בלא עת נדתה (על נדתה) סמוך לנדתה ואין לי אלא סמוך לנדתה מופלג לנדתה יום אחד מנין ת''ל {ויקרא טו-כה} או כי תזוב אין לי אלא יום אחד מנין לרבות מופלג שנים שלשה ארבעה חמשה ששה ושבעה שמונה תשעה עשרה מנין אמרת מה מצינו ברביעי שראוי לספירה וראוי לזיבה אף אני אביא העשירי שראוי לספירה וראוי לזיבה ומנין לרבות אחד עשר ת''ל בלא עת נדתה יכול שאני מרבה אף שנים עשר אמרת לאו ומה ראית לרבות אחד עשר ולהוציא שנים עשר מרבה אני אחד עשר שראוי לספירת או כי תזוב ומוציא אני י''ב שאין ראוי לספירת או כי תזוב ואין לי אלא שלשה ימים שני ימים מנין ת''ל ימי יום אחד מנין ת''ל כל ימי טמאה מלמד שמטמאה את בועלה כנדה היא היא מטמאה את בועלה ואין הזב מטמא מה שהוא בועל והלא דין הוא ומה היא שאינה מטמאה בראיות כבימים מטמאה את בועלה הוא שמטמא בראיות כבימים אינו דין שמטמא מה שהוא בועל ת''ל היא היא מטמאה את בועלה ואין הזב מטמא מה שהוא בועל ומנין שהוא עושה משכב ומושב ת''ל {ויקרא טו-כו} כמשכב נדתה ואין לי אלא שלשה ימים שני ימים מנין ת''ל ימי יום אחד מנין ת''ל כל ימי ומנין שסופרת אחד לאחד ת''ל יהיה לה יכול תספור שבעה לשנים ודין הוא ומה הוא שאין סופר אחד לאחד סופר שבעה לשנים היא שסופרת אחד לאחד אינו דין שתספור שבעה לשנים ת''ל יהיה לה אינה סופרת אלא יומה אלמא קראי נינהו לר''ע קראי לר' אלעזר בן עזריה הלכתא א''ל רב שמעיה לר' אבא אימא ביממא תהוי זבה בליליא תהוי נדה א''ל עלך אמר קרא {ויקרא טו-כה} על נדתה סמוך לנדתה סמוך לנדתה אימת הוי בליליא וקא קרי לה זבה תנא דבי אליהו כל השונה הלכות בכל יום מובטח לו שהוא בן העולם הבא שנאמר {חבקוק ג-ו} הליכות עולם לו אל תקרי הליכות אלא הלכות:";
        assertEquals(text, object.get(JBO_TEXT));

        System.out.print("Success! :)\n");
    }

    @Test
    public void testSpecificPackages() {
        System.out.print("testSpecificPackages: ");
        Map<String, String> object;
        String text;
        //masechet 1
        object = packageJson[1].getObject(0);
        assertEquals("jbr:bavli-1", object.get(URI));
        assertEquals("מסכת ברכות", object.get(RDFS_LABEL));
        assertEquals("1", object.get(JBO_POSITION));
        //masechet 1 perek 3
        object = packageJson[1].getObject(3);
        assertEquals("jbr:bavli-perek-1-3", object.get(URI));
        assertEquals("פרק שלישי - מי שמתו", object.get(RDFS_LABEL));
        assertEquals("3", object.get(JBO_POSITION));
        /*//masechet 1 daf 60
        object = packageJson[1].getObject(68);
        assertEquals("jbr:bavli-1-60", object.get(URI));
        assertEquals("ס", object.get(RDFS_LABEL));
        assertEquals("60", object.get(JBO_POSITION));
        */

        //masechet 4
        object = packageJson[4].getObject(0);
        assertEquals("jbr:bavli-4", object.get(URI));
        assertEquals("מסכת פסחים", object.get(RDFS_LABEL));
        assertEquals("4", object.get(JBO_POSITION));

        //masechet 7 perek 2
        object = packageJson[7].getObject(2);
        assertEquals("jbr:bavli-perek-7-2", object.get(URI));
        assertEquals("פרק שני - הישן תחת המטה", object.get(RDFS_LABEL));
        assertEquals("2", object.get(JBO_POSITION));
/*
        //masechet 14 daf 33
        object = packageJson[14].getObject(35);
        assertEquals("jbr:bavli-14-33", object.get(URI));
        assertEquals("לג", object.get(RDFS_LABEL));
        assertEquals("33", object.get(JBO_POSITION));
*/
        //masechet 19
        object = packageJson[19].getObject(0);
        assertEquals("jbr:bavli-19", object.get(URI));
        assertEquals("מסכת קידושין", object.get(RDFS_LABEL));
        assertEquals("19", object.get(JBO_POSITION));

        //masechet 25 perek 8
        object = packageJson[25].getObject(8);
        assertEquals("jbr:bavli-perek-25-8", object.get(URI));
        assertEquals("פרק שמיני - ארבעה שומרין", object.get(RDFS_LABEL));
        assertEquals("8", object.get(JBO_POSITION));
/*
        //masechet 31 daf 41
        object = packageJson[31].getObject(46);
        assertEquals("jbr:bavli-31-41", object.get(URI));
        assertEquals("מא", object.get(RDFS_LABEL));
        assertEquals("41", object.get(JBO_POSITION));

        //masechet 36 daf 33
        object = packageJson[36].getObject(packageJson[36].subjects.size()-3);
        assertEquals("jbr:bavli-36-33", object.get(URI));
        assertEquals("לג", object.get(RDFS_LABEL));
        assertEquals("33", object.get(JBO_POSITION));

        //masechet 37 daf 73
        object = packageJson[37].getObject(packageJson[37].subjects.size()-1);
        assertEquals("jbr:bavli-37-73", object.get(URI));
        assertEquals("עג", object.get(RDFS_LABEL));
        assertEquals("73", object.get(JBO_POSITION));
*/
        System.out.print("Success! :)\n");

    }

    private int numOfObjectsForMasechet(int masechetNum) {
        int objectsPerMasechet[] = {-1, 390, 988, 648, 775, 210, 530, 341, 242, 186, 191, 168, 159, 758, 691, 653, 411,
                                    310, 551, 493, 723, 725, 1064, 678, 142, 305, 459, 54, 796, 733, 860, 375, 214, 203,
                                    176, 135, 46, 441};
        return objectsPerMasechet[masechetNum];
    }

    private int numOfObjectsForMasechetPackage(int masechetNum){
        int numOfPrakimPerMasechet[] = {-1, 9, 24, 10, 10, 4, 8, 5, 5, 4, 4, 3, 3, 16, 13, 11, 9, 9, 9, 4, 10, 10, 10,
                                        11, 3, 8, 5, 3, 14, 13, 12, 9, 9, 7, 6, 6, 7, 10};
        int numOfDapimPerMasechet[] = {-1, 63, 156, 104, 120, 34, 87, 55, 39, 30, 31, 28, 26, 121, 111, 90, 65, 48, 89,
                                      81, 118, 118, 175, 112, 23, 48, 75, 13, 119, 109, 141, 60, 33, 33, 27, 21, 9, 72};
        return 1 + numOfPrakimPerMasechet[masechetNum]; //+ numOfDapimPerMasechet[masechetNum];
    }


}
