package text2json;

/**
 * Created by omishali on 12/02/2017.
 */
public class JbsUtils {
    public static final String[] MEFARSHIM_HE = {"רש\"י", "הרמב\"ן", "אור החיים", "אבן עזרא", "בעל הטורים" , "אונקלוס", "ספורנו", "כלי יקר",
            "דעת זקנים", "מצודת דוד", "מצודת ציון", "מלבי\"ם - באור הענין", "מלבי\"ם - באור המלות", "רלב\"ג", "מלבי\"ם",
            "יונתן", "שפתי חכמים"};
    public static final String[] SFARIM_TANACH_HE = {"בראשית","שמות","ויקרא","במדבר","דברים","יהושע","שופטים","שמואל א","שמואל ב","מלכים א",
            "מלכים ב","ישעיהו","ירמיהו","יחזקאל","יהושע","יואל","עמוס","עובדיה","יונה","מיכה","נחום","חבקוק","צפניה","חגי","זכריה","מלאכי",
            "תהלים","משלי","איוב","שיר השירים","רות","איכה","קהלת","אסתר","דניאל","עזרא","נחמיה","דברי הימים א","דברי הימים ב"};
    public static final String[] PARASHOT_HE = {"בראשית","נח","לך לך","וירא","חיי שרה","תולדות","ויצא","וישלח","וישב","מקץ","לחנוכה","ויגש","ויחי","שמות","וארא","בא","בשלח","יתרו","משפטים","פרשת שקלים","תרומה","תצוה","פרשת זכור","לפורים","כי תשא","פרשת פרה","ויקהל","פקודי","ויקרא","פרשת החודש","צו","לשבת הגדול","פסח","שמיני","תזריע","מצורע","אחרי מות","קדושים","אמור","בהר","בחוקתי","במדבר","שבועות","נשא","בהעלותך","שלח","קרח","חקת","בלק","פנחס","מטות","מסעי","דברים","ואתחנן","עקב","ראה","שופטים","כי תצא","כי תבוא","נצבים","וילך","לחודש אלול","ראש השנה","שבת תשובה","ליום כיפור","האזינו","לסוכות","וזאת הברכה"};
    public static final String[] HEB_LETTERS_INDEX = {"א", "ב", "ג", "ד", "ה", "ו", "ז", "ח", "ט", "י", "יא", "יב", "יג", "יד", "טו"
            , "טז", "יז", "יח", "יט", "כ", "כא", "כב", "כג", "כד", "כה", "כו", "כז", "כח", "כט", "ל", "לא", "לב", "לג", "לד", "לה"
            , "לו", "לז", "לח", "לט", "מ", "מא", "מב", "מג", "מד", "מה", "מו", "מז", "מח", "מט"};
}
