package text2json;

/**
 * Created by omishali on 12/02/2017.
 */
public class JbsUtils {
    public static final String[] MEFARSHIM_HE = {"רש\"י", "הרמב\"ן", "אור החיים", "אבן עזרא", "בעל הטורים" , "אונקלוס", "ספורנו", "כלי יקר",
            "דעת זקנים", "מצודת דוד", "מצודת ציון", "מלבי\"ם - באור הענין", "מלבי\"ם - באור המלות", "רלב\"ג", "מלבי\"ם",
            "יונתן", "שפתי חכמים"};
    public static final String[] PARASHOT_HE = {"פרשת בראשית", "פרשת נח", "פרשת לך לך", "פרשת וירא", "פרשת חיי שרה" ,"פרשת תולדות" ,"פרשת ויצא",
            "פרשת וישלח", "פרשת וישב", "פרשת מקץ", "פרשת ויגש", "פרשת ויחי", "פרשת שמות", "פרשת וארא", "פרשת בא",
            "פרשת בשלח", "פרשת יתרו", "פרשת משפטים", "פרשת תרומה", "פרשת תצוה", "פרשת תשא כי", "פרשת ויקהל", "פרשת פקודי",
            "פרשת ויקרא", "פרשת צו", "פרשת שמיני", "פרשת תזריע", "פרשת מצורע", "פרשת אחרי מות", "פרשת קדושים", "פרשת אמור",
            "פרשת בהר", "פרשת בחקתי", "פרשת במדבר", "פרשת נשא", "פרשת בהעלתך", "פרשת שלח לך", "פרשת קרח", "פרשת חקת",
            "פרשת בלק", "פרשת פינחס", "פרשת מטות", "פרשת מסעי", "פרשת דברים", "פרשת ואתחנן", "פרשת עקב", "פרשת ראה",
            "פרשת שופטים", "פרשת כי תצא", "פרשת כי תבוא", "פרשת נצבים", "פרשת וילך", "פרשת האזינו", "פרשת וזאת הברכה"};
    public static final String[] HEB_LETTERS_INDEX = {"א", "ב", "ג", "ד", "ה", "ו", "ז", "ח", "ט", "י", "יא", "יב", "יג", "יד", "טו"
            , "טז", "יז", "יח", "יט", "כ", "כא", "כב", "כג", "כד", "כה", "כו", "כז", "כח", "כט", "ל", "לא", "לב", "לג", "לד", "לה"
            , "לו", "לז", "לח", "לט", "מ", "מא", "מב", "מג", "מד", "מה", "מו", "מז", "מח", "מט"};
}
